{"Tomatoes": {"Sunlight Conditions": "full sun", "Plant Lifecycle": "annual", "Plant Care Difficulty": "moderately difficult", "Height": "2 to 6 feet", "Spread": "2 to 6 feet", "Optimal Germination Temperature": "60 F to 95 F       - Germinates best at 75 F to 90 F.  Germinates very slowly at cooler temperatures.", "Time to Germination": "Days to emergence: 6 to 12       - About 1 week at 75 F.", "Soil Depth": "3 Inches", "Full Summary": ["Tomatoes", "Vegetable (Warm Season) - Tomatoes, Peppers, Eggplant", "Lycopersicon esculentum", "Solanaceae Family", "The most popular garden vegetable crop, tomatoes come in a wide rangeof sizes, shapes and colors. Choose determinate varieties for earlyharvest or cool conditions. Compact varieties are also good choices forcontainers and planting in flower beds.", "Site and Plant Characteristics", "Growing Information", "Varieties", "Site Characteristics", "Sunlight:", "full sun", "Tomatoes need at least 8 hours of direct sun daily.", "Soil conditions:", "tolerates acid soil", "requires well-drained soil", "Prefers well-drained, fertile soil, high in organic matter. Clays andloams produce the highest yields. But lighter soils that drain and warmquickly can produce earlier harvests -- particularly if they are on aslight slope to the south or southeast. Can tolerate slightly acidsoils, as low as pH 5.5. But produces best when pH is 6.0 to 6.8.Consistent moisture needed to prevent blossom end rot, but does nottolerate waterlogged soils.", "Special locations:", "outdoor containers - Small, determinate or miniature varieties work best.  Requires frequent watering.", "Plant Traits", "Lifecycle:", "annual", "Tender annual", "Ease-of-care:", "moderately difficult", "Requiresgood soil, even moisture. Very labor intensive if you stake, prune oruse plastic mulch and row covers. Easier if you purchase plants.Difficult if you start from seed.", "Height:", "2 to 6 feet", "Staked and pruned plants can grow to well over 6 feet tall in favorable growing seasons.", "Spread:", "2 to 6 feet", "Stakedand pruned plants can be trained to narrow spreads. Plants left tosprawl can spread 6 feet or more. If space is limiting, use smallerdeterminate varieties.", "Bloom time:", "mid-summer", "late summer", "early fall", "Flower color:", "yellow", "Foliage color:", "medium green", "Foliage texture:", "medium", "Shape:", "spreading mass", "upright", "climbing / vine", "Unstakeddeterminate varieties can form an upright bushy plant. Indeterminatevarieties will sprawl in a mass over the ground, or can be trained intoan upright vine when tied to a stake.", "Shape in flower:", "same as above", "Special Considerations", "Special characteristics:", "native to North America - Tomatoes were probably domesticated in Mexico and the eastern Andes in South America.", "Special uses:", "edible landscaping - Small determinate and semi-determinate varietiessuch as Super Bush work well. This early semi-determinate varietyrequires no staking, pruning or caging. Mature plants grow about 3 feettall with a 3-foot spread.", "Growing Information", "How to plant:", "Propagate by  seed", "Germination temperature: 60 F to 95 F - Germinates best at 75 F to 90 F.  Germinates very slowly at cooler temperatures.", "Days to emergence: 6 to 12 - About 1 week at 75 F.", "Maintenance and care:", "If you purchase transplants, look for sturdy, short, dark green plants.Avoid plants that are tall, leggy, or yellowish, or have startedflowering. Transplants that are too mature often stall aftertransplanting while younger, smaller plants pass them by, producingearlier and more fruit.", "Startingyour own plants from seed gives you more choices of which variety togrow. But if you start your own plants, be sure you have a place wherethey can get enough light. Even a sunny, south-facing window is barelyadequate. Consider using a grow light to supplement sunlight.", "Don’tstart plants too early. Sow seeds indoors 6 to 8 weeks beforetransplanting outside. Plant them 1/8 inch deep in sterile seedstarting mix in flats or cells. Seeds germinate best at 75 F to 90 F.Then grow transplants at about 70 F.", "Don’t rush to transplant,either. Cold soil and air temperatures can stress plants. Wait at leasta week or two after the last frost. Nighttime temperatures should beconsistently above 45 F. Use black plastic mulch to warm soil and/orrow covers, hot caps or other protection to keep plants warm early inthe season. Remove covers whenever temperatures exceed 85 F.", "Hardenoff plants before transplanting by reducing water and fertilizer, notby exposing to cold temperatures, which can stress them and stuntgrowth. Transplants exposed to cold temperatures (60 F to 65 F day and50 F to 60 F night) are more prone to catfacing.", "Space transplants:", "12 to 24 inches apart for determinate varieties", "14 to 20 inches apart for staked indeterminate varieties", "24 to 36 inches apart for unstaked indeterminate varieties", "Unlikemost plants, tomatoes do better if planted deeper than they were grownin containers. Set them in the ground so that the soil level is justbelow the lowest leaves. Roots will form along the buried stem,establishing a stronger root system.", "To reduce root disease risk,don't plant on soils that have recently grown tomatoes, potatoes,peppers or eggplant for at least two years.", "Mulch plants afterthe soil has warmed up to maintain soil moisture and suppress weeds.Tomatoes need a consistent supply of moisture. If it rains less than 1inch per week, water to make up the difference.", "Many factors (inaddition to your choice of variety) affect total yield, first harvestand fruit quality. Raised beds, black plastic mulch and providingconsistent moisture by watering or through drip irrigation are goodways to improve all three.", "How you provide support to plants canalso affect performance. Determinate varieties do not need staking. Butstaking and pruning indeterminate varieties can hasten first harvest bya week or more, improve fruit quality, keep fruit cleaner, and makeharvest easier. Staking and pruning usually reduces total yield, butfruits will tend to be larger. Staked and pruned plants are also moresusceptible to blossom end rot and sunscald. Allowing indeterminatevarieties to sprawl reduces labor, but takes up more space and plantsare more prone to disease.", "Wooden tomato stakes are typicallyabout 6 feet long and 1 ½ inch square, but you can use similarmaterials. Drive stakes at least 8 to 10 inches deep at or soon aftertransplanting so as not to damage roots.", "Prune tomatoes to one ortwo vigorous stems by snapping off “suckers” (stems growing from whereleaf stems meet the main stem) when they are 2 to 4 inches long. Tiestems to stake with soft string, twine or cloth, forming a figure-8with the stem in one loop and the stake in the other. This gives thestem room to expand without being constricted. Start about 8 to 12inches above the ground and continue to tie at similar intervals as theplant grows. As an alternative to using individual stakes, grow severalplants in a row between heavy-duty stakes or posts spaced about 4 feetapart, and use twine to weave in and out around posts and plants.", "Growingtomatoes in cages is a good compromise between labor-intensive stakingand just letting them sprawl. You can purchase tomato cages at yourlocal garden center, or simply bend a 6-foot-long piece of 4- to 6-inchwire mesh into a cylinder about 22 inches in diameter. (Cattle fencingor concrete reinforcing wire mesh work well for this.) Place cagearound plants soon after transplanting and anchor with stakes.", "Avoidexcessive N applications, which can cause excessive foliage and poorfruit set. Also avoid using fresh manure or high nitrogen fertilizers(those with three or more times nitrogen than phosphorus or potassium).Poor fruit set can also be caused by heavy rainfall or temperaturesthat are either too high (above 90 F) or too low (below 55 F).", "Onmost soils, you can sidedress about 1/2 cup of 5-10-5 per plant andwork shallowly into the top inch of soil when fruits are about 1 inchin diameter and again when harvest begins.", "To avoid other common tomato problems:", "Keepsoil evenly moist to prevent blossom end rot. This can also helpprevent cracking when fruit absorbs water too fast after heavy rainfollowing dry conditions.", "Do not remove leaves that shade fruit to prevent sunscald.", "Catfacing(misshapen, deformed fruit) is caused by incomplete pollination,usually due to cold weather. Don’t rush to transplant until weather hasstabilized and soil is warm.", "Pests:", "Tomato hornworms - Hand pick larvae.  This pest is frequently controlled by natural enemies.", "Aphids- A hard stream of water can be used to remove aphids from plants. Washoff with water occasionally as needed early in the day. Check forevidence of natural enemies such as gray-brown or bloated parasitizedaphids and the presence of alligator-like larvae of lady beetles andlacewings.", "Whiteflies - Do not purchase whitefly-infested transplants.  Inspect carefully before purchasing.", "Colorado potato beetle - Handpick and destroy beetles, eggs and larvae.", "Cutworms - Control weeds.  Cardboard collars around each plant give good protection.", "Fleabeetles - Use row covers to help protect plants from early damage. Usein place at planting and remove before temperatures get too hot.Control weeds.", "Diseases:", "Blossom end rot - Water during drought or mulch to keep moisture levelconstant. Grow on soil high in organic matter. Fertilize properly.Avoid cultivating close to plants.", "Catface - Grow locally recommended varieties and provide adequate fertilizer and water for vigorous growth.", "Earlyblight, Septoria leaf spot - Locate new plants in a part of the gardendifferent from previous year's location. Avoid wetting foliage ifpossible. Water early in the day so aboveground plant parts will dry asquickly as possible. Avoid crowding plants. Space apart to allow aircirculation. Eliminate weeds around plants and garden area to improveair circulation. Practice plant sanitation. When plants are not wet,carefully remove and destroy affected plant parts. In autumn, rake anddispose of all diseased leaves and stalks. Septoria occurs early in theseason, preferring cool, wet weather. Use clean transplants and removelower infected leaves.", "Late blight - Use same cultural controlstrategies as above. The fungus that causes late blight has recentlybecome a major threat to home gardens and commercial growers because ofmigration of new more aggressive strains (genotypes) into the UnitedStates.   Verification of late blight diagnosis andimplementation of prompt control measures are hightly recommended.Cultural controls mentioned above may not adequately control these newstrains.", "Fusarium wilt - Use same cultural control strategiesas above. Plant resistant varieties such as Pik-Red, Better Boy, Duke,Freedom, Supersonic, Jet Star, Springset and Floramerica.", "Verticilliumwilt - Use same cultural control strategies as above. Plant resistantvarieties such as Supersonic, Jackpot, Basketvee, Sunny, Jet Star andSpringset.", "Varieties", "Browse", "tomato varieties", "at our", "Vegetable Varieties for Gardeners", "website.", "Youwill find hundreds of varieties to choose from in seed catalogs and atgarden centers. (It's estimated that there are 25,000 to 40,000varieties worldwide.) When choosing what to grow from seed or whenpurchasing plants at the garden center, consider:", "Days to harvest:", "This is roughly how long after transplanting (not seed planting) youcan expect first ripe fruit. Keep in mind that cool, cloudy weatherwill slow expected growth. Use days-to-maturity as a guide todistinguish varieties as early (65 days or less), mid-season (65 to 80days) and late-season (80 days or more). In some cooler areas of NewYork, only early-season varieties can be expected to mature.", "Determinate vs. indeterminate:", "Determinate varieties produce many short branches with flowers andfruit on the ends. They are usually early varieties and produce theirharvest all at once. Indeterminate varieties will continue to grow andproduce flowers and fruit all season until killed by frost, and aremost common in gardens. Semi-determinate plants are more compact thanindeterminate, but keep producing until frost.", "Use:", "Some are better than others for a multitude of uses:  slicing, salads, sauces, canning, juice etc.", "Appearance:", "Colors range from the familiar red to orange and yellow, pink andmulticolored fruits. Size and shape range from huge round beefsteaks toelongated pasters to tiny cherry and grape tomatoes and everything inbetween.", "Disease tolerance:", "Tomatoes were originallydesert plants. So they don't naturally have strong resistance to plantdiseases that thrive under our generally humid conditions. Fortunately,many hybrids have been bred specifically for disease resistance, andsome open-pollinated varieties tolerate certain diseases.", "Some varieties recommended for New York include:", "Cherry:", "Early Cherry", "Fruity Orange", "Sarah's Goldstar Cherry", "Sungold", "Supersweet 100", "Grape:", "Jubilee", "Extra Early:", "Cosmonaut Volkove", "Currant, Daybreak", "Early Cascade", "Gold Rush", "Early:", "Cascade", "Early Girl", "Gold Dust", "Lemon Boy", "Sunrise", "Taxi", "Main Season:", "Basket Vee", "Better Boy", "Big Beef", "Big Boy", "Celebrity", "Jet Star", "Mountain Fresh", "Mountain Spring", "Sunbeam", "Sunrise", "Supersonic", "Ultra Sweet", "Paste:", "Classica", "La Roma", "La Rosa", "Nova", "Plum Dandy", "Roma", "Viva Italia", "Heirlooms:", "Big Rainbow", "Black from Tula", "Black Prince", "Box Car Willie", "Brandywine", "Cherokee Purple", "Golden Queen", "Green Zebra", "Moskvich", "Mr. Stripey", "Striped German", "Striped Roman", "Tappy's Heritage", "©2006", "Cornell University", ". All rights reserved."], "Image_Url": "https://media.istockphoto.com/photos/tomato-isolated-on-white-background-picture-id466175630?k=6&m=466175630&s=612x612&w=0&h=fu_mQBjGJZIliOWwCR0Vf2myRvKWyQDsymxEIi8tZ38="}, "Peppers": {"Sunlight Conditions": " Sometimes peppers are a challenge to grow in cooler areas of New York. The many varieties of sweet and hot peppers thrive on full sun, warm weather, well-drained soil and modest fertility. ", "Plant Lifecycle": "annual", "Plant Care Difficulty": "moderately difficult", "Height": "1 to 3 feet", "Spread": "1 to 3 feet", "Optimal Germination Temperature": "70 F to 95 F       - Will not germinate below 55 F.", "Time to Germination": "Days to emergence: 7 to 10       - at soil temperatures around 85 F.", "Soil Depth": "3 Inches", "Full Summary": ["Peppers", "Vegetable (Warm Season) - Tomatoes, Peppers, Eggplant", "Also known as Bell peppers, Hot peppers", "Capsicum annuum (culinary)", "Solanaceae Family", "Sometimes peppers are a challenge to grow in cooler areas of New York.The many varieties of sweet and hot peppers thrive on full sun, warmweather, well-drained soil and modest fertility.", "Site and Plant Characteristics", "Growing Information", "Varieties", "Site Characteristics", "Sunlight:", "full sun", "Soil conditions:", "requires well-drained soil", "Well-drained, light, moderately fertile soil, high in organic matter. Needs steady supply of water for best performance.", "Special locations:", "outdoor containers - Provides attractive plants and ornamental as well as edible fruit.", "Plant Traits", "Lifecycle:", "annual", "Perennial in tropical regions, grown as a tender annual in New York.", "Ease-of-care:", "moderately difficult", "Fruiting can be temperatmental.  Requires warm temperatures.  Using black plastic and row covers can speed early growth.", "Height:", "1 to 3 feet", "Spread:", "1 to 3 feet", "Bloom time:", "early summer", "mid-summer", "late summer", "Flower color:", "white", "Foliage color:", "dark green", "Foliage texture:", "medium", "Shape:", "upright", "Shape in flower:", "same as above", "Special Considerations", "Special characteristics:", "not native to North America - Native to tropical America.", "bearsornamental fruit - Green bell peppers turn red when fully ripe. Othervarieties are yellow, orange, purple and chocolate brown. Hot peppers,chiles, and others come in many interesting shapes.", "Special uses:", "edible landscaping", "Growing Information", "How to plant:", "Propagate by  seed", "Germination temperature: 70 F to 95 F - Will not germinate below 55 F.", "Days to emergence: 7 to 10 - at soil temperatures around 85 F.", "Seed can be saved 2 years.", "Maintenance and care:", "Sow seeds indoors, 1/4 inch deep in flats, peat pots or cellpacks, 8-10weeks before you anticipate transplanting outside. Seed germinates bestwhen soil temperature is 80 F or higher. It will not germinate below 55F.", "Keepplants indoors in a warm (70 F during the day, 65 F at night), sunnylocation. Lack of light will produce leggy, unproductive transplants.", "Don'tbe in a rush to transplant outside. Cold temperatures can weaken plantsand they may never fully recover. A few days at 60 F to 65 F withreduced water will help harden plants and reduce transplant shock.Over-hardened plants grow slowly after transplanting.", "Set plantsout 2 to 3 weeks after average last frost when the soil has warmed andthe weather has settled. Plant them 12 to 24 inches apart, in rows 24to 36 inches apart, or spaced about 14 to 16 inches apart in raisedbeds.", "Use black plastic and/or row covers to speed soil warmingand early growth. Use caution with row covers not to overheat plantsand cause them to drop their blossoms.", "If not using blackplastic, mulch plants after they are well established and the soil haswarmed to retain moisture and control weeds.", "Peppers can betemperamental when it comes to setting fruit if temperatures are toohot or too cool. Nighttime temperatures below 60 F or above 75 F canreduce fruit set.", "Too much nitrogen fertilizer may promote lushvegetative growth but fewer fruits. Peppers usually responds well tophosphorus fertilizer.", "Stake tall varieties for earlier and heavier harvest.", "Peppersneed even moisture for best performance. An even supply can reduceblossom end rot, a disorder caused by lack of calcium.", "Do not plant in same spot more than once every 4 years.", "Pests:", "Aphids - A hard stream of water can be used to remove aphids fromplants. Wash off with water occasionally as needed early in the day.Check for evidence of natural enemies such as gray-brown or bloatedparasitized aphids and the presence of alligator-like larvae of ladybeetles and lacewings.", "Borers - Remove  by hand.  Destroy infested plants.", "Other pests:", "Tarnished plant bugs", "Diseases:", "Cucumber mosaic virus - Disease causes ringspots and oak-leaf patternson fruit. Rogue plants. Remove and destroy entire infested plant.Control aphids that spread the virus. Eliminate perennial weed sourcessuch as milkweed, marshcress and yellow rocket and avoid planting nextto susceptible ornamentals.", "Blossomend rot - Water during drought or mulch to keep moisture levelconstant. Grow in soil high in organic matter. Fertilize properly.Avoid cultivating close to plants.", "Varieties", "Browse", "pepper varieties", "at our", "Vegetable Varieties for Gardeners", "website.", "In cooler areas of the state, choose short-season varieties.  Disease-resistant varieties are good for warm, humid conditions.", "Peppersare often classified by the shape of their fruit -- the familiar bell,round cherries, heart-shaped anchos, long cayennes. Any of these shapesmay be either sweet or hot.", "Two of the hottest peppers are closely related but different species:", "Capsicum chinense", "(habañero) and", "Capsicum frutescens", "(tabasco).", "Some varieties recommended for New York include:", "Early:", "Ace", "Apple", "Golden Bell", "Gypsy", "Lipstick", "New Ace", "Redstart", "Main Season:", "Boynton Bell", "Golden Bell (Yellow)", "King Arthur", "Lady Bell", "Sweet Banana", "Sweet Chocolate", "Yellow Belle II", "Hot:", "Anaheim", "Biscayne", "Cayenne Long", "Habanero", "Hungarian Yellow Wax", "Jalapeño", "Mucho Nacho", "Serrano,", "Super Chili", "Stuffing:", "Joe E. Parker", "Thin Walled Frying Types:", "Cubanelle", "Italian Sweet", "©2006", "Cornell University", ". All rights reserved."], "Image_Url": "https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2Fupload.wikimedia.org%2Fwikipedia%2Fcommons%2Fthumb%2F1%2F1f%2FPoivrons_Luc_Viatour.jpg%2F1200px-Poivrons_Luc_Viatour.jpg&f=1&nofb=1"}, "Onions": {"Sunlight Conditions": "full sun", "Plant Lifecycle": "annual", "Plant Care Difficulty": "moderately difficult", "Height": "1 to 3 feet", "Spread": "0.5 to 1 feet", "Optimal Germination Temperature": "45 F to 95 F", "Time to Germination": "Days to emergence: 4 to 5", "Soil Depth": "3 Inches", "Full Summary": ["Onions", "Vegetable (Cool Season) - Onion Family", "Also known as scallions, bunching onions, green onions", "Allium cepa var. cepa", "Alliaceae Family", "Whether harvested early for scallions (green onions), for summer meals,or winter storage, onions need rich, well-drained soil and good weedcontrol. Tightly spaced green onions fit well in ornamental plantings.", "Site and Plant Characteristics", "Growing Information", "Varieties", "Site Characteristics", "Sunlight:", "full sun", "Soil conditions:", "requires well-drained soil", "requires high fertility", "Well-drained, rich soil, high in organic matter, neutral pH. Optimum pHis 6.2 to 6.8. Requires plentiful, even moisture for good yields.", "Plant Traits", "Lifecycle:", "annual", "Biennial grown as annual.", "Ease-of-care:", "moderately difficult", "Easy if you have rich well-drained soil and good weed control.", "Height:", "1 to 3 feet", "Spread:", "0.5 to 1 feet", "Bloom time:", "mid-summer", "Usuallydoes not flower unless grown from sets that are too large (more than ½to ¾ inches in diameter), or young plants (direct seeded ortransplanted) are stressed by abnormally cold weather.", "Foliage color:", "medium green", "Foliage texture:", "medium", "Shape:", "upright", "Special Considerations", "Tolerates:", "frost", "Special characteristics:", "not native to North America - Unknown in wild.  Probably originated in the Middle East or Asia.", "Special uses:", "edible landscaping", "Growing Information", "How to plant:", "Propagate by seed - To grow your own onion sets, sow seeds thickly in ablock in midsummer. About 2 months after planting, roll down the tops,forcing the plants to form small bulbs. (Those about the size of a dimework best.) After tops dry, clip them off, leaving about ½ inch ofstem. Cure and store in a cool, dry place as you would onions foreating. Plant your sets the following spring.", "Germination temperature: 45 F to 95 F", "Days to emergence: 4 to 5", "Seed can be saved 1 year. - Longer if stored properly in cool, dry location.", "Maintenance and care:", "Can be direct-seeded, grown from transplants started inside, or fromsets -- small bulbs about ½-inch in diameter grown from seed theprevious season.", "Choosea weed-free, well-drained location. Raised beds are ideal. Onions aregood for intercropping with other garden plants, especiallyearly-maturing spring greens. Do not plant where other onion familycrops have been grown in the past 3 years.", "Direct-seeding in thegarden may not allow enough time for long-season varieties to mature,but is fine for shorter-season varieties or for scallions - onionsharvested before the bulb forms.", "Direct-seed in spring when thesoil reaches 50 F. Plant seed ¼ inch deep, ½ inch apart, in rows 12 to18 inches apart. Thin to 4-inch spacings for large bulbs, 2-inchspacings for smaller bulbs but higher yields, or 1-inch spacings forscallions.", "Start transplants inside about 8 to 10 weeks beforelast frost date. Plant 4 or 5 seeds in each cell, or seed in flats ¼inch deep and ½ inch apart. If tops grow too tall and begin to droop,trim back to about 3 inches tall with scissors. After hardening off,transplant 2 to 4 weeks before last frost date. Space 4 inches apartfor large bulbs, 2 inches apart for smaller bulbs, or 1 inch apart forscallions.", "From sets:   Choose bulbs no largerthan ¾ inch in diameter. Large bulbs are more prone to bolting. Plantsets about 1 inch deep 2 to 4 weeks before last frost date. Space 4inches apart for large bulbs or 2 inches apart for smaller bulbs.", "Onionshave shallow root systems and need consistent moisture and good weedcontrol. Water weekly if weather is dry, and mulch to retain moistureand suppress weeds.", "Pests:", "Onion maggot - Locate new plants in a part of the garden different fromprevious year's location. Use floating row covers to preventinfestations.", "Thrips", "Diseases:", "Purple blotch (Alternaria porri) and Botrytis leaf blight - Avoidwetting foliage if possible. Water early in the day so above-groundplant parts will dry as quickly as possible. Avoid crowding plants.Allow space for air circulation. Eliminate weeds around plants andgarden area to improve air circulation. Practice plant sanitation: whenplants are not wet, carefully remove or discard affected plant parts.In autumn, rake and dispose of all fallen or diseased leaves and bulbs.", "Varieties", "Browse", "onion varieties", "at our", "Vegetable Varieties for Gardeners", "website.", "Chooselong-day varieties which need about 14 hours of light to form bulbs.Short-day varieties, such as the famous Vidalia onions, grow best inthe South.", "Spring-sown early varieties can be harvested just 60to 80 days after planting. Storage varieties require 90 to 110 days tomature from direct seeding, and come in yellow, white and purplevarieties. Sweet or milder varieties do not store well, and should beeaten soon after harvest. Pearl onions (sometimes called cocktailonions) have small bulbs (great for pickling) that mature in 60 to 70days.", "Green or bunching onions (sometimes called scallions) don’tform bulbs. Harvest them for their greens and small blanchedbelow-ground stem usually 65 to 75 days after direct seeding. Some area different species altogether,", "Allium fistulosum", ".", "Some varieties recommended for New York include:", "From transplants (Not for long term storage):", "Ailsa Craig", "Bennie’s Red", "Candy", "Red Sweet Spanish", "Walla Walla (mild)", "White Sweet Spanish", "From seed (early-maturing):", "Arsenal", "Early Yellow Globe", "Precedent", "From seed or transplants (long-term storage):", "Duration", "Fortress", "Mars", "Redwing", "Sets:", "Stuttgarter", "Green or Bunching:", "Evergreen Hardy White", "He-Shi-Ko", "Long White Bunching", "Southport White Bunching", "©2006", "Cornell University", ". All rights reserved."], "Image_Url": "https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2Ftse1.mm.bing.net%2Fth%3Fid%3DOIP.w4zUpDHA0MdbFXsliwkI8gHaFL%26pid%3DApi&f=1"}, "Summer squash": {"Sunlight Conditions": "full sun", "Plant Lifecycle": "annual", "Plant Care Difficulty": "easy", "Height": "1 to 3 feet", "Spread": "2 to 4 feet", "Optimal Germination Temperature": "60 F to 105 F - Will not germinate in cold soil. Wait to plant until soil reaches at least 65 F -- preferably 70 F or more. Germinates best at 95 F.", "Time to Germination": "Days to emergence: 5 to 10       - Should germinate in less than a week with soil temperature of 70 F and adequate moisture.", "Soil Depth": "3 Inches", "Full Summary": ["Summer squash", "Vegetable (Warm Season) - Cucurbit", "Also known as zucchini, yellow squash, scalloped squash, patty pan squash", "Cucurbita pepo", "Cucurbitaceae Family", "Summer squash comes in a variety of shapes and colors. Bush varietiestake up relatively little space, and if kept picked will keep producingright up to frost.", "Site and Plant Characteristics", "Growing Information", "Varieties", "Site Characteristics", "Sunlight:", "full sun", "Soil conditions:", "requires well-drained soil", "requires high fertility", "Prefers well-drained, fertile, loose soil, high in organic matter withpH between 5.8 and 6.8. Plentiful and consistent moisture is neededfrom the time plants emerge until fruits begin to fill out.", "Special locations:", "outdoor containers - Requires large container and frequent watering.", "Plant Traits", "Lifecycle:", "annual", "Tender annual", "Ease-of-care:", "easy", "Height:", "1 to 3 feet", "Most summer squash grow on compact vines, in contrast to the sprawling vines of most winter squash and pumpkins.", "Spread:", "2 to 4 feet", "Bloom time:", "mid-summer", "late summer", "early fall", "Flower color:", "yellow", "Foliage color:", "medium green", "Some varieties have interesting \"water marks\" on their foliage.", "Foliage texture:", "coarse", "Shape:", "cushion, mound or clump", "climbing / vine", "Most summer squash varieties form a compact, bushy vine.", "Shape in flower:", "same as above", "Special Considerations", "Special characteristics:", "native to North America", "Special uses:", "edible flowers - Flowers are sometimes battered and fried or stuffed.", "edible landscaping", "Growing Information", "How to plant:", "Propagate by  seed", "Germination temperature: 60 F to 105 F - Will not germinate in coldsoil. Wait to plant until soil reaches at least 65 F -- preferably 70 For more. Germinates best at 95 F.", "Days to emergence: 5 to 10 - Should germinate in less than a week with soil temperature of 70 F and adequate moisture.", "Seed can be saved 6 years.", "Maintenance and care:", "Squash like warm soil and are very sensitive to frost. So don’t be in arush to plant early in spring. Wait until danger of frost has passedand soil has warmed to about 70 F, or about 2 weeks after the lastfrost date.", "Directseed ½ to 1 inch deep into hills (which warm and drain earlier in theseason) or rows. Sow 4 to 5 seeds per hill. Space hills 3 to 4 feetapart. When the plants are 2 to 3 inches tall, thin to 2 to 3 plantsper hill by snipping off unwanted plants without disturbing the rootsof the remaining ones. In rows, sow seeds 4 inches apart in rows 4 to 5feet apart. Snip off plants to thin to one plant every 12 to 24 inches.", "For extra early crops, start inside in 2- to 3-inch pots orcells 3 to 4 weeks before transplanting outside. Sow 3 or 4 seeds perpot and thin to one or two plants by snipping off the weaker plants toavoid damaging the roots of those that remain. Harden off by cuttingback on water and reducing temperature before transplanting. Planttransplants out in the garden about 1 to 2 feet apart after all dangerof frost has passed.", "To hasten first harvest by as much as 2weeks, use black plastic mulch to warm soil before direct seeding ortransplanting. Early fruits are sometimes wrinkled, turn black or rotdue to poor pollination.", "At the end of the season, remove or tillin vines to reduce mildew. Use row covers to protect plants early inthe season and to prevent insect problems. Remove cover beforeflowering to allow pollination by insects or when hot weather arrives.", "Mulchingplants helps retain moisture and suppress weeds. Mounding soil aroundthe base of the plants can discourage squash borers from laying eggs.", "Pests:", "Squash bug - Hand pick.  Bury or compost plant residues after harvest.", "Squash vine borer - Remove by hand and destroy.", "Stripedcucumber beetles - Construct tents of fine netting or cheeesecloth oruse floating row covers over young plants. Put in place at planting andremove at flowering. Control of beetles may be a factor in preventingbacteria wilt", "Diseases:", "Bacterial wilt (", "Erwinia tracheiphila", ") -", "Remove and destroy infested plants.  If striped or spotted cucumber beetles appear control as soon as possible.", "Powderymildew - Avoid wetting foliage if possible. Water early in the day sothat aboveground parts will dry as quickly as possible. Avoid crowdingplants and eliminate weeds around plants and garden area to improve aircirculation.", "Scab - Avoid wetting foliage if possible. Waterearly in the day so that aboveground parts will dry as quickly aspossible. Avoid crowding plants and eliminate weeds around plants andgarden area to improve air circulation.", "Viral disease - Removeand destroy entire infested plant along with immediately surroundingsoil and soil clinging to roots. Eliminate wild cucumber and milkweednearby. Plant variety Multipik to mask symptons on fruit. Controlaphids early in the season by washing off with water as needed early inthe day. A hard stream of water can be used to remove many aphids.", "Other diseases:", "Downy mildew", "Varieties", "Browse", "summer squash varieties", "at our", "Vegetable Varieties for Gardeners", "website.", "There are four groups of summer squash:", "Yellow summer squash have long, thin fruits that can be smooth or warty, straight or crooknecked.", "Zucchini types are also long and cylindrical, often dark green but some varieties are lighter, yellow or even white.", "Scallopedor patty pan squash look like disc-shaped UFOs. Their edges arescalloped and colors range from greenish to yellow to white.", "Mideast or Cousa varieties have fruit that is shorter and thicker than zucchini, usually with a pale green skin.", "Some varieties recommended for New York include:", "Yellow:", "Early Prolific Straightneck", "Fortune", "Seneca", "Sunburst", "Sundance", "Yellow Crookneck", "Zucchini:", "Gold Rush", "Golden Burpee", "Midnight Zucchini", "Multipik", "Revenue", "Bush Scallop:", "Butter Scallop", "Peter Pan", "Sunburst", "©2006", "Cornell University", ". All rights reserved."], "Image_Url": "https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2Ftse1.mm.bing.net%2Fth%3Fid%3DOIP.O8avSAUC2FPsSiNGJNJdZgHaHa%26pid%3DApi&f=1"}, "Cucumbers": {"Sunlight Conditions": " Whether for pickling or slicing, cucumbers are easy to grow if you give them good soil, full sun and sufficient moisture, and wait for weather to warm before planting. ", "Plant Lifecycle": "annual", "Plant Care Difficulty": "easy", "Height": "1 to 6 feet", "Spread": "1 to 6 feet", "Optimal Germination Temperature": "60 F to 90 F       - Do not plant until soil reaches 65 F.", "Time to Germination": "Days to emergence: 3 to 10       - May germinate in 3 days at 80 F to 90 F.  Germination may take 10 days or longer at cooler temperatures.", "Soil Depth": "3 Inches", "Full Summary": ["Cucumbers", "Vine, Vegetable (Warm Season) - Cucurbit", "Cucumis sativus", "Cucurbitaceae Family", "Whether for pickling or slicing, cucumbers are easy to grow if you givethem good soil, full sun and sufficient moisture, and wait for weatherto warm before planting.", "Site and Plant Characteristics", "Growing Information", "Varieties", "Site Characteristics", "Sunlight:", "full sun", "Soil conditions:", "requires well-drained soil", "requires high fertility", "Well-drained, fertile soil, high in organic matter with near-neutralpH. Consistent, plentiful moisture needed until fruit is ripening. Maydevelop bitter taste in dry sites. Cucumbers are heavy nitrogen feedersand require fertile soil.", "Special locations:", "outdoor containers - Use bush varieties and keep well watered.", "Plant Traits", "Lifecycle:", "annual", "Ease-of-care:", "easy", "Cucumbersare not hard to grow if you provide good soil, plenty of moisture andfull sun, wait for soil and weather to warm before planting, and usefabric row covers if pests are a problem.", "Height:", "1 to 6 feet", "Vining varieties can climb up to 6 feet with support, or hug the ground if allowed to sprawl.", "Spread:", "1 to 6 feet", "Bush varieties take up only 2 or 3 square feet, while unsupported vining varieties can run along the ground for 6 or more feet.", "Bloom time:", "mid-summer", "late summer", "early fall", "Flower color:", "yellow", "Foliage color:", "medium green", "Foliage texture:", "medium", "Shape:", "upright", "climbing / vine", "Shape in flower:", "same as above", "Special Considerations", "Special characteristics:", "not native to North America - Probably originated in India before spreading to Africa and Southeast Asia.", "bearsornamental fruit - The wide variety of size, shape and color of fruitscan be used for ornamental effects. Trellised so fruits are morevisible.", "Special uses:", "edible landscaping - Bush and vining varieties can be incorporated into ornamental plantings.", "Growing Information", "How to plant:", "Propagate by  seed", "Germination temperature: 60 F to 90 F - Do not plant until soil reaches 65 F.", "Days to emergence: 3 to 10 - May germinate in 3 days at 80 F to 90 F.  Germination may take 10 days or longer at cooler temperatures.", "Maintenance and care:", "Cucumbers are very sensitive to cold. They need warm soil and air,whether direct-seeded or transplanted. Don’t rush to plant too early.Seed will not germinate if soil temperature is below 50 F, andgerminates only slowly at 68 F.", "Direct-seed1 to 1 ½ inches deep, either in rows (2 inches apart in rows 5 to 6feet apart) or in hills (3 to 6 seeds per hill, hills spaced 3 to 5feet apart).", "Thin to 8 to 15 inches apart in rows or 2 to 3plants per hill. Snip off plants when thinning to avoid disturbing theroots of nearby plants.", "For early crops, use black plastic mulchand row covers or other protection to speed warming and protect plants.Direct seed into holes in plastic. Cucumbers seeded into black plasticusually produce larger yields, as well earlier ones.", "For extraearly crops, start plants inside 3 to 4 weeks before transplanting. Sow3 seeds per pot in 2-inch pots. Thin to one or two plants per pot. Growabove 70 F during the day and above 60 F at night. Be careful whenhardening-off plants not to expose them to cold temperatures.", "Plantswith one or two true leaves transplant best. Transplant into blackplastic mulch or warm garden soil after danger of frost has passed andweather has settled. Be careful not to damage roots when transplanting.If using peat pots, make sure they are saturated before transplantingand completely buried. If using row covers, remove when flowers beginto blossom to assure good pollination.", "For a continuous harvest,make successive plantings every 2 to 3 weeks until about 3 monthsbefore first fall frost date. About 1 month before first frost, startpinching off new flowers so plants channel energy into ripeningexisting fruit.", "To save space, train vining cucumbers to atrellis. (Make sure the trellised plants don’t shade other sun-lovingplants.) This also increases air circulation (reducing diseaseproblems), makes harvest easier and produces straighter fruit. Set uptrellis before planting or transplanting to avoid root injury. Spaceplants about 10 inches apart. Pinch back vines that extend beyond thetrellis to encourage lateral growth.", "Most cucumbers have bothmale and female flowers. The male flowers blossom first and producepollen, but no fruit. Other varieties produce female flowerspredominately or exclusively. Seed packs of these varieties include afew seeds (usually marked with dye) of another variety that producesmale flowers to provide pollen. Make sure you don’t remove pollinatorplants when thinning.", "Cucumbers are heavy feeders and requirefertile soil, nitrogen fertilizer, and/or additions of high-N organicmatter sources. Pale, yellowish leaves indicate nitrogen deficiency.Leaf bronzing is a sign of potassium deficiency.", "To reduce pestand disease pressure, do not plant cucumbers where you’ve grown them inthe last two years. Choose resistant varieties to prevent many diseasesand/or trellis vining varieties to encourage good air circulation.", "Pests:", "Stripped or spotted cucumber beetles - Construct tents of fine netttingor cheesecloth or use floating row cover over young transplants andseedlings. Put in place at planting and remove before temperatures gettoo hot in midsummer. Control of beetles is important to preventbacterial wilt in cucumbers but less important in other vine crops.", "Aphids- A hard stream of water can be used to remove aphids from plants. Washoff with water occasionally as needed early in the day. Check forevidence of natural enemies such as gray-brown or bloated parasitizedaphids and the presence of alligator-like larvae of lady beetles andlacewings.", "Squash vine borer - Remove borers by hand and destroy.  Destroy crop residues after harvest.", "Diseases:", "Bacterial wilt (", "Erwinia tracheiphila", ")- Remove and discard or destroy infested plants. Control cucumberbeetles that spread the bacteria. (See striped or spotted cucumberbeetles.) Control as soon as they appear. Some varieties are lesssusceptible to bacterial wilt but may not be readily available.", "Powderymildew - Avoid crowding plants. Space apart to allow air circulation.Eliminate weeds around plants and garden area to improve aircirculation. In autumn, rake and dispose of all fallen or diseasedleaves and fruit. Plant resistant varieties such as Marketmore 76,Slicemaster and Raider.", "Scab - Avoid wetting foliage if possible.Water early in the day so aboveground plant parts will dry as quicklyas possible. Avoid crowding plants. Space apart to allow aircirculation.", "Cucumber mosaic virus - Remove and discard ordestroy infested plants. Plant resistant varieties such as Pacer,Marketmore 76, Dasher II, Slicemaster, Spacemaster and Sweet Success.Manage aphids that spread virus. Eliminate perennial weeds such asmilkweed, marshcress and yellow rocket; and avoid planting next tosusceptible ornamentals.", "Other diseases:", "Anthracnose", "Leaf spot", "Downy mildew", "Varieties", "Browse", "cucumber varieties", "at our", "Vegetable Varieties for Gardeners", "website.", "When choosing cucumber varieties, keep in mind:", "Pickling varieties", "bear short fruit (usually 3 to 4 inches) with thin skins and spines,usually with a stippled color pattern ranging from dark green at thestem to light green at the blossom end. They are usually ready toharvest sooner than slicing varieties, but harvest only lasts about 7to 10 days.", "Slicing varieties", "have longer fruit (usually7 to 8 inches) with a thick skin. Their coloring is sometimes stippledbut is usually a uniform dark green. They usually start to bear a weekor so later than pickling varieties, but harvest may continue for 4 to6 weeks.", "Vining varieties", "produce more fruit than bush varieties, but they take up much more space.", "Bush varieties", "bear fruit slightly earlier than vining varieties, and are easier to care for and harvest.", "\"Burpless\" varieties have been selected to eliminate gas build-up that affects some people.", "Seedless European varieties bred for greenhouse production usually perform poorly in gardens.", "Inthe coldest areas of the state, choose early-season varieties and/oruse black plastic mulch, row covers, and other season extenders tospeed soil warming and protect plants. Choose disease-resistantvarieties to reduce the disease problems.", "Some varieties recommended for New York:", "Slicing:", "Burpless Hybrid II", "Greensleeves", "Marketmore 76", "Marketmore 80", "Orient Express", "Raider", "Spacemaster", "Sweet Slice", "Pickling:", "National", "Regal", "Several other species in the genus Cucumis are also called cucumbers:", "West Indian gherkins,", "Cucumis anguria.", "Gherkin pickles are usually just immature common cucumbers,", "Cucumis sativus.", "Chinese or Asian cucumbers,", "Cucumis melo", "var.", "conomon", ".These are the same species as melons and cantaloupes. Often much longerthan common cucumbers (up to 20 inches), Asian cucumbers produce fewseeds and are \"burpless.\" Grow on trellises if you want straight fruit.", "African horned cucumber,", "Cucumis metuliferus.", "Often sold under the tradename kiwano, it is more commonly used like a fruit", "©2006", "Cornell University", ". All rights reserved."], "Image_Url": "https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2Ftse1.mm.bing.net%2Fth%3Fid%3DOIP.mgVpq7ciCbCyL3wX6CZT8AHaD2%26pid%3DApi%26h%3D160&f=1"}, "Globe artichokes": {"Sunlight Conditions": "full sun", "Plant Lifecycle": "perennial", "Plant Care Difficulty": "difficult", "Height": "3 to 6 feet", "Spread": "2 to 4 feet", "Optimal Germination Temperature": "70 F to 80 F", "Time to Germination": "Days to emergence: 8 to 12", "Soil Depth": "Up to 24 Inches", "Full Summary": ["Globe artichokes", "Vegetable (Cool Season) - Other", "Cynara scolymus", "Compositae Family", "This cool-season perennial prized for its flavorful “hearts” isnormally hardy to Zone 6 if well mulched, and occasionally Zone 5during mild winters. Its bristly leaves also add a unique texture toflower gardens.", "Site and Plant Characteristics", "Growing Information", "Varieties", "Site Characteristics", "Sunlight:", "full sun", "Soil conditions:", "requires well-drained soil", "Prefers deep, fertile, well-drained soils high in organic matter with apH between 6.5 and 8.0. A heavy feeder that requires lots of moisturefor maximum growth. It will survive drought, but not produce well.", "Hardiness zones:", "6 to 9", "With protection, may survive mild winters in Zone 5.  Can be grown as an ornamental annual in colder zones.", "Plant Traits", "Lifecycle:", "perennial", "Perennial Zone 6 and warmer, but often grown as an annual in colder areas.", "Ease-of-care:", "difficult", "Height:", "3 to 6 feet", "Spread:", "2 to 4 feet", "Bloom time:", "mid-fall", "Flower color:", "violet", "Flower resembles a thistle.", "Foliage color:", "light green", "Foliage texture:", "medium", "Shape:", "spreading mass", "upright", "Shape in flower:", "flower stalks with flowers as globes", "Most gardeners remove and eat flower head and bracts before they open.", "Special Considerations", "Tolerates:", "frost - Tolerates heavy frost, but heavy frost will damage flower stalks.", "salt", "Special characteristics:", "not native to North America", "Special uses:", "edible landscaping", "Growing Information", "How to plant:", "Propagate by  seed, division or separation  - Seed may not breed true.", "Germination temperature: 70 F to 80 F", "Days to emergence: 8 to 12", "Seed can be saved 6 years.", "Maintenance and care:", "Plant root divisions (basal stem pieces with attached roots) after last frost, 2 to 3 feet apart in rows 2.5 to 3 feet apart.", "Plantingfrom seed not recommended because results are highly variable andusually inferior to parent plants. But if you do, start seeds about 8to 12 weeks before last frost. Harden off in cold frame. Cold treatmentof starts (keeping temperature between 35 F and 50 F for about 10 days)can induce flowering in first-year plants. Transplant outside aftersoil has reached 60 F.", "Benefits from the use of a low-nitrogenfertilizer (high in phosphorus and potassium), which can beincorporated before planting.", "Plants usually don’t flower the first year.", "Toincrease chance of overwintering, head back to 12 inches and cover withleaves, covered with baskets or boxes, and heap more leaves over thetop of the basket. Another alternative is to dig roots and store in acold (but not freezing) room. Pot up about a month before transplantingout after last frost.", "While individual plants may live up to 15 years or more, divide about every 3 years to keep planting productive.", "Pests:", "Aphids - A hard stream of water can be used to remove aphids fromplants. Wash off with water occasionally as needed early in the day.Check for evidence of natural enemies such as gray-brown or bloatedparasitized aphids and the presence of alligator-like larvae of ladybeetles and lacewings.", "Varieties", "Browse", "globe artichoke varieties", "at our", "Vegetable Varieties for Gardeners", "website.", "GreenGlobe and Green Globe Improved are standard commercial varieties grownin milder climates than those found in most of New York.", "Shorter season varieties that are more likely to flower and winter over in New York include:", "Imperial Star - grows just 3 feet tall", "Violetto - purplish buds", "Grande Buerre - spineless heads, grows up to 9 feet tall", "©2006", "Cornell University", ". All rights reserved."], "Image_Url": "https://duckduckgo.com/i/ec50a413.jpg"}, "Arugula": {"Sunlight Conditions": "full sun", "Plant Lifecycle": "annual", "Plant Care Difficulty": "easy", "Height": "1 to 2 feet", "Spread": "0.5 to 1 feet", "Optimal Germination Temperature": "40 F to 55 F", "Time to Germination": "Days to emergence: 5 to 7", "Soil Depth": "3 Inches", "Full Summary": ["Arugula", "Vegetable (Cool Season) - Salad Greens", "Also known as Roquette, Rocket", "Eruca vesicaria", "Brassicaceae Family", "This fast-growing cool-season salad green - often ready to harvest asearly as 4 weeks after seeding - adds a tangy, peppery or mustard-likeflavor to salads and mesclun mixes.", "Site and Plant Characteristics", "Growing Information", "Varieties", "Site Characteristics", "Sunlight:", "full sun", "part shade", "Soil conditions:", "tolerates low fertility", "Prefers rich humusy soil with pH of 6 to 6.8, but will tolerate widevariety of conditions. Evenly moist soil will help slow bolting.", "Special locations:", "outdoor containers", "Plant Traits", "Lifecycle:", "annual", "Ease-of-care:", "easy", "Height:", "1 to 2 feet", "Growth is low and compact until heat causes plant to bolt.", "Spread:", "0.5 to 1 feet", "Bloom time:", "late spring", "early summer", "mid-summer", "late summer", "Flower color:", "white", "Foliage color:", "medium green", "Foliage texture:", "medium", "Shape:", "cushion, mound or clump", "upright", "Forms a rosette of deeply lobed leaves.  Plants become erect when heat induces bolting.", "Shape in flower:", "flower stalks with sprays of flowers", "Flowers are edible.", "Special Considerations", "Tolerates:", "frost", "Special characteristics:", "not native to North America", "Special uses:", "edible flowers", "Growing Information", "How to plant:", "Propagate by  seed", "Germination temperature: 40 F to 55 F", "Days to emergence: 5 to 7", "Seed can be saved 5 years.", "Maintenance and care:", "Seeds germinate quickly even in cold soil.  Plant as soon as soil can be worked in spring.", "Avoid planting after other cabbage family crops.", "Plant¼ inch deep and 1 inch apart in rows, or broadcast alone or mixed withother greens. Gradually thin to 6-inch spacings using thinnings forsalads.", "Make new plantings every 2 to 3 weeks for a continuous supply until about a month before your average first frost date.", "Slow bolting by reducing heat and moisture stress.  Provide some shade for warm-season plantings.", "Fast-growing plants are good for intercropping and relay cropping.", "Oftenself-seeds. Is self-sterile and requires insects for pollination. Willnot cross with other members of the mustard family.", "Pests:", "Flea beetles", "Diseases:", "Rarely a problem.", "Varieties", "Browse", "arugula varieties", "at our", "Vegetable Varieties for Gardeners", "website.", "‘Sylvetta’ is actually a different species,", "Diplotaxis tenuifolia", ".It is slower growing, half as tall, and slower to bolt, and hassmaller, more deeply lobed leaves, yellow flowers and more pungenttaste.", "©2006", "Cornell University", ". All rights reserved."], "Image_Url": "https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2Ftse1.mm.bing.net%2Fth%3Fid%3DOIP.TcWSa-oI-1tFcAxVNLYiMwHaEK%26pid%3DApi&f=1"}, "Asparagus": {"Sunlight Conditions": "full sun", "Plant Lifecycle": "perennial", "Plant Care Difficulty": "moderately difficult", "Height": "5 to 9 feet", "Spread": "2 to 2.5 feet", "Optimal Germination Temperature": "70 F to 77 F", "Time to Germination": "Days to emergence: 10 to 12", "Soil Depth": "Up to 24 Inches", "Full Summary": ["Asparagus", "Vegetable (Cool Season) - Other", "Asparagus officianalis", "Liliaceae Family", "Among the earliest crops in spring, plantings of this hardy perennialcan last for decades if well cared for, and the fine foliage makes it anatural for edible landscaping. The tender spears are tastiest wheneaten as soon as possible after harvest.", "Site and Plant Characteristics", "Growing Information", "Varieties", "Site Characteristics", "Sunlight:", "full sun", "part shade", "Soil conditions:", "tolerates acid soil", "tolerates droughty soil", "requires well-drained soil", "Prefers loose, deep soils high in organic matter. Prefers pH near 7.0,but tolerates a wide range. Add lime and fertilizer beforeestablishment.", "Hardiness zones:", "2 to 8", "Plant Traits", "Lifecycle:", "perennial", "Ease-of-care:", "moderately difficult", "Height:", "5 to 9 feet", "Spread:", "2 to 2.5 feet", "Flower color:", "green", "Small,yellowish green. Older varieties such as Mary Washington have male andfemale flowers on separate plants. Male flowers are larger and longerthan female.", "Foliage color:", "light green", "Foliage texture:", "fine", "Fernlike, finely dissected.", "Shape:", "upright", "Tall with fern-like fronds.", "Shape in flower:", "same as above", "Special Considerations", "Tolerates:", "salt", "Special characteristics:", "not native to North America - Mediterranean.", "bears ornamental fruit - Small, bright red berries on the open-pollinated cultivars only.", "Special uses:", "edible landscaping", "Growing Information", "How to plant:", "Propagate by seed, division or separation - Purchase disease-free,1-year-old crowns for planting. Divide plants in early spring, ifdesired. Asparagus can also be grown from seed, but requires an extrayear to establish.", "Germination temperature: 70 F to 77 F", "Days to emergence: 10 to 12", "Seed can be saved 3 years.", "Maintenance and care:", "Carefully consider site before planting this long-lived perennial. Testsoil and apply phosphorus, potassium and lime as indictated beforeplanting. Avoid frost pockets as late killing frosts will damage spears.", "Plantcrowns 4 to 6 weeks before average last frost, 18 to 24 inches apart intrenches 8 inches deep. (5 inches deep for Jersey series cultivars.)Spread roots in bottom of trench and cover with 1 to 2 inches of soil.Gradually cover with more soil as the plants grow.", "Do not cut back ferns in fall until they die naturally.", "Forhighest yields, plant all-male hybrids, such as the Jersey series fromRutgers University (Jersey Giant, Jersey King, Jersey Knight). If usingolder varieties, such as Martha Washington, you can identify the lessproductive female plants at flowering and replace them with maleplants. The flowers on male plants are larger and longer than thefemale flowers, have six stamens and a small nonfunctional pistil. Thefemale flowers have six small nonfunctional pistils and a welldeveloped, three-lobed stamen.", "Water during dry spells during the first year.  Do not overwater as plants don’t tolerate water-logged soils.", "To blanch asparagus, carefully hill soil over spears or grow under opaque buckets or row covers.", "Midsummermulching with hay, straw, leaves or grass clippings helps control weedsand keep soil from drying out. (Be careful not to bring in weed seedswith your mulch.) Regular applications of compost or well-rotted manureprovide a steady source of nutrients.", "Weeds can be challenging.Keep plantings well cultivated and mulched to prevent weeds fromgetting established. Mulch heavily around plantings to keep spreadingweeds such as quackgrass from invading. While plants are salt-tolerant,the old practice of using salt to kill weeds is not recommended. Witholder varieties that are not all-male, weed out volunteer plants fromfemales that set seed.", "Pests:", "Asparagus beetles (common and spotted) - Handpick in small plantings.", "Diseases:", "Fusarium wilt, crown rot - Use disease-free crowns or seed. If you arestarting with seedlings, do not overharvest. Rogue plants that areseverely diseased. Remove and discard or destroy entire infested plantalong with immediately surrounding soil and soil clinging to roots.", "Other diseases:  Rust (", "Puccinia aparagi", ")", "Varieties", "Browse", "asparagus varieties", "at our", "Vegetable Varieties for Gardeners", "website.", "Varieties recommended for New York include:", "Jersey Knight and Jersey King - Widely adapted, do well in warm climates.", "Jersey Giant - Good for colder regions.", "TheJersey series from Rutgers University in New Jersey features hybridswith all-male plants and good resistance to rust and fusarium crown-and root-rots. Yields two to three times more than open-pollinatedvarieties.", "©2006", "Cornell University", ". All rights reserved."], "Image_Url": "https://duckduckgo.com/i/b1e10561.jpg"}, "Bush beans": {"Sunlight Conditions": "full sun", "Plant Lifecycle": "annual", "Plant Care Difficulty": "easy", "Height": "1 to 3 feet", "Spread": "1 to 2 feet", "Optimal Germination Temperature": "70 F to 80 F       - Germination is slow and poor when soil temperatures are below 60 F.", "Time to Germination": "Days to emergence: 8 to 10       - Germination may take two weeks or more if soil temperatures are below 60 F.", "Soil Depth": "3 Inches", "Full Summary": ["Bush beans", "Vegetable (Warm Season) - Other", "Also known as French bean, filet bean, haricot, green bean (bush), wax bean (bush), string bean (bush)", "Phaseolus vulgaris (Bush beans)", "Fabaceae Family", "You can harvest this staple of the vegetable garden as snap beans,shell beans or dry beans. They are extremely easy to grow, but if yourgarden is small, consider planting pole beans. They yield two to threetimes more from the same space.", "Site and Plant Characteristics", "Growing Information", "Varieties", "Site Characteristics", "Sunlight:", "full sun", "Can tolerate partial shade but will reduce yield.", "Soil conditions:", "requires well-drained soil", "Prefers well-drained soil, but with consistent moisture.  Only requires average fertility.  pH 6.0 to 6.8.", "Plant Traits", "Lifecycle:", "annual", "Tender annual.", "Ease-of-care:", "easy", "Height:", "1 to 3 feet", "Spread:", "1 to 2 feet", "Bloom time:", "mid-summer", "late summer", "Flower color:", "white", "Foliage color:", "medium green", "Foliage texture:", "medium", "Shape:", "spreading mass", "Shape in flower:", "same as above", "Special Considerations", "Special characteristics:", "not native to North America - Species has been under cultivation worldwide for more than 7,000 years.", "bears ornamental fruit - Some varieties have purple or yellow pods.", "Special uses:", "edible landscaping", "Growing Information", "How to plant:", "Propagate by  seed  - Do not start seeds inside. Beans do not like to be transplanted.", "Germination temperature: 70 F to 80 F - Germination is slow and poor when soil temperatures are below 60 F.", "Days to emergence: 8 to 10 - Germination may take two weeks or more if soil temperatures are below 60 F.", "Seed can be saved 5 years.", "Maintenance and care:", "Do not plant until danger of frost has passed and soil has warmed.Germination is poor when soil temperature is below 60 F. Cold airtemperatures (even above freezing) can injure plants and reduce yields.", "Plant seed one inch deep (deeper if soil is dry), about 2 inches apart, in rows 18 to 36 inches apart.", "Soaking beans to hasten germination may damage seeds.  Do not start seed inside.", "For a steady supply of beans, make successive plantings until mid- to late July.", "Relay-crop beans following harvest of cool-season crops, such as lettuce, spinach and peas.", "Beansrequire even moisture - about 1 inch per week - especially whenflowering and developing pods. If you water, avoid wetting foliage,which encourages disease. Water early in the day so foliage driesquickly. Mulch after second set of true leaves develops to help retainmoisture.", "Do not use nitrogen fertilizers. Inoculating seed withrhizobium bacteria may increase yields, especially in soils where beanshave not been grown before.", "Pod set is often poor when temperatures exceed 90 F.", "Deformed pods may be the result of lack of moisture, poor soil fertility or insect damage during blooming.", "A three-year rotation helps reduce some diseases.", "Pests:", "Mexican bean beetles - Handpick and destroy beetles and eggs in smallplantings. Plant early to avoid this pest. Turn under any infestedplants after harvest.", "Aphids- A hard stream of water can be used to remove aphids from plants. Washoff with water occasionally as needed early in the day. Check forevidence of natural enemies such as gray-brown or bloated parasitizedaphids and the presence of alligator-like larvae of lady beetles andlacewings.", "Leafhoppers - Small, light green to gray wedge-shapedinsects that suck plant juices, causing stunting, and carrying virusdiseases. No cultural control available.", "Seedcorn maggot - Avoidheavy manure or organic matter in garden which attract maggot flies andencourages egg laying. Purchase insecticide-treated seed. Use gloves toplant.", "Spider mites (two-spotted) - Wash off with wateroccasionally as needed early in the day. A hard stream of water can beused to remove many mites from plants.", "Diseases:", "To reduce disease spread, do not work among wet plants.", "Bacterialblights - Avoid wetting foliage if possible. Water early in the day soaboveground plant parts will dry as quickly as possible. Avoid crowdingplants. Space apart to allow air circulation. Eliminate weeds aroundplants and garden area to improve air circulation. Do not save your ownseed.", "Bean common mosaic virus (BV-1 and NY 15) - Remove anddiscard or destroy entire infested plant. Use resistant varieties:Lancer, Provider,Blue Bush 274, Golden Butterwax, Royal Burgundy,Tendercrop, Improved Tendergreen. Manage insect vectors.", "Whitemold - Avoid wetting foliage if possible. Water early in the day soaboveground plant parts will dry as quickly as possible. Avoid crowdingplants. Space apart to allow air circulation. Eliminate weeds aroundplants and garden area to improve air circulation. In autumn rake anddispose of all fallen or diseased leaves and fruit. Crop rotation isessential.", "Varieties", "Browse", "bush bean varieties", "at our", "Vegetable Varieties for Gardeners", "website.", "Thereare many varieties of bush beans to choose from. Pod color ranges fromdark green to yellow (often called wax beans) and even to purple. Podsmay be round or flat. (Romano types typically have broad, flat pods.)French filet beans are slender and you should harvest them when theyare 1/8 to ¼ inch in diameter.", "Many varieties offer resistance todiseases such as anthracnose, bean mosaic virus, halo blight, bacterialblight, and downy and powdery mildews. Be sure to choose resistantvarieties if you experience problems with bean diseases in your garden.", "Youcan harvest most varieties as snap beans, shell beans or dry beans. Buteach variety is usually best at just one of the three stages. Manyheirloom varieties are available.", "Some varieties recommended for New York include:", "Green pod:", "Bush BlueLake", "Charon", "Derby", "Jade", "Provider", "Roma II (Italian flat pod)", "Tendergreen Improved", "Yellow pod (wax):", "Golden Butterwax", "Golden Rod", "Rocdor", "Dry Beans:", "Cabernet", "California Red Kidney (light red kidney)", "Chinook 2000 (light red kidney)", "Etna (cranberry)", "Fleetwood (navy)", "Jacob's Cattle (specialty)", "Midnight (black turtle soup)", "Miscellaneous:", "French Horticultural", "Romano", "Royal Purple Burgundy", "©2006", "Cornell University", ". All rights reserved."], "Image_Url": "https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2Ftse1.mm.bing.net%2Fth%3Fid%3DOIP.Aomm1eAzl9kYeX0lIHp7MwHaHa%26pid%3DApi%26h%3D160&f=1"}, "Pole beans, green beans (pole), wax beans (pole),": {"Sunlight Conditions": "full sun", "Plant Lifecycle": "annual", "Plant Care Difficulty": "easy", "Height": "5 to 10 feet", "Spread": "1 to 2 feet", "Optimal Germination Temperature": "70 F to 80 F       - Germination is slow and poor when soil temperatures are below 60 F.", "Time to Germination": "Days to emergence: 8 to 10       - Germination may take two weeks or more if soil temperatures are below 60 F.", "Soil Depth": "3 Inches", "Full Summary": ["Pole beans, green beans (pole), wax beans (pole),", "Vegetable (Warm Season) - Other", "Phaseolus vulgaris (Pole beans)", "Fabaceae Family", "Note", ": There are other species of beans with climbing growth habit, such as", "Phaseolus lunatus (butterbean)", "Phaseolus", "coccineus", "(scarlet runner bean),", "Psophocrapus tetragonolobus", "(winged bean),", "Vigna unguiculata", "(yard-long bean), etc.", "Pole beans yield two to three times more than bush beans from the samespace, are easier to harvest, and many gardeners believe they arebetter tasting. Both types have similar requirements, except pole beansneed a 5- to 8-foot-tall support. Can provide strong background orvertical element in flower garden.", "Site and Plant Characteristics", "Growing Information", "Varieties", "Site Characteristics", "Sunlight:", "full sun", "Can tolerate partial shade but will reduce yield.", "Soil conditions:", "requires well-drained soil", "Prefers well-drained soil, but with consistent moisture.  Only requires average fertility.  pH 6.0 to 6.8.", "Plant Traits", "Lifecycle:", "annual", "Tender annual", "Ease-of-care:", "easy", "Height:", "5 to 10 feet", "Needs support of trellis or other structure.", "Spread:", "1 to 2 feet", "Bloom time:", "mid-summer", "late summer", "Flower color:", "white", "Foliage color:", "medium green", "Foliage texture:", "medium", "Shape:", "climbing / vine", "Shape in flower:", "same as above", "Special Considerations", "Special characteristics:", "native to North America - Species has been under cultivation worldwide for more than 7,000 years.", "bears ornamental fruit - Some varieties have purple or yellow pods.", "Special uses:", "edible landscaping", "Growing Information", "How to plant:", "Propagate by  seed  - Do not start seeds inside.  Beans do not like to be transplanted.", "Germination temperature: 70 F to 80 F - Germination is slow and poor when soil temperatures are below 60 F.", "Days to emergence: 8 to 10 - Germination may take two weeks or more if soil temperatures are below 60 F.", "Seed can be saved 5 years.", "Maintenance and care:", "Do not plant until danger of frost has passed and soil has warmed.Germination is poor when soil temperature is below 60 F. Cold airtemperatures (even above freezing) can injure plants and reduce yields.", "Constructtrellis, teepee, or single-pole support before seeding to avoidinjurying plant roots later. Bamboo poles or saplings lashed togethermake easy, inexpensive supports. Do not locate trellis where it willshade other plants that need full sun.", "Plant seed 1 inch deep(deeper if soil is dry), in hills of four to six seeds at the base ofeach pole. Plant 3 inches apart in rows along the base of lineartrellises.", "Soaking beans to hasten germination may damage seeds.  Do not start seed inside.", "Beansrequire even moisture - about 1 inch per week - especially whenflowering and developing pods. If you water, avoid wetting foliage,which encourages disease. Water early in the day so foliage driesquickly. Mulch after second set of true leaves develops to help retainmoisture.", "Do not use nitrogen fertilizers. Inoculating seed withrhizobium bacteria may increase yields, especially in soils where beanshave not been grown before.", "Pod set is often poor when temperatures exceed 90 F.", "Deformed pods may be the result of lack of moisture, poor soil fertility or insect damage during blooming.", "A three-year rotation helps reduce some diseases.", "Pests:", "Mexican bean beetles - Handpick and destroy beetles and eggs in smallplantings. Plant early to avoid this pest. Turn under any infestedplants after harvest.", "Aphids- A hard stream of water can be used to remove aphids from plants. Washoff with water occasionally as needed early in the day. Check forevidence of natural enemies such as gray-brown or bloated parasitizedaphids and the presence of alligator-like larvae of lady beetles andlacewings.", "Leafhoppers - Small, light green to gray wedge-shapedinsects that suck plant juices, causing stunting, and carrying virusdiseases. No cultural control available.", "Seedcorn maggot - Avoidheavy manure or organic matter in garden which attract maggot flies andencourages egg laying. Purchase insecticide-treated seed. Use gloves toplant.", "Spider mites (two-spotted) - Wash off with wateroccasionally as needed early in the day. A hard stream of water can beused to remove many mites from plants.", "Diseases:", "To reduce disease spread, do not work among wet plants.", "Bacterialblights - Avoid wetting foliage if possible. Water early in the day soaboveground plant parts will dry as quickly as possible. Avoid crowdingplants. Space apart to allow air circulation. Eliminate weeds aroundplants and garden area to improve air circulation. Do not save your ownseed.", "Bean common mosaic virus (BV-1 and NY 15) - Remove anddiscard or destroy entire infested plant along with immediatelysurrounding soil and soil clinging to roots. Use resistant varieties:Lancer, Provider,Blue Bush 274, Golden Butterwax, Royal Burgundy,Tendercrop, Improved Tendergreen. Manage insect vectors.", "Whitemold - Avoid wetting foliage if possible. Water early in the day soaboveground plant parts will dry as quickly as possible. Avoid crowdingplants. Space apart to allow air circulation. Eliminate weeds aroundplants and garden area to improve air circulation. In autumn rake anddispose of all fallen or diseased leaves and fruit. Crop rotation isessential.", "Varieties", "Browse", "pole bean varieties", "at our", "Vegetable Varieties for Gardeners", "website.", "Polebean varieties mirror bush beans. Pod color ranges from dark green toyellow (often called wax beans) and even to purple. Pods may be roundor flat. (Romano types typically have broad, flat pods.) French filetvarieties are slender and you should harvest them when they are 1/8 to¼ inch in diameter. Be sure to choose resistant varieties if youexperience problems with bean diseases in your garden. You can harvestmost varieties as snap beans, shell beans or dry beans. But eachvariety is usually best at just one of the three stages. Many heirloomvarieties are available.", "Some varieties recommended for New York include:", "Green pods:", "Blue Lake", "Fortex", "Kentucky Wonder", "Kentucky Blue", "©2006", "Cornell University", ". All rights reserved."], "Image_Url": "https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2Ftse1.mm.bing.net%2Fth%3Fid%3DOIP.NK6QEoYO4p5cRInNPO4mbwHaHa%26pid%3DApi%26h%3D160&f=1"}, "Beets": {"Sunlight Conditions": "full sun", "Plant Lifecycle": "annual", "Plant Care Difficulty": "easy", "Optimal Germination Temperature": "50 F to 85 F       - Will still germinate at temperatures as low as 40 F and as high as 90 F.", "Time to Germination": "Days to emergence: 5 to 8       - May take two to three weeks in colder soils.", "Soil Depth": "3 Inches", "Full Summary": ["Beets", "Vegetable (Cool Season) - Spinach, Beets, Chard, Vegetable (Warm Season) - Salad Greens", "Beta vulgaris subsp. vulgaris", "Chenopodiaceae Family", "Easy-to-grow beets do double-duty in the kitchen, producing tasty rootsfor baking, boiling or sautéing and fresh greens to boil or steam.Plant them early for top quality and best flavor. (Fluctuating weathercan reduce quality and create white zone rings in the roots.) Somevarieties have red stems and venation in the leaves, making them anatural for edible landscaping.", "Site and Plant Characteristics", "Growing Information", "Varieties", "Site Characteristics", "Sunlight:", "full sun", "part shade", "Soil conditions:", "tolerates low fertility", "Prefers well-drained sandy loam to silt loam soil, high in organicmatter, with pH between 6.5 and 7 and free of large stones. Good soilstructure is important because growth is improved by good soilaeration.    Beets grow poorly in acid soil. Theytolerate low fertility but require consistent moisture. Do not plant insoils with pH less than 6.0.", "Beetsuse boron inefficiently. Boron is less available in soils with high pHand high organic matter. Corky black areas in the roots indicate borondeficiency.", "Plant Traits", "Lifecycle:", "annual", "Biennial grown as an annual.", "Ease-of-care:", "easy", "Foliage color:", "medium green", "variegated", "Some varieties have red stems and leaf venation.", "Foliage texture:", "medium", "Shape:", "cushion, mound or clump", "Special Considerations", "Tolerates:", "frost", "Special characteristics:", "not native to North America - Native to Europe and Asia", "Special uses:", "edible landscaping", "Growing Information", "How to plant:", "Propagate by  seed", "Germination temperature: 50 F to 85 F - Will still germinate at temperatures as low as 40 F and as high as 90 F.", "Days to emergence: 5 to 8 - May take two to three weeks in colder soils.", "Seed can be saved 4 years.", "Maintenance and care:", "Plant in early spring, as soon as you can work the soil, ¾ inch deepand 1 inch apart in rows 12 to 18 inches apart.   Forcontinuous harvest, make successive plantings every three weeks untilmidsummer. For winter storage, sow crop about 10 weeks before heavyfreeze.", "Thewrinkled “seedball” usually contains two to four viable seeds, makingit necessary to thin to 3- to 4-inch spacings if you plan to harvestyoung, small or cylindrical-shaped roots, or 6-inch spacings for largerroots for winter storage.", "Begin thinning when seedlings areabout 4 to 5 inches tall, and eat the thinnings. Cut rather than pullplants when thinning to avoid disturbing roots of other plants.", "Some “monogerm” varieties have only one seed per fruit.  Some seed companies remove seeds from the seedball.", "Unlike most root crops, beets can be started inside or in cold frames and transplanted into the garden.", "Use floating row covers to discourage insects early in the season.", "Keep well-weeded.  Competition and uneven watering can make beets stringy and tough.", "Beets are closely related to Swiss chard and spinach.  Avoid following these crops in rotation.", "Beets tolerate average to low fertility.  Too much nitrogen will encourage top growth at the expense of root development.", "Bestcolor and flavor develop under cool conditions and bright sun. Whenbeets mature in warm weather, they are lighter colored, have less sugarand have more pronounced color zoning in the roots. Fluctuating weatherconditions produce white zone rings in roots.", "Beets arebiennials. Normally, they produce an enlarged root during their firstseason. Then after overwintering they produce a flower stalk. If theyexperience two to three weeks of temperatures below 45 F after theyhave formed several true leaves during their first season, a flowerstalk may grow prematurely. Many newer varieties are less sensitive tothis problem.", "Pests:", "Leafminer - Cover plants with fine netting or cheesecloth or floatingrow cover to protect them from adult flies. Handpick and destroyinfested (mined) leaves. Control weeds.", "Diseases:", "Cercospora leaf spot - Avoid wetting foliage if possible. Water earlyin the day so aboveground plant parts will dry as quickly as possible.Avoid crowding plants. Thin plants to allow air circulation. Eliminateweeds around plants and garden area to improve air circulation. Inautumn, rake and dispose of all fallen or diseased leaves and fruit.", "Scab- Avoid wetting foliage if possible. Water early in the day soaboveground plant parts dry as quickly as possible. Avoid crowdingplants Thin to allow air circulation.", "Other diseases:", "Root rots", "Varieties", "Browse", "beet varieties", "at our", "Vegetable Varieties for Gardeners", "website.", "Rootshapes range from long and and cylindrical to short and spherical.Choose short varieties for stony soil. In addition to the common redbeet varieties, colors range from gold and yellow to white. Somevarieties are favored for their greens, others for their long-termstorage.", "Recommended varieties for New York include:", "Crosby Green Top", "Detroit Dark Red", "Early Wonder", "Formanova", "Golden", "Long Season", "Lutz Green", "Red Ace", "Ruby Queen", "Warrior", "©2006", "Cornell University", ". All rights reserved."], "Image_Url": "https://duckduckgo.com/i/361b924d.png"}, "Pak choy": {"Sunlight Conditions": "full sun", "Plant Lifecycle": "annual", "Plant Care Difficulty": "moderately difficult", "Height": "1 to 2 feet", "Spread": "1 to 1.5 feet", "Optimal Germination Temperature": "50 F to 80 F", "Time to Germination": "Days to emergence: 4 to 7", "Soil Depth": "3 Inches", "Full Summary": ["Pak choy", "Vegetable (Cool Season) - Cabbage Family", "Also known as Bok choy, Pak choi, Bok choi", "Brassica rapa var. chinensis", "Brassicaceae Family", "No matter how you spell it, pak choy’s mild flavor is a must for stirfries. It’s not as finicky about heat and cold as Chinese cabbage, andthe striking white petioles and green leaves make it a must for ediblelandscaping.", "Site and Plant Characteristics", "Growing Information", "Varieties", "Site Characteristics", "Sunlight:", "full sun", "part shade", "Partial shade can help prevent summer crops from bolting.", "Soil conditions:", "requires well-drained soil", "Prefers well-drained, fertile soil high in organic matter, pH 6.0 to7.5. Can tolerate slightly alkaline soil. Needs plentiful, consistentmoisture.", "Plant Traits", "Lifecycle:", "annual", "Biennial grown as an annual.", "Ease-of-care:", "moderately difficult", "Spring crops require good timing and careful pest control.  Direct-seeded fall crops are easier to grow.", "Height:", "1 to 2 feet", "Spread:", "1 to 1.5 feet", "Foliage texture:", "medium", "Shape:", "cushion, mound or clump", "Special Considerations", "Tolerates:", "frost - Spring crops may bolt prematurely if young plants are exposedto frost or a week of nighttime temperatures below 50 F. Wait untilafter last frost date to direct seed or transplant out.", "Special characteristics:", "not native to North America - Not known in the wild.  Probably developed from selections of oil seed varieties in China about 2,000 years ago.", "Special uses:", "edible landscaping", "Growing Information", "How to plant:", "Propagate by  seed", "Germination temperature: 50 F to 80 F", "Days to emergence: 4 to 7", "Seed can be saved 4 years.", "Maintenance and care:", "While not as sensitive to heat and cold as Chinese cabbage, springcrops may bolt prematurely if young plants are exposed to frost or aweek of nighttime temperatures below 50 F. Wait until after last frostdate to direct seed or transplant out.", "Starttransplants inside 4 to 6 weeks before last frost date. Transplant 6 to12 inches apart in rows 18 to 30 inches apart. Use the closer spacingsfor smaller varieties.", "Plant direct-seeded spring crops ¼ to ½inch deep and about 1 inch apart in rows 18 to 30 inches apart. Thin to6- to 12-inch spacings. Use thinnings in salads.", "For fall crops,direct seed ¼ to ½ inch deep in rows 18 to 30 inches apart in summer.Thin to 6- to 12- inch spacings. Or set transplants out at 6- to12-inch spacings 4 to 6 weeks before first frost.", "Mulch fall crops heavily and provide adequate moisture to avoid premature bolting.", "Varieties", "Browse", "bok choy/pak choy varieties", "at our", "Vegetable Varieties for Gardeners", "website.", "“Baby”varieties grow just 6 inches tall while others may reach nearly 2 feet.Some are more tolerant of heat and cold than others.", "Varieties recommended for New York include:", "Mei Qing Choi -- hybrid", "Tropical Delight -- hybrid", "Two Seasons -- hybrid", "China Pride -- hybrid", "Jade Pagoda -- hybrid", "Dynasty -- hybrid", "©2006", "Cornell University", ". All rights reserved."], "Image_Url": "https://duckduckgo.com/i/2479d8e5.jpg"}, "Broccoli": {"Sunlight Conditions": "full sun", "Plant Lifecycle": "annual", "Plant Care Difficulty": "moderately difficult", "Height": "2 to 3 feet", "Spread": "2 to 3 feet", "Optimal Germination Temperature": "45 F to 85 F       - Will germinate at soil temperatures as low as 40 F.", "Time to Germination": "Days to emergence: 4 to 7", "Soil Depth": "3 Inches", "Full Summary": ["Broccoli", "Vegetable (Cool Season) - Cabbage Family", "Brassica oleracea var. botrytis (Broccoli)", "Brassicaceae Family", "This cool-season crop grows best when daytime temperatures are in the60s F. Grow in both spring and fall, but avoid mid-summer crops as hotweather can cause premature bolting. Romanesco types are especiallyhandsome choices for edible landscaping.", "Site and Plant Characteristics", "Growing Information", "Varieties", "Site Characteristics", "Sunlight:", "full sun", "Can tolerate light shade but will slow maturity.", "Soil conditions:", "requires well-drained soil", "Prefers well-drained, fertile soil high in organic matter, pH 6.0 to7.5. Can tolerate slightly alkaline soil. Needs plentiful, consistentmoisture.", "Plant Traits", "Lifecycle:", "annual", "Biennial grown as an annual.", "Ease-of-care:", "moderately difficult", "Requires good soil, timely planting and protection from pests.", "Height:", "2 to 3 feet", "Spread:", "2 to 3 feet", "Bloom time:", "early summer", "mid-summer", "late summer", "early fall", "mid-fall", "Flower color:", "yellow", "Foliage color:", "medium green", "Some cultivars have a bluish cast.", "Foliage texture:", "medium", "Shape:", "upright", "Special Considerations", "Tolerates:", "frost", "Special characteristics:", "not native to North America - Not known in the wild.  Descended from wild Mediterranean kale.", "Special uses:", "edible landscaping - Romanesco varieties are especially well-suited for ornamental plantings", "Growing Information", "How to plant:", "Propagate by  seed", "Germination temperature: 45 F to 85 F - Will germinate at soil temperatures as low as 40 F.", "Days to emergence: 4 to 7", "Seed can be saved 3 years.", "Maintenance and care:", "Sow seeds indoors 6 to 8 weeks before average last spring frost. Keepsoil warm (about 75 F), until germination. Then keep plants around 60F. Provide direct sun so plants don’t get leggy. When plants are 4 to 6weeks old, transplant into garden 12 to 20 inches apart.", "Usewide spacings if you want to harvest large central heads. Closerspacings will produce smaller central heads. But if you harvestsecondary heads you will get a greater total yield from the closerspacings.", "Larger, older transplants are more likely to bolt whenexposed to cool temperatures in the garden. Transplant when plants havefour or five true leaves.", "Some cultivars will form small “button”heads when the weather turns warm following a 10-day stretch when hightemperatures only reach the 40s F.", "Can be direct-seeded as soonas you can work the soil. Will germinate at soil temps as low as 40 F.Plant ½ to ¾ inch deep, about 3 inches apart. Thin to final spacings.", "Direct seed in midsummer for fall crop, or start transplants in late May and transplant in late June or early July.", "In Zone 7 and warmer, fall broccoli crops will often overwinter.", "Use low nitrogen fertilizer at planting. Too much nitrogen fertilizer may cause hollow stems.", "Plantshave shallow root systems. Avoid even shallow cultivation. Mulch toprotect roots, reduce weed competition and conserve moisture.", "Use floating row covers to help protect from early insect infestations.", "To help reduce disease, do not plant broccoli or other cole crops in the same location more than once every three or four years.", "Pests:", "Cabbageworms - Handpick and destroy. Row covers may be useful on smallplantings to help protect plants from early damage. Put in place atplanting and remove before temperatures get too hot in midsummer.", "Fleabeetles - Use row covers to help protect plants from early damage. Putin place at planting and remove before temperatures get too hot inmidsummer. Control weeds.", "Cabbage root maggot - White maggots(larvae) attack all plants of the cabbage family. Larvae tunnel in andfeed on roots of plants. Damage causes wilting early on, death ofplants a little later on.", "Cabbage aphids - A hard stream of watercan be used to remove aphids from plants. Wash off with wateroccasionally as needed early in the day. Check for evidence of naturalenemies such as gray-brown or bloated parasitized aphids and thepresence of alligator-like larvae of lady beetles and lacewings.", "Other pests:", "Slugs and snails", "Cutworms", "Diseases:", "Clubroot - Locate new plants in a part of the garden different fromprevious year's location. If soil is infested, add lime to raise pH to7.2.", "Varieties", "Browse", "broccoli varieties", "at our", "Vegetable Varieties for Gardeners", "website.", "Mostpopular cultivars are hybrids, though some open-pollinated cultivarsare available. Cultivars mature at different rates, and some are bestfor fall crops. Choose several different maturity dates to spread outyour harvest. Some cultivars tolerate heat somewhat and are best forsummer harvests. Purple-headed cultivars are also available.", "Some varieties recommended for New York include:", "Baccus", "Calabrese", "Goliath", "Liberty", "Marathon", "Packman", "Premium Crop", "The Italian cultivar ‘Romanesco’ is actually a cauliflower, though usually included with broccoli in seed catalogs.", "“Broccoflowers” are a broccoli/cauliflower cross.", "©2006", "Cornell University", ". All rights reserved."], "Image_Url": "https://duckduckgo.com/i/b3c94767.jpg"}, "Broccoli raab": {"Sunlight Conditions": "full sun", "Plant Lifecycle": "annual", "Plant Care Difficulty": "moderately difficult", "Height": "1 to 1.5 feet", "Optimal Germination Temperature": "45 F to 85 F", "Time to Germination": "Days to emergence: 4 to 7", "Soil Depth": "3 Inches", "Full Summary": ["Broccoli raab", "Vegetable (Cool Season) - Cabbage Family", "Also known as spring raab", "Brassica ruvo", "Brassicaceae Family", "An Italian favorite with a somewhat bitter taste, this fast-growing,cool-season annual forms loose flower heads similar to broccoli in theaxils of lower leaves.", "Site and Plant Characteristics", "Growing Information", "Varieties", "Site Characteristics", "Sunlight:", "full sun", "Can tolerate light shade but will slow maturity.", "Soil conditions:", "requires well-drained soil", "Prefers well-drained, fertile soil high in organic matter, pH 6.0 to7.5. Can tolerate slightly alkaline soil. Needs plentiful, consistentmoisture.", "Plant Traits", "Lifecycle:", "annual", "Biennial grown as an annual.", "Ease-of-care:", "moderately difficult", "Height:", "1 to 1.5 feet", "Bloom time:", "early summer", "mid-summer", "late summer", "early fall", "mid-fall", "Flower color:", "yellow", "Foliage color:", "medium green", "Foliage texture:", "medium", "Shape:", "upright", "Special Considerations", "Tolerates:", "frost", "Special characteristics:", "not native to North America", "Special uses:", "edible landscaping", "Growing Information", "How to plant:", "Propagate by  seed", "Germination temperature: 45 F to 85 F", "Days to emergence: 4 to 7", "Maintenance and care:", "Grow similar to broccoli. Direct seed from early spring to late summer,about 1 inch apart and ¼ to ½ inch deep in rows 18 to 24 inches apart.Thin to 4 to 6 inches apart.", "Use floating row cover to protect from insects.", "Pests:", "Cabbageworms - Handpick and destroy. Row covers may be useful on smallplantings to help protect plants from early damage. Put in place atplanting and remove before temperatures get too hot in midsummer.", "Fleabeetles - Use row covers to help protect plants from early damage. Putin place at planting and remove before temperatures get too hot inmidsummer. Control weeds.", "Cabbage root maggot - White maggots(larvae) attack all plants of the cabbage family. Larvae tunnel in andfeed on roots of plants. Damage causes wilting early on, death ofplants a little later on.", "Cabbage aphids - A hard stream of watercan be used to remove aphids from plants. Wash off with wateroccasionally as needed early in the day. Check for evidence of naturalenemies such as gray-brown or bloated parasitized aphids and thepresence of alligator-like larvae of lady beetles and lacewings.", "Other pests:", "Slugs and snails", "Cutworms", "Diseases:", "Clubroot - Locate new plants in a part of the garden different fromprevious year's location. If soil is infested, add lime to raise pH to7.2.", "Varieties", "Browse", "broccoli raab varieties", "at our", "Vegetable Varieties for Gardeners", "website.", "©2006", "Cornell University", ". All rights reserved."], "Image_Url": "https://duckduckgo.com/i/2f5ee178.jpg"}, "Brussels sprouts": {"Sunlight Conditions": "full sun", "Plant Lifecycle": "annual", "Plant Care Difficulty": "moderately difficult", "Height": "2 to 3 feet", "Spread": "1.5 to 2 feet", "Optimal Germination Temperature": "45 F to 85 F       - Will germinate at soil temperatures as low as 40 F.", "Time to Germination": "Days to emergence: 5 to 8", "Soil Depth": "3 Inches", "Full Summary": ["Brussels sprouts", "Vegetable (Cool Season) - Cabbage Family", "Brassica oleracea var. gemmifera", "Brassicaceae Family", "This cool-season crop is most flavorful after it is “kissed” by frost.Keep plantings moist and well-mulched during the heat of summer, andyou will be rewarded with sprouts until Christmas or beyond.", "Site and Plant Characteristics", "Growing Information", "Varieties", "Site Characteristics", "Sunlight:", "full sun", "Can tolerate light shade but will slow maturity.", "Soil conditions:", "requires well-drained soil", "Prefers well-drained, fertile soil high in organic matter, pH 6.0 to7.5. Can tolerate slightly alkaline soil. Needs plentiful, consistentmoisture.", "Plant Traits", "Lifecycle:", "annual", "Biennial grown as an annual.", "Ease-of-care:", "moderately difficult", "Requires good soil, timely planting and protection from pests.", "Height:", "2 to 3 feet", "Spread:", "1.5 to 2 feet", "Foliage color:", "medium green", "Foliage and sprouts have bluish cast.", "Foliage texture:", "medium", "Shape:", "upright", "Special Considerations", "Tolerates:", "frost - Frost improves flavor.  Harvest continues until Christmas or even later in some warmer areas.", "Special characteristics:", "not native to North America - Not known in the wild.  Descended from wild Mediterranean kale.", "Growing Information", "How to plant:", "Propagate by  seed", "Germination temperature: 45 F to 85 F - Will germinate at soil temperatures as low as 40 F.", "Days to emergence: 5 to 8", "Maintenance and care:", "Grow in summer for fall harvest, similar to a fall cabbage or broccoli crop.", "Directseed about 4 months before expected fall frost. Plant seed 3 to 4inches apart, ¼ to ½ inch deep in rows about 30 inches apart. Thinplants to about 18 inches apart.", "Start transplants in late May and transplant in late June or early July.  Space plants 18 to 24 inches apart.", "Plantshave shallow root systems. Avoid even shallow cultivation. Mulch toprotect roots, reduce weed competition and conserve moisture.", "Use floating row covers to help protect from early insect infestations.", "Tohelp reduce disease, do not plant Brussels sprouts or other cole cropsin the same location more than once every three or four years.", "Pests:", "Cabbage aphids - A hard stream of water can be used to remove aphidsfrom plants. Wash off with water occasionally as needed early in theday. Check for evidence of natural enemies such as gray-brown orbloated parasitized aphids and the presence of alligator-like larvae oflady beetles and lacewings.", "Cabbageroot maggot - White maggot larvae tunnel in and feed on roots ofplants. Damage causes wilting early on, death of plants later on.", "Cabbageworms- Handpick and destroy. Row covers may be useful on small plantings tohelp protect plants from early damage. Put in place at planting andremove before temperatures get too hot in midsummer.", "FleaBeetles - Use row covers to help protect plants from early damage. Putin place at planting and remove before temperatures get too hot inmidsummer. Control weeds.", "Cutworms - Control weeds. Cardboard collars around each plant give good protection.", "Other pests:", "Cabbage loopers", "Slugs", "Nematodes", "Diseases:", "Clubroot - Locate plants in a part of the garden different fromprevious year's location. If soil is infested, add lime to raise pH ofsoil to 7.2", "Varieties", "Browse", "brussels sprout varieties", "at our", "Vegetable Varieties for Gardeners", "website.", "Shorter plants tend to mature earlier and be more cold tolerant. Days to harvest varies from about 80 to 130 days.", "Varieties recommended for New York include:", "Oliver", "Rubine Red", "©2006", "Cornell University", ". All rights reserved."], "Image_Url": "https://duckduckgo.com/i/617d8e7d.jpg"}, "Cabbage": {"Sunlight Conditions": "full sun", "Plant Lifecycle": "annual", "Plant Care Difficulty": "moderately difficult", "Height": "1 to 2 feet", "Spread": "1.5 to 3 feet", "Optimal Germination Temperature": "45 F to 85 F       - Will germinate at soil temperatures as low as 40 F.", "Time to Germination": "Days to emergence: 4 to 7", "Soil Depth": "3 Inches", "Full Summary": ["Cabbage", "Vegetable (Cool Season) - Cabbage Family", "Brassica oleracea var. capitata", "Brassicaceae Family", "This cool-season crop grows best when daytime temperatures are in the60s F. Direct-seed or transplant spring crops for fresh use in summer.Plant fall crops for winter storage or sauerkraut.", "Site and Plant Characteristics", "Growing Information", "Varieties", "Site Characteristics", "Sunlight:", "full sun", "Can tolerate light shade but will slow maturity.  Light shade can be beneficial in warm weather.", "Soil conditions:", "requires well-drained soil", "Prefers well-drained, fertile soil high in organic matter, pH 6.0 to7.5. Can tolerate slightly alkaline soil. This heavy feeder also needsplentiful, consistent moisture.", "Plant Traits", "Lifecycle:", "annual", "Biennial grown as an annual.", "Ease-of-care:", "moderately difficult", "Requires good soil, timely planting and protection from pests.", "Height:", "1 to 2 feet", "Spread:", "1.5 to 3 feet", "Foliage color:", "light green", "medium green", "dark green", "red", "purple", "Some green varieties have a bluish cast.", "Foliage texture:", "coarse", "Shape:", "cushion, mound or clump", "Special Considerations", "Tolerates:", "frost - Tender leaves inside the head can be damaged by heavy freezes while the outer leaves appear unaffected.", "Special characteristics:", "not native to North America - Not known in the wild.  Descended from wild Mediterranean kale.", "Special uses:", "edible landscaping", "Growing Information", "How to plant:", "Propagate by  seed", "Germination temperature: 45 F to 85 F - Will germinate at soil temperatures as low as 40 F.", "Days to emergence: 4 to 7", "Seed can be saved 5 years.", "Maintenance and care:", "Sow seeds indoors 6 to 8 weeks before average last spring frost. Keepsoil warm (about 75 F) until germination. Then keep plants around 60 F.Provide direct sun so plants don’t get leggy. When plants are 4 to 6weeks old, transplants into garden 12 to 24 inches apart, in rows 18 to34 inches apart. Use closer spacings for smaller, early varieties,wider spacings for larger, late-season varieties.", "Canbe direct seeded as soon as you can work the soil. Will germinate atsoil temps as low as 40 F. Plant ½ to ¾ inch deep, about 3 inchesapart. Thin to final spacings.", "Direct seed in summer for fall crop, or start transplants in late May and transplant in late June or early July.", "Plantshave shallow root systems. Avoid even shallow cultivation. Mulch toprotect roots, reduce weed competition and conserve moisture.", "Use floating row cover to protect crop from early pests.", "Whenheads are mature, they are prone to splitting in response to any stressor a rain following a dry period. Avoid splitting by choosing varietiesthat resist splitting, spacing plants close together (8 to 12 inchesfor early varieties, 12 to 16 inches for later varieties), using shovelto sever roots on one side about 6 inches from the plant, or twistingplants after heads have firmed to break some of the roots.", "To help reduce disease, do not plant cabbage or other cole crops in the same location more than once every three or four years.", "Pests:", "Cabbage aphids - A hard stream of water can be used to remove aphidsfrom plants. Wash off with water occasionally as needed early in theday. Check for evidence of natural enemies such as gray-brown orbloated parasitized aphids and the presence of alligator-like larvae oflady beetles and lacewings.", "Cabbageroot maggot - White maggot larvae tunnel in and feed on roots ofplants. Damage causes wilting early on, death of plants later on.", "Cabbageworms- Handpick and destroy. Row covers may be useful on small plantings tohelp protect plants from early damage. Put in place at planting andremove before temperatures get too hot in midsummer.", "FleaBeetles - Use row covers to help protect plants from early damage. Putin place at planting and remove before temperatures get too hot inmidsummer. Control weeds.", "Cutworms - Control weeds.  Cardboard collars around each plant give good protection.", "Other pests:", "Cabbage loopers", "Slugs", "Nematodes", "Diseases:", "Clubroot - Locate new plants in part of garden different from previousyear's location. If soil infested, add lime to raise soil pH to 7.2", "Purple blotch (", "Alternaria porri", ")- Avoid wetting foliage if possible. Water early in the day soaboveground plant parts dry as quickly as possible. Avoid crowdingplants, allowing air circulation. Eliminate weeds around plants andgarden area to increase air circulation. Practice plant sanitation.When plants are not wet, remove and destroy affected plant parts. Inautumn rake and destroy all fallen or diseased", "leaves and fruit.", "Other diseases:", "Cabbage yellows", "Black rot", "Black leg", "Varieties", "Browse", "cabbage varieties", "at our", "Vegetable Varieties for Gardeners", "website.", "Plantearly, midseason and late varieties to spread out harvest. Earlyvarieties tend not to store well. Late varieties tend to be better forstorage or for making sauerkraut.", "Some varieties are resistant to certain diseases and insects.", "Varieties may vary in head size, shape (round, flat, conical) and colors (green, red or purple).", "Savoycabbage has wrinkled leaves, and is sometimes classed in a differentgroup, Brassica oleracea var. sabuada. Savoy varieties are prized fortheir flavor as well as their good looks.", "Varieties recommended for New York include:", "Early:", "Jersey Wakefield", "Heads Up", "Pacifica", "Tastie", "Midseason:", "Chieftain Savoy", "Lennox", "Market Prize", "Ruby Perfection", "Savoy Ace", "Savoy King", "Late:", "Huron", "©2006", "Cornell University", ". All rights reserved."], "Image_Url": "https://duckduckgo.com/i/b4c78134.jpg"}, "Chinese cabbage": {"Plant Lifecycle": "annual", "Plant Care Difficulty": "moderately difficult", "Height": "1 to 2 feet", "Spread": "1 to 1.5 feet", "Optimal Germination Temperature": "50 F to 80 F", "Time to Germination": "Days to emergence: 4 to 7", "Soil Depth": "3 Inches", "Full Summary": ["Chinese cabbage", "Vegetable (Cool Season) - Cabbage Family", "Brassica rapa  var. pekinensis", "Brassicaceae Family", "This cool-season crop combines the flavor of cabbage and the texture ofromaine lettuce, but exposing young plants to frost or prolongedtemperatures below 50 F may cause them to bolt prematurely. Fall cropsare more reliable.", "Site and Plant Characteristics", "Growing Information", "Varieties", "Site Characteristics", "Sunlight:", "part shade", "full shade", "Partial shade can help prevent summer crops from bolting.", "Soil conditions:", "requires well-drained soil", "Prefers well-drained, fertile soil high in organic matter, pH 6.0 to7.5. Can tolerate slightly alkaline soil. Needs plentiful, consistentmoisture.", "Plant Traits", "Lifecycle:", "annual", "Biennial grown as an annual.", "Ease-of-care:", "moderately difficult", "Spring crops require good timing and careful pest control.  Direct-seeded fall crops are easier to grow.", "Height:", "1 to 2 feet", "Spread:", "1 to 1.5 feet", "Foliage color:", "light green", "medium green", "Usually with white veins and stalks.", "Foliage texture:", "medium", "Shape:", "cushion, mound or clump", "Special Considerations", "Tolerates:", "frost - Spring crops may bolt prematurely if young plants are exposedto frost or a week of nighttime temperatures below 50 F. Wait untilafter last frost date to direct seed or transplant out.", "Growing Information", "How to plant:", "Propagate by  seed", "Germination temperature: 50 F to 80 F", "Days to emergence: 4 to 7", "Seed can be saved 4 years.", "Maintenance and care:", "Spring crops may bolt prematurely if young plants are exposed to frostor a week of nighttime temperatures below 50 F. Wait until after lastfrost date to direct seed or transplant out.", "Starttransplants inside 4 to 6 weeks before last frost date. Transplant 12to 18 inches apart in rows 18 to 30 inches apart. Closer spacingsproduce smaller, more flavorful heads.", "From late spring to midsummer, direct-seed ¼ to ½ inch deep in rows 18 to 30 inches apart.  Thin to 12- to 18- inch spacings.", "Pests:", "Cabbage aphids - A hard stream of water can be used to remove aphidsfrom plants. Wash off with water occasionally as needed early in theday. Check for evidence of natural enemies such as gray-brown orbloated parasitized aphids and the presence of alligator-like larvae oflady beetles and lacewings.", "Cabbageroot maggot - White maggot larvae tunnel in and feed on roots ofplants. Damage causes wilting early on, death of plants later on.", "Cabbageworms- Handpick and destroy. Row covers may be useful on small plantings tohelp protect plants from early damage. Put in place at planting andremove before temperatures get too hot in midsummer.", "FleaBeetles - Use row covers to help protect plants from early damage. Putin place at planting and remove before temperatures get too hot inmidsummer. Control weeds.", "Cutworms - Control weeds. Cardboard collars around each plant give good protection.", "Other pests:", "Cabbage loopers", "Slugs", "Nematodes", "Diseases:", "Clubroot - Locate new plants in part of garden different from previousyear's location. If soil infested, add lime to raise soil pH to 7.2", "Purpleblotch (Alternaria porri ) - Avoid wetting foliage if possible. Waterearly in the day so aboveground plant parts dry as quickly as possible.Avoid crowding plants, allowing air circulation. Eliminate weeds aroundplants and garden area to increase air circulation. Practice plantsanitation. When plants are not wet, remove and destroy affected plantparts. In autumn rake and destroy all fallen or diseased", "leaves and fruit.", "Other diseases:", "Cabbage yellows", "Black rot", "Black leg", "Varieties", "Browse", "Chinese cabbage varieties", "at our", "Vegetable Varieties for Gardeners", "website.", "Look for disease resistance, size and shape of head.", "Varieties recommended for New York include:", "Blues", "Jade Pagoda", "©2006", "Cornell University", ". All rights reserved."], "Image_Url": "https://duckduckgo.com/i/150de7e1.jpg"}, "Carrots": {"Sunlight Conditions": "full sun", "Plant Lifecycle": "Biennial grown as an annual.", "Plant Care Difficulty": "easy", "Optimal Germination Temperature": "50 F to 85 F       - Will germinate at temperatures as low a 40 F.  Will germinate in about a week at 75 F, with adequate moisture.", "Time to Germination": "Days to emergence: 7 to 21", "Full Summary": ["Carrots", "Vegetable (Cool Season) - Parsley Family", "Daucus carota var. sativus", "Umbelliferae Family", "Careful attention to the soil makes these Vitamin A-rich roots a snapto grow. Plant in deep, stone-free soil (a raised bed is great) with afine surface. Thin and weed carefully, and mulch to keep soil cool.", "Site and Plant Characteristics", "Growing Information", "Varieties", "Site Characteristics", "Sunlight:", "full sun", "Will tolerate very light shade.", "Soil conditions:", "requires well-drained soil", "Good quality roots require plentiful moisture and soil that is deep,loose, free of stones, and high in organic matter. Roots can becometwisted and forked in heavy, stony soil. Prefers pH of 6.0 to 6.8 butcan tolerate 5.5 to 7.5. Requires only moderate nitrogen. Too much cancause root branching.", "Plant Traits", "Lifecycle:", "Biennial grown as an annual.", "Ease-of-care:", "easy", "Great crop for kids if planted in deep soil and site gets full sun.", "Foliage color:", "medium green", "Foliage texture:", "fine", "Shape:", "cushion, mound or clump", "Special Considerations", "Tolerates:", "frost - Tolerates light frost.", "Special characteristics:", "not native to North America - Mediterranean origin.  First orange carrots probably developed in The Netherlands about 1600.", "Special uses:", "edible landscaping", "Growing Information", "How to plant:", "Propagate by  seed", "Germination temperature: 50 F to 85 F - Will germinate at temperatures as low a 40 F.  Will germinate in about a week at 75 F, with adequate moisture.", "Days to emergence: 7 to 21", "Seed can be saved 3 years.", "Maintenance and care:", "Plant in spring, 2 to 3 weeks before last frost, ½ inch deep, ½ inchapart, in rows 12 to 24 inches apart. Deeply worked soil with fine,weed-free seedbed will greatly improve chances of successful crop.", "Carrotsare slow to germinate (1 to 3 weeks), and often germinate unevenly overa period of several weeks. To speed germination, water lightly daily ifsoil is dry.", "Thinning is critical to reduce competition fromneighboring plants. Thin to 1- to 4-inch spacings (depending on size ofroot desired) before plants are 2 inches tall. Cutting rather thanpulling reduces disturbance of the remaining plants.", "To improvegermination in dry weather: Make a small furrow, about 2 inches deep.Plant seed and cover with about ½ inch of soil. Cover furrow with aboard to retain soil moisture until seeds germinate.", "Tip: Sowradishes in the same row. They germinate quickly, break the soil crust,and mark the row. Thin and/or harvest radishes before they compete withcarrots.", "Use seed tape or pelleted seed for more even spacingsand less thinning. Or mix seed in roughly equal proportions with sand,fine vermiculite, or dried coffee grounds.", "Mulch to keep soilcool, conserve moisture and to keep exposed \"shoulders\" from turninggreen and bitter. Another option is to hill soil over the shoulders.", "Makeadditional plantings every three weeks through midsummer for continuoussupply and fall harvest. Sowing in very early spring is possible, butsome varieties will bolt if temperatures are too cold. Plant crops forfall harvest about 10 to 12 weeks before first frost.", "Rootquality is best when soil temperatures are 60 F to 70 F. The shape ofthe root is determined within the first few weeks after germinationwhen the new plant extends its taproot deep into the soil. If itencounters obstacles (such as rocks or high water table) or is damaged,shape and quality of the root will suffer.", "To prevent diseases, don’t plant carrots in the same spot more than once every 3 years.", "Pests:", "Avoid planting on ground that was in sod the previous season.  Use fabric covers to exclude insects.", "Carrotrust fly - Harvest all carrots by September 1 in upstate New York, byAugust 20 farther South, to avoid second brood injury.", "Carrot weevil - Clean up garden debris in autumn.  Beneficial nematodes are available. Apply as directed on label.", "Leafhopper - Leafhoppers spread disease causing carrots to be woody, hairy and bitter.  No cultural control is available.", "Other pests:", "Slugs", "Varieties", "Browse", "carrot varieties", "at our", "Vegetable Varieties for Gardeners", "website.", "Carrot varieties generally fall into one of six types:", "Imperator -- Up to 10 inches long, slender.", "Danvers -- Up to 7 inches long, slender, but wider at the top than the Imperator types and have strong flavor.", "Nantes -- Up to 7 inches long, more cylindrical than tapered, sweet flavor.", "Chantenay -- Up to 5 inches, wide at the top and tapering.", "Amsterdam -- Up to 3 inches long, thin and slender, good for early harvest and less-than-ideal soil conditions.", "Paris Market -- Round, short, about 1 ½ inches in diameter.", "Only grow longer varieties if your soil is deep, loose and stone- and clod-free.", "Choose short-season varieties for early planting and summer eating. Choose longer-season varieties for fall harvest and storage.", "Some varieties recommended for New York include:", "Bolero", "Cosmic Purple", "Healthmaster", "Kinko", "Royal Chantenay", "Rumba", "©2006", "Cornell University", ". All rights reserved."], "Image_Url": "https://duckduckgo.com/i/bf894751.jpg"}, "Cauliflower": {"Sunlight Conditions": "full sun", "Plant Lifecycle": "annual", "Plant Care Difficulty": "difficult", "Height": "1 to 2 feet", "Spread": "1.3 to 3 feet", "Optimal Germination Temperature": "45 F to 85 F       - Will germinate at soil temperatures as low as 40 F.", "Time to Germination": "Days to emergence: 4 to 7", "Soil Depth": "3 Inches", "Full Summary": ["Cauliflower", "Vegetable (Cool Season) - Cabbage Family", "Brassica oleracea var. botrytis (Cauliflower)", "Brassicaceae Family", "The most finicky and difficult of the cole (cabbage family) crops togrow, cauliflower flourishes when temperatures are moderate. Purple(left), orange and yellow-green colored varieties make good addition toflower gardens.", "Site and Plant Characteristics", "Growing Information", "Varieties", "Site Characteristics", "Sunlight:", "full sun", "Can tolerate light shade but will slow maturity.  Light shade can be beneficial in warm weather.", "Soil conditions:", "requires well-drained soil", "Prefers well-drained, fertile soil high in organic matter, pH 6.0 to7.5. Can tolerate slightly alkaline soil. Needs plentiful, consistentmoisture.", "Plant Traits", "Lifecycle:", "annual", "Biennial grown as an annual.", "Ease-of-care:", "difficult", "Inaddition to tying heads to blanch white-headed varieties, cauliflowerrequires good soil, timely planting and protection from pests.", "Height:", "1 to 2 feet", "Spread:", "1.3 to 3 feet", "Foliage color:", "medium green", "dark green", "Some varieties have white stems and veins.", "Foliage texture:", "medium", "Shape:", "cushion, mound or clump", "Special Considerations", "Tolerates:", "frost - Mature heads will not tolerate hard freezes.", "Special characteristics:", "not native to North America - Not known in the wild.  Descended from wild Mediterranean kale.", "Growing Information", "How to plant:", "Propagate by  seed", "Germination temperature: 45 F to 85 F - Will germinate at soil temperatures as low as 40 F.", "Days to emergence: 4 to 7", "Seed can be saved 5 years.", "Maintenance and care:", "Most finicky of the cole (cabbage family) crops. Heads will not developproperly in hot or dry weather, so timing is crucial. Will toleratecold as well as other cole crops in spring, but mature heads are notresistant to hard freezes.", "Sowseeds indoors 4 to 6 weeks before average last spring frost. Keep soilwarm (about 75 F), until germination. Then keep plants around 60 F.Provide direct sun so plants don’t get leggy. When plants are 4 to 6weeks old, transplant into garden 15 to 24 inches apart in rows 24 to36 inches apart. Wait until soil temperature is 50 F or above anddanger of frost is past before transplanting.", "Larger, oldertransplants are more likely to bolt when exposed to cool temperaturesin the garden. Transplant when plants have four or five true leaves.", "Somecultivars will form small “button” heads when the weather turns warmfollowing a 10-day stretch when high temperatures only reach the 40s F.", "Direct seeding is more difficult than with other cole crops,especially in spring. For fall crops, plant seed in late-spring earlysummer ½ to ¾ inch deep, about 3 inches apart. Thin to final spacings.Or start transplants in late May and transplant in late June or earlyJuly.", "Plants have shallow root systems. Avoid even shallowcultivation. Mulch to protect roots, reduce weed competition andconserve moisture.", "To preserve the white color of the curd, usestring or rubber bands to secure outside leaves over the head when itis about 2 to 3 inches in diameter. From tying to harvest may take lessthan a week in summer or as long as a month in fall.", "Too much sun, heat or nitrogen fertilizer can cause “ricey” heads where the curd separates into small, rice-like grains.", "Pests:", "Cabbageworms - Handpick and destroy. Row covers may be useful on smallplantings to help protect plants from early damage. Put in place atplanting and remove before temperatures get too hot in midsummer.", "Fleabeetles - Use row covers to help protect plants from early damage. Putin place at planting and remove before temperatures get too hot inmidsummer. Control weeds.", "Cabbage root maggot - White maggots(larvae) attack all plants of the cabbage family. Larvae tunnel in andfeed on roots of plants. Damage causes wilting early on, death ofplants a little later on.", "Cabbage aphids - A hard stream of watercan be used to remove aphids from plants. Wash off with wateroccasionally as needed early in the day. Check for evidence of naturalenemies such as gray-brown or bloated parasitized aphids and thepresence of alligator-like larvae of lady beetles and lacewings.", "Other pests:", "Slugs and snails", "Cutworms", "Diseases:", "Clubroot - Locate new plants in a part of the garden different fromprevious year's location. If soil is infested, add lime to raise pH to7.2", "Purple blotch (", "Alternaria porri", ")- Avoid wetting foliage if possible. Water early in the day soaboveground plant parts dry as quickly as possible. Avoid crowdingaround plants; space apart to allow air circulation. Eliminate weedsaround plants and garden area to improve circulation. Practivesanitation: when plants are not wet, carefully remove and destroyaffected plant parts. In autumn, rake and dispose of all fallen ordiscarded leaves and fruit.", "Other diseases:", "Black rot", "Black leg", "Cabbage yellows", "Varieties", "Browse", "cauliflower varieties", "at our", "Vegetable Varieties for Gardeners", "website.", "Chose several maturity dates for extended harvest.", "Somevarieties have leaves that cover the head, making it less critical totie leaves around the head to blanch. Purple-, orange- andyellow-green-headed varieties don’t need tying.", "Orange heads high in beta-carotene.", "Lookfor varieties that are cold- and/or heat-tolerant. Heat-tolerantvarieties are usually more easily damaged by frost when mature, so theyare not good choices for fall crops. Those that are cold-tolerantusually don’t make good spring crops, because they are less likely tostand up to heat when they mature.", "“Broccoflowers” are a broccoli/cauliflower cross.", "Varieties recommended for New York include:", "Alert", "Amazing", "Candid Charm", "Cheddar", "Early White", "Self Blanche", "Snow Crown", "Violet Queen", "©2006", "Cornell University", ". All rights reserved."], "Image_Url": "https://duckduckgo.com/i/708921e4.jpg"}, "Celeriac": {"Sunlight Conditions": "full sun", "Plant Lifecycle": "annual", "Plant Care Difficulty": "moderately difficult", "Optimal Germination Temperature": "70 F to 75 F       - Optimum when starting indoors.", "Time to Germination": "Days to emergence: 14 to 21", "Soil Depth": "3 Inches", "Full Summary": ["Celeriac", "Vegetable (Cool Season) - Parsley Family", "Also known as root celery, knob celery", "Apium graveolens  var. Rapaceum", "Umbelliferae Family", "Celeriac is closely related to celery, but easier to grow. It is prizedfor its crisp, celery-flavored root, which you can eat raw or cooked. Astaple in Europe, it is little known in North America.", "Site and Plant Characteristics", "Growing Information", "Varieties", "Site Characteristics", "Sunlight:", "full sun", "part shade", "Prefers full sun.", "Soil conditions:", "tolerates damp soil", "Like celery, celeriac prefers rich soil, high in organic matter with pH6.0 to 7.0, and plentiful, consistent moisture. But it will tolerateless-than-ideal conditions.", "Plant Traits", "Lifecycle:", "annual", "Biennial grown as an annual.", "Ease-of-care:", "moderately difficult", "Foliage color:", "medium green", "dark green", "Foliage texture:", "medium", "Shape:", "cushion, mound or clump", "upright", "Special Considerations", "Tolerates:", "frost - More frost-tolerant than celery.", "Special characteristics:", "not native to North America - Mediterranean origin.", "Growing Information", "How to plant:", "Propagate by  seed", "Germination temperature: 70 F to 75 F - Optimum when starting indoors.", "Days to emergence: 14 to 21", "Maintenance and care:", "Grow celeriac similar to celery. Start plants inside about 10 to 12weeks before last frost. Plant several seeds per cell. Seeds need lightto germinate, so don’t cover seed deeply. 50 percent germination isconsidered good for this crop.", "Keepsoil moist and warm (about 70 F to 75 F) until seeds germinate in 2 to3 weeks. After germination, grow inside in a cool location (about 60 Fto 70 F). Thin to one plant per cell.", "Set out transplants closelyspaced - just 6 to 8 inches apart, about 2 weeks before average lastfrost. Plants can withstand light to moderate frosts.", "Mulch or hill soil over root shoulders to keep them covered.", "In Zone 7 and warmer, can be planted in summer for winter and spring harvest.", "Varieties", "Browse", "celeriac varieties", "at our", "Vegetable Varieties for Gardeners", "website.", "Lookfor different sized roots and days to harvest, usually 110 to 130 days.Several heirloom varieties are available, though many seed catalogsjust list the generic species.", "©2006", "Cornell University", ". All rights reserved."], "Image_Url": "https://duckduckgo.com/i/c6567859.jpg"}, "Celery": {"Sunlight Conditions": "full sun", "Plant Lifecycle": "annual", "Plant Care Difficulty": "difficult", "Optimal Germination Temperature": "70 F to 75 F       - Optimum when starting indoors.", "Time to Germination": "Days to emergence: 14 to 21", "Soil Depth": "3 Inches", "Full Summary": ["Celery", "Vegetable (Cool Season) - Parsley Family", "Apium graveolens  var. dulce", "Umbelliferae Family", "Perhaps the most difficult vegetable to grow in many areas, thislong-season crop must be started inside. Seeds are slow to germinate,and if transplanted outside too early, plants will bolt in response tocold. Also requires consistent moisture and dislikes heat.", "Site and Plant Characteristics", "Growing Information", "Varieties", "Site Characteristics", "Sunlight:", "full sun", "part shade", "Prefers full sun.", "Soil conditions:", "tolerates damp soil", "requires high fertility", "Prefers rich soil, high in organic matter with pH 6.0 to 7.0 andconsistent, plentiful supply of moisture. Can tolerate soils that areless than well-drained because it was originally a wetland plant.", "Plant Traits", "Lifecycle:", "annual", "Biennial grown as an annual.", "Ease-of-care:", "difficult", "Seedsneed to be started inside and are difficult to germinate. Cold weatherafter transplanting can cause bolting. Needs plentiful moisture andlong season, but doesn’t tolerate heat well.", "Foliage color:", "medium green", "Foliage texture:", "medium", "Shape:", "cushion, mound or clump", "upright", "Special Considerations", "Tolerates:", "frost - Will tolerate light frost but can be damaged by a moderate frost.", "Special characteristics:", "not native to North America - Mediterranean origin.", "Growing Information", "How to plant:", "Propagate by  seed", "Germination temperature: 70 F to 75 F - Optimum when starting indoors.", "Days to emergence: 14 to 21", "Seed can be saved 5 years.", "Maintenance and care:", "Start plants inside about 10 to 12 weeks before last frost. Plantseveral seeds per cell. Seeds need light to germinate, so don’t coverseed deeply. Keep soil moist and warm (about 70 F to 75 F) until seedsgerminate in 2 to 3 weeks. After germination, grow inside in a coollocation (about 60 F to 70 F). Thin to one seed per cell.", "Plantswill withstand light frost, but 10 days with night temperatures below40 and days below 55 F can cause bolting. So harden plants by reducingwater, not lowering temperature.", "Set out transplants 6 to 12 inches apart, rows 18 to 36 inches apart, about 2 weeks before average last frost.", "Plantsare shallow-rooted and require consistent moisture. Lack of water willmake stalks fibrous and bitter. Mulch to retain moisture, suppressweeds and avoid disturbing roots when cultivating.", "For a milder flavor, blanch by wrapping stalks two weeks before harvest with paper, a cardboard milk carton or other material.", "Pests:", "Aphids", "Tarnished plant bug", "Cabbage loopers", "Whiteflies", "Cutworms", "Use floating row covers early in the season, and collars if cutworms are present.", "Diseases:", "Leaf blights", "Celery mosaic", "Black heart - calcium deficiency, add lime", "Celery diseases are rarely a problem in home gardens.", "Varieties", "Browse", "celery varieties", "at our", "Vegetable Varieties for Gardeners", "website.", "Look for different days to maturity, bolt-resistance, and color - green, red or yellow “self-blanching” types.", "Celeriac or root celery is a different variety of the same species grown for its root.  (See", "Celeriac ", ".)", "©2006", "Cornell University", ". All rights reserved."], "Image_Url": "https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2Ftse1.mm.bing.net%2Fth%3Fid%3DOIP.1ILchOtpVThWQ8a9jH5ZSQHaD4%26pid%3DApi&f=1"}, "Chives": {"Sunlight Conditions": "full sun", "Plant Lifecycle": "perennial", "Plant Care Difficulty": "easy", "Height": "0.5 to 1 feet", "Optimal Germination Temperature": "45 F to 95 F", "Time to Germination": "Days to emergence: 7 to 21", "Soil Depth": "Up to 24 Inches", "Full Summary": ["Chives", "Herbaceous Perennial Flower, Herb, Vegetable (Cool Season) - Onion Family", "Allium schoenoprasum", "Alliaceae Family", "Great for dressing up potatoes and spicing up salads, this easy-to-growAllium’s pinkish-lavender flowers make an attractive clump or edging inflower gardens.", "Site and Plant Characteristics", "Growing Information", "Varieties", "Site Characteristics", "Sunlight:", "full sun", "part shade", "Soil conditions:", "tolerates acid soil", "tolerates droughty soil", "tolerates damp soil", "tolerates low fertility", "While chives will tolerate a wide range of soil conditions, they preferslightly acid soil (pH 6.2 to 6.8) with moderate fertility and highorganic matter.", "Hardiness zones:", "3 to 9", "Chinese and garlic chives (", "Allium tuberosum", ") are slightly less hardy, only to Zone 4 without extra winter protection.", "Special locations:", "outdoor containers", "rock gardens", "Plant Traits", "Lifecycle:", "perennial", "Ease-of-care:", "easy", "Height:", "0.5 to 1 feet", "Chinese and garlic chives (", "Allium tuberosum", ") grow up to 2 feet tall.", "Bloom time:", "late spring", "early summer", "late summer", "early fall", "Flower color:", "red", "violet", "white", "pink", "Thecommon garden chive has pinkish lavender flowers. The cultivar‘Forescate’ has rose red flowers. 'Corsica\" and 'albiflorum' have whiteflowers. Chinese and garlic chives (Allium tuberosum) have whiteflowers.", "Foliage color:", "medium green", "Foliage texture:", "fine", "Shape:", "cushion, mound or clump", "upright", "grass-like", "Spreading clump of upright, grass-like leaves.", "Special Considerations", "Special characteristics:", "deer resistant", "not native to North America - Mediterranean origin", "evergreen - In cold areas, dies back to the ground.", "Special uses:", "cut flowers", "edible flowers", "edible landscaping", "Growing Information", "How to plant:", "Propagate by  seed, division or separation  - Direct seed, divide or transplant in spring or fall.", "Germination temperature: 45 F to 95 F", "Days to emergence: 7 to 21", "Seed can be saved 3 years.", "Maintenance and care:", "In spring or fall, direct seed onto well-prepared seedbed (coveringvery lightly), or transplant established plants. (If starting fromseed, plants probably won’t be large enough to harvest for at least ayear.)", "Regularcutting helps keep plants vigorous and healthy and encouragesspreading. Keep flowers picked to discourage dormancy in warm weather.", "No fertilizer is needed if planted in reasonably fertile soil.  Plants harvested frequently benefit from nitrogen top-dressing.", "Divide and replant clump in fresh soil every three to five years.", "More growing information:", "How to Grow Perennials", "Pests:", "Not usually harmed.", "Diseases:", "Not usually infected.", "Varieties", "Browse", "chive varieties", "at our", "Vegetable Varieties for Gardeners", "website.", "The cultivar ‘Forescate’ has rose red flowers.  'Corsica' and 'albiflorum' have white flowers.", "Garlic chives and Chinese chives both have garlic flavor, and belong to a different species,", "Allium tuberosum", ".  They grow taller (up to 2 feet) than common garden chives, and have white flowers.", "©2006", "Cornell University", ". All rights reserved."], "Image_Url": "https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2Ftse1.mm.bing.net%2Fth%3Fid%3DOIP.YNrHZx0yfwwZaF0rJGFitwHaEe%26pid%3DApi&f=1"}, "Claytonia": {"Sunlight Conditions": "full sun", "Plant Lifecycle": "perennial", "Plant Care Difficulty": "easy", "Optimal Germination Temperature": "50 F to 55 F", "Time to Germination": "Days to emergence: 7 to 10", "Soil Depth": "Up to 24 Inches", "Full Summary": ["Claytonia", "Vegetable (Cool Season) - Salad Greens", "Also known as Miner’s lettuce, winter purslane", "Claytonia perfoliata", "Portulacaceae Family", "Synonym:", "Montia perfoliata", "This cool-season salad green readily self-seeds and can overwinter inZone 6 and warmer. While somewhat aggressive, it makes a handsomelow-growing cover for edible landscaping.", "Site and Plant Characteristics", "Growing Information", "Varieties", "Site Characteristics", "Sunlight:", "full sun", "part shade", "Prefers part shade in hot weather.", "Soil conditions:", "tolerates low fertility", "Prefers moist, sandy-loam soils, rich in organic matter, near-netural pH 6.5 to 7.  Needs consistent moisture.", "Hardiness zones:", "6 to 9", "Often overwinters unprotected in Zone 6, and can be grown as a winter crop in Zone 7.", "Plant Traits", "Lifecycle:", "perennial", "Usually grown as an annual in Zone 5 and colder.", "Ease-of-care:", "easy", "Flower color:", "white", "Foliage color:", "dark green", "Foliage texture:", "medium", "Shape:", "cushion, mound or clump", "Special Considerations", "Tolerates:", "frost - Tolerates moderate frost", "Special characteristics:", "native to North America - Native to western North America from British Columbia to Mexico.", "Special uses:", "edible flowers - Unlike most cool-season salad greens, claytoniamaintains flavor and quality even when in flower. Hot weather turns itbitter.", "edible landscaping - Low-growing, cool-season salad green with dark green foliage and small white flowers.", "Growing Information", "How to plant:", "Propagate by  seed", "Germination temperature: 50 F to 55 F", "Days to emergence: 7 to 10", "Seed can be saved 5 years.", "Maintenance and care:", "4 to 6 weeks before last spring frost, direct seed ¼ inch deep, ½ inch apart in rows 8 to 12 inches apart.", "Make succession plantings from early to midspring.  Resume plantings in late summer to midfall for fall and winter harvest.", "Thin to 2 to 3 inches if harvesting cut-and-come-again style, or 4 to 6 inches if harvesting leaves individually.", "Unlike most greens, claytonia maintains flavor and quality even when plants flower.  Flavor turns bitter in hot weather.", "Plants may overwinter in Zone 6 and warmer.  Can be grown as a winter crop in a cold frame in Zones 4 and 5.", "Varieties", "Browse", "claytonia varieties", "at our", "Vegetable Varieties for Gardeners", "website.", "Cultivated plants are essentially unimproved from those found in the wild.", "©2006", "Cornell University", ". All rights reserved."], "Image_Url": "https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2Ftse1.mm.bing.net%2Fth%3Fid%3DOIP.h3-UYrAiLBzj62zZ6IfGBAHaFj%26pid%3DApi&f=1"}, "Collards": {"Sunlight Conditions": "full sun", "Plant Lifecycle": "annual", "Plant Care Difficulty": "easy", "Height": "1.5 to 3 feet", "Spread": "1 to 2 feet", "Optimal Germination Temperature": "45 F to 85 F       - Will germinate at soil temperatures as low as 40 F.", "Time to Germination": "Days to emergence: 4 to 7", "Soil Depth": "3 Inches", "Full Summary": ["Collards", "Vegetable (Cool Season) - Cabbage Family", "Brassica oleracea var. acephala (collards)", "Brassicaceae Family", "The flavor of this traditional Southern potherb is improved by frost.Very cold hardy (harvest can continue right through snow), collards arealso among the most heat tolerant of cole crops.", "Site and Plant Characteristics", "Growing Information", "Varieties", "Site Characteristics", "Sunlight:", "full sun", "Prefers full sun in spring, but can benefit from light shade during hot weather.", "Soil conditions:", "requires well-drained soil", "Prefers well-drained, fertile soil high in organic matter, pH 6.0 to7.5. Can tolerate slightly alkaline soil. Prefers plentiful, consistentmoisture. Can tolerate drought, but quality and flavor of leavessuffer.", "Plant Traits", "Lifecycle:", "annual", "Biennial grown as an annual.", "Ease-of-care:", "easy", "Height:", "1.5 to 3 feet", "Spread:", "1 to 2 feet", "Foliage color:", "medium green", "dark green", "Some varieties have blue-green cast.", "Foliage texture:", "coarse", "medium", "Shape:", "cushion, mound or clump", "upright", "Asplants mature and lower leaves are harvested, plants begin to look lesslike a clump and start to resemble small palm trees with a cluster ofleaves at the top of a long stem.", "Special Considerations", "Tolerates:", "frost - Flavor improved when plants are “kissed” by frost.", "Special uses:", "edible landscaping", "Growing Information", "How to plant:", "Propagate by  seed", "Germination temperature: 45 F to 85 F - Will germinate at soil temperatures as low as 40 F.", "Days to emergence: 4 to 7", "Seed can be saved 4 years.", "Maintenance and care:", "Direct seed about three months before expected fall frost. Plant seeds¼ to ½ inch deep, 1 inch apart in rows 18 to 30 inches apart. Thin to12- to 18-inch spacings. Eat or transplant thinnings.", "Forspring crops, start plants inside about 8 weeks before the last frost,and transplant when they are about 6 weeks old. Set transplants 12inches apart, rows 18 to 24 inches apart.", "Plant direct-seeded crops 1/2 inch deep and 3 inches apart 3 weeks before last frost.  Thin to 12 to 18 inches apart.", "Mulch overwintering plants.", "Collardsdon't seem to be as troubled by pests as most other cole crops. Usefloating row covers to help protect from early insect infestations.", "To help reduce disease, do not plant collards or other cole crops in the same location more than once every three or four years.", "Pests:", "Cutworm", "Cabbage loopers", "Cabbageworms", "Flea beetles", "Cabbage root maggots", "Cabbage aphids", "Slugs and snails", "Nematodes", "Usually not as susceptible to pest damage as other cole crops.", "Diseases:", "Clubroot", "Black rot", "Black leg", "Alternaria", "To help reduce disease, do not plant kale or other cole crops in the same location more than once every three or four years.", "Varieties", "Browse", "collards varieties", "at our", "Vegetable Varieties for Gardeners", "website.", "Choices are usually limited in seed catalogs.  Some varieties form loose heads.", "Some varieties recommended for New York include:", "Champion", "Blue Max -- hybrid", "Georgia Green", "©2006", "Cornell University", ". All rights reserved."], "Image_Url": "https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2Ftse1.mm.bing.net%2Fth%3Fid%3DOIP.wkoBZ916eQWsZYIKBrrPMgHaE8%26pid%3DApi&f=1"}, "Sweet corn": {"Sunlight Conditions": "full sun", "Plant Lifecycle": "annual", "Plant Care Difficulty": "moderately difficult", "Height": "4 to 6 feet", "Spread": "1 to 1.5 feet", "Optimal Germination Temperature": "65 F to 85 F       - Will not germinate below 55 F", "Time to Germination": "Days to emergence: 4 to 7       - Supersweet hybrids require more moisture and often take longer to germinate.", "Soil Depth": "3 Inches", "Full Summary": ["Sweet corn", "Vegetable (Warm Season) - Other", "Zea mays", "Gramineae Family", "Corn demands fertile soil, consistent moisture and warm weather. If youhave those and plenty of garden space to spare, it’s not hard to growgreat-tasting corn, and you won’t get it any fresher.", "Site and Plant Characteristics", "Growing Information", "Varieties", "Site Characteristics", "Sunlight:", "full sun", "Soil conditions:", "requires high fertility", "Needs deep, well-drained, fertile soil, pH 6.0 to 6.8 and consistent, plentiful moisture.", "Plant Traits", "Lifecycle:", "annual", "Tender annual", "Ease-of-care:", "moderately difficult", "Requires excellent soil and consistent moisture.  Otherwise, it’s not difficult to grow.", "Height:", "4 to 6 feet", "Spread:", "1 to 1.5 feet", "Foliage color:", "medium green", "Foliage texture:", "medium", "Shape:", "upright", "Special Considerations", "Special characteristics:", "native to North America - Probably first domesticated in southern or central Mexico.", "Growing Information", "How to plant:", "Propagate by  seed", "Germination temperature: 65 F to 85 F - Will not germinate below 55 F", "Days to emergence: 4 to 7 - Supersweet hybrids require more moisture and often take longer to germinate.", "Seed can be saved 2 years.", "Maintenance and care:", "Corn requires rich, fertile soil. Add compost or well rotted manure infall. Consider planting a legume cover crop the season before corn tohelp meet the nutrient needs of this heavy feeder.", "Makefirst planting after last frost date. Soil should be at least 65 F forfast germination. (Corn will not germinate if soil temperature is lessthan 55 F.) To speed increase in soil temperature, consider coveringsoil with black plastic for several weeks before planting.", "Plantin blocks of at least 4 rows of a single hybrid (as opposed to fewer,longer rows) for good pollination and well-filled ears. (Some cornvarieties need to be isolated from others. See variety informationbelow.)", "Plant seeds 1 inch deep and 4 to 6 inches apart in rows30 to 36 inches apart. Thin to 8- to 12-inch spacings when plants are 3to 4 inches tall. Increase seeding rates to ensure a good stand ifsoils are cold or you are using seed that has not been treated withfungicide. (Untreated seed has natural color. Treated seed is dyed.)", "Fora sequential harvest, make first planting using an early hybrid. Twoweeks later, plant another block of an early hybrid, plus blocks ofmid- and late-season hybrids. Continue making plantings until lateJune, depending on the length of your growing season.", "To save space, you can intercrop corn with early-harvested cool-season crops.", "Cornplants have many roots close to the surface, so cultivate around themwith care. You can hill soil up around the base of plants as they growto bury small weeds in the row and give the corn a better foothold.After the soil has warmed, you can mulch corn to help suppress weedsand retain moisture.", "It is not necessary to remove suckers (sidesprouts growing from the base of the plant). Studies show that removingthem may actually reduce yields.", "Corn is a heavy feeder -particularly of nitrogen - and may require several sidedressings offertilizer for best yields. Look for signs of nutrient deficiency.Purple-tinged leaves are a sign of phosphorus deficiency. Pale greenleaves are a sign of nitrogen deficiency.", "For miniature or babycorn, plant seeds 2 to 4 inches apart and harvest as silks emerge fromthe ear, or harvest secondary ears from normally spaced plantings,allowing the main ear to fully mature. Also try hybrids specificallybred for early baby corn harvest.", "Pests:", "European corn borer, corn earworms - Destroy cornstalks in fall to killoverwintering larvae of European Corn Borer. Plant early to avoid cornearworm.", "Seedcornmaggots - Avoid heavy manure or organic matter in garden, which attractadults and encourage egg laying. Do not overwater. Useinsecticide-treated seed. Wear gloves when planting.", "Diseases:", "Rust - Avoid wetting foliage if possible. Water early in the day soaboveground plant parts will dry as quickly as possible. Avoid crowdingplants. Space apart to allow air circulation. Plant resistant oftolerant varieties: Top Notch, Temptation, Sweet Rhythm, Wizard, SweetSymphony, Silverado. Standards like Sweet Sue and Silver Queen are verysusceptible.", "Smut- Pick and remove galls before they break open. Plant tolerantvarieties: Top Notch, Temptation, Sweet Rhythm, Sweet Symphony, Zenith.", "Varieties", "Browse", "corn varieties", "at our", "Vegetable Varieties for Gardeners", "website.", "Virtuallyall varieties on the market are hybrids. It is difficult to maintainvigor and sweetness in open-pollinated varieties.", "Look fordifferences in kernel color (white, yellow, bicolor), ear size,sweetness (explained below) and days to harvest - early (55 to 70days), midseason (71 to 85 days) and late (more than 85 days). Days tomaturity are only estimates, and will vary considerably depending ongrowing conditions, most notably heat.", "Sweet corn hybrids come in different levels of sweetness:", "Normal", "(su) - These hybrids are flavorful, stress-tolerant, and vigorousgrowers. But they aren’t as sweet as other hybrids and their sugarstarts turning to starch quickly after picking. Hence the tradition ofgetting the water boiling before picking and shucking them.", "Sugar-enhanced", "(se, se+, EH, Everlasting Heritage) - Fall between normal andsupersweet hybrids in terms of vigor, stress tolerance, flavor,sweetness, and how quickly their sugar changes to starch. They do notneed to be isolated from normal hybrids.", "Supersweet", "(sh2,shrunken) - These hybrids contain two to three times more sugar thannormal hybrids, and the sugar in their kernels changes to starch veryslowly after harvest. But they aren’t as vigorous as normal hybrids,are more easily stressed by cold and other problems, and often lack thecorny flavor or normal hybrids. They must also be isolated from Normaland Sugar-enhanced varieties pollinating within 10 to 14 days by atleast 25 feet (250 feet for larger commercial plantings), or thekernels will be tough and starchy.", "Other improved genetics", "- In recent years, corn breeders have come up with a host of othervarieties that are often different combinations of these three basictypes. They include Synergistic types (Sweet Breeds, TripleSweets),Augmented types (Gourmet Sweet Brand, Multisweet, Xtra-Tender Brand),Table Sweet, and more.", "Figuring out which of these varietiesneed isolation from others can be complicated. Look to your seedcompany for specific information, but in general, keep su and se typesisolated from sh2 types:", "su and se types:", "Normal (su)", "Sugar-enhanced (se, se+ EH)", "Synergistic types (Sweet Breeds, Triple Sweet)", "Table Sweet", "sh2 types:", "Supersweet (sh2, shrunken)", "Augmented (Gourmet Sweet Brand, Multisweet, Xtra-Tender Brand)", "Mirai", "Ifyou plan to grow corn in the traditional “Three Sisters” planting ofcorn, beans and squash, choose another type of corn that you won’tharvest until the ears are fully mature and dry. These include popcorn,ornamental corn or field corn (dent, flint and flour corns grown formeal or animal feed). That way, you won’t have to walk on squash vinesor disturb climbing beans harvesting sweet corn while the other cropsare still growing.", "Broom corn - traditionally used for making brooms - is a different species,", "Sorghum bicolor", ".", "Miniatureor baby corn can be grown from regular hybrids or those developedspecifically for early harvest. See Growing Information.", "Some varieties recommended for New York:", "Early sweet corn:", "Fleet", "Geronimo", "Jester (II)", "Seneca Spring", "Sundance", "Sugar Buns", "Temptation", "Trinity", "Midseason sweet corn:", "Jubilee", "Precious Gem", "Silverado", "Tuxedo", "Late Season sweet corn:", "Bodacious", "Delectable", "Sensor", "Silver Queen", "Sugar Ace", "Super-sweet:", "Northern Extra Sweet", "Popcorn:", "Mini Bluepopper", "©2006", "Cornell University", ". All rights reserved."], "Image_Url": "https://duckduckgo.com/i/1e52cf69.jpg"}, "Garden cress": {"Sunlight Conditions": "full sun", "Plant Lifecycle": "annual", "Plant Care Difficulty": "easy", "Optimal Germination Temperature": "55 F to 75 F", "Time to Germination": "Days to emergence: 2 to 7       - In early spring when soils are cold (~45 F), germination may take two weeks.", "Soil Depth": "3 Inches", "Full Summary": ["Garden cress", "Vegetable (Cool Season) - Salad Greens", "Also known as Peppergrass, Pepper cress, Mustard cress", "Lepidium sativum", "Brassicaceae Family", "The easiest of the cresses to grow, garden cress can be harvested in aslittle as two weeks after sowing. It’s peppery taste adds zing tosalads, but hot weather makes this cool-season crop bitter andinedible.", "Site and Plant Characteristics", "Growing Information", "Varieties", "Site Characteristics", "Sunlight:", "full sun", "part shade", "Prefers part shade during hot summer weather.", "Soil conditions:", "requires well-drained soil", "Prefers moist, fertile soil with high organic matter and pH 6.0 to 6.7", "Special locations:", "outdoor containers - Good for windowsill gardens in winter.", "Plant Traits", "Lifecycle:", "annual", "Ease-of-care:", "easy", "Flower color:", "white", "Foliage color:", "medium green", "dark green", "Foliage texture:", "medium", "fine", "Curly cress leaves have ruffled edges resembling parsley", "Shape:", "cushion, mound or clump", "Special Considerations", "Tolerates:", "frost", "Special characteristics:", "not native to North America - Native to Egypt and Middle East.  Cultivated in Persia around 400 B.C.", "Special uses:", "edible landscaping", "Growing Information", "How to plant:", "Propagate by  seed", "Germination temperature: 55 F to 75 F", "Days to emergence: 2 to 7 - In early spring when soils are cold (~45 F), germination may take two weeks.", "Seed can be saved 5 years.", "Maintenance and care:", "Plant in early spring as soon as you can work the soil. Broadcast seedand cover very lightly with soil or compost. A small patch (1- to2-feet square) provides plenty of cress.", "Make succession plantings every 2 to 3 weeks until weather warms.  Start planting fall crops when weather cools in late summer.", "You can intercrop cress with carrots or radishes, or mix it with other salad green crops.", "Keep cress well watered and provide shade when weather warms.", "Cover with fabric row covers if flea beetles or other pests are a problem.", "Pests:", "Flea beetles - Use row covers to help protect plants from early damage.Put in place at planting and remove when temperatures get too hot.Control weeds.", "Varieties", "Browse", "cress varieties", "at our", "Vegetable Varieties for Gardeners", "website.", "Broadleaf cress has flat leaves and is best for salads.", "Curly cress has leaves that resemble parsley.", "©2006", "Cornell University", ". All rights reserved."], "Image_Url": "https://duckduckgo.com/i/dfc793f9.jpg"}, "Cutting chicory": {"Sunlight Conditions": "full sun", "Plant Lifecycle": "annual", "Plant Care Difficulty": "easy", "Height": "1 to 1.6 feet", "Spread": "0.5 to 1 feet", "Optimal Germination Temperature": "45 F to 85 F", "Time to Germination": "Days to emergence: 7 to 10", "Soil Depth": "3 Inches", "Full Summary": ["Cutting chicory", "Vegetable (Cool Season) - Salad Greens, Vegetable (Warm Season) - Salad Greens", "Also known as Italian dandelion, leaf chicory, spring chicory, rosette chicory", "Cichorium intybus (Cutting chicory)", "Compositae Family", "This bitter Italian green grows quickly, with immature leaves ready toharvest in just 3 to 5 weeks. Prefers cool weather but will producegreens throughout the season.", "Site and Plant Characteristics", "Growing Information", "Varieties", "Site Characteristics", "Sunlight:", "full sun", "part shade", "Soil conditions:", "requires well-drained soil", "Tolerates a wide range of soils, but prefers well-drained, rich soil,high in organic matter, pH 6.0 to 7.5 and consistent, plentifulmoisture.", "Plant Traits", "Lifecycle:", "annual", "Biennial grown as an annual.", "Ease-of-care:", "easy", "Height:", "1 to 1.6 feet", "Spread:", "0.5 to 1 feet", "Flower color:", "blue", "If allowed to go to seed, produces flowers similar to the familiar “wild” chicory.", "Foliage color:", "medium green", "Some varieties have white midribs or are tinged with red.", "Foliage texture:", "medium", "Shape:", "cushion, mound or clump", "Special Considerations", "Tolerates:", "frost", "Special characteristics:", "not native to North America - Native to Eurasia and North Africa", "Special uses:", "edible landscaping", "Growing Information", "How to plant:", "Propagate by  seed", "Germination temperature: 45 F to 85 F", "Days to emergence: 7 to 10", "Seed can be saved 5 years.", "Maintenance and care:", "Direct seed or transplant anytime from early spring to 3 months before first fall frost.  Space plants 6 to 8 inches apart.", "Harvest individual leaves or cut whole plants.  Cut back plants when flower stalks form.  Plants will regrow.", "For a milder flavor, blanch by covering plants with a bucket or flower pot.", "Mulch plants heavily after frost to help overwinter.  Remove mulch and cut back plants in spring.", "Varieties", "Browse", "cutting chicory varieties", "at our", "Vegetable Varieties for Gardeners", "website.", "©2006", "Cornell University", ". All rights reserved."], "Image_Url": "https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2Ftse1.mm.bing.net%2Fth%3Fid%3DOIP.ejObMlnt9X9bGbOy7Lid9AHaE7%26pid%3DApi%26h%3D160&f=1"}, "Eggplant": {"Sunlight Conditions": "full sun", "Plant Lifecycle": "Tender annual.", "Plant Care Difficulty": "moderately difficult", "Height": "2 to 4 feet", "Spread": "2 to 4 feet", "Optimal Germination Temperature": "60 F to 95 F       - Germinates best between 80 F and 90 F.", "Time to Germination": "Days to emergence: 7 to 10       - At 85 F.", "Full Summary": ["Eggplant", "Vegetable (Warm Season) - Tomatoes, Peppers, Eggplant", "Solanum melongena", "Solanaceae Family", "Dramatic foliage and colorful fruits (white, green and other colors inaddition to the usual deep purple) make this heat-loving annual a goodchoice for ornamental beds as well as vegetable gardens. Needs two ormore months with night-time temperatures near 70 F for good fruitproduction. Test.", "Site and Plant Characteristics", "Growing Information", "Varieties", "Site Characteristics", "Sunlight:", "full sun", "Soil conditions:", "requires well-drained soil", "requires high fertility", "Prefers fertile, well-drained, slightly acid soil that is high inorganic matter for best growth and yield, but tolerates a broader rangeof soil types. Has moderate moisture needs.", "Special locations:", "outdoor containers - Small-fruited and dwarf varieties are best, but all do well in containers.", "Plant Traits", "Lifecycle:", "Tender annual.", "Ease-of-care:", "moderately difficult", "Requires fertile soil and a long, warm growing season.", "Height:", "2 to 4 feet", "Spread:", "2 to 4 feet", "Bloom time:", "mid-summer", "late summer", "Flower color:", "violet", "Relatively inconspicuous, curling down and hidden within foliage.", "Foliage color:", "medium green", "Foliage texture:", "coarse", "Shape:", "upright", "Shape in flower:", "same as above", "Special Considerations", "Special characteristics:", "not native to North America - Native to Asia.  Large-fruited cultivars originated in India.  Smaller-fruited varieties originated in China.", "bearsornamental fruit - In addition to the familiar deep purple, oval,glossy fruits, some varieties produce long, thin fruits or small,ball-shaped fruit. Other colors include white, green and orange.", "Special uses:", "edible landscaping - Dramatic foliage and colorful fruit make eggplants a great vegetable to grow in flower gardens.", "Growing Information", "How to plant:", "Propagate by  seed", "Germination temperature: 60 F to 95 F - Germinates best between 80 F and 90 F.", "Days to emergence: 7 to 10 - At 85 F.", "Seed can be saved 4 years.", "Maintenance and care:", "Start inside about 6 weeks before last frost date (or about 8 weeksbefore expected transplanting). Plant 1/4 inch deep in flats orcell-type containers. Keep soil warm (about 80 F to 90 F if possible)until emergence. Eggplant will not germinate in cool soil.", "Harden off plants carefully before transplanting by reducing temperature and water.", "Waituntil weather has settled, all chance of frost has passed and soil isin the 60s F before transplanting, perhaps 2 to 3 weeks after theaverage last frost date. Cool conditions can weaken plants. Frost willkill them.", "Consider using raised beds or black plastic mulch towarm soil and speed early-season growth. If using organic mulches tohelp retain moisture, do not apply until the soil has warmed.", "Set transplants 18 to 24 inches apart in rows 30 to 36 inches apart.", "Use row covers to protect plants from pests.", "If season is cool, fruit set may be inconsistent.  Plants with heavy fruit set benefit from staking.", "Eggplantsare heavy feeders, but avoid high-nitrogen fertilizers. They mayencourage lush foliage growth at the expense of fruit.", "Pinch offblossoms 2 to 4 weeks before first expected frost so that plantschannel energy into ripening existing fruit, not producing new ones.", "Tohelp reduce disease, do not plant eggplants or other tomato-familycrops in the same location more than once every three or four years.", "Pests:", "Aphids - A hard stream of water can be used to remove aphids fromplants. Wash off with water occasionally as needed early in the day.Check for evidence of natural enemies such as gray-brown or bloatedparasitized aphids and the presence of alligator-like larvae of ladybeetles and lacewings.", "Fleabeetles - Use row covers to help protect plants from early damage. Putin place at planting and remove before temperatures get too hot orplants start to flower.", "Colorado potato beetles - Handpick beetles, larvae and eggs.", "Cutworms - Use cardboard collars around transplants it cutworms are a problem.", "Diseases:", "Verticillium wilt - Most serious disease of eggplant. Set into soilnever planted to tomatoes, peppers, or strawberries. If you cannot,locate new plants in a part of the garden different from previousyear's location, or plant in containers.", "Varieties", "Browse", "eggplant varieties", "at our", "Vegetable Varieties for Gardeners", "website.", "Heat-lovingeggplants may be difficult to grow successfully in cooler regions ofthe state. Look for short-season varieties that will fruit under coolNew York conditions.", "Asian varieties are usually long and thin.  Their skins are often thin enough that they don't need peeling.", "Varieties recommended for New York include:", "Early varieties:", "Ichiban", "Dusky", "Little Fingers", "Midseason varieties:", "Black Beauty", "Classic", "Ghostbuster", "Neon", "©2006", "Cornell University", ". All rights reserved."], "Image_Url": "https://duckduckgo.com/i/6d079b67.jpg"}, "Egyptian onions": {"Sunlight Conditions": "full sun", "Plant Lifecycle": "perennial", "Plant Care Difficulty": "easy", "Height": "2 to 3 feet", "Spread": "0.5 to 2 feet", "Soil Depth": "Up to 24 Inches", "Full Summary": ["Egyptian onions", "Vegetable (Cool Season) - Onion Family", "Also known as tree onions, multiplier onions (topset), walking onions", "Allium cepa var. proliferum", "Alliaceae Family", "Similar to shallots - but with a much stronger flavor - this perennialallium produces numerous bulbs below ground, and as a bonus formsclusters of sets for replanting on its stalk.", "Site and Plant Characteristics", "Growing Information", "Varieties", "Site Characteristics", "Sunlight:", "full sun", "part shade", "Soil conditions:", "requires well-drained soil", "Well-drained, average fertility, high in organic matter, neutral pH.Optimum pH is 6.2 to 6.8. Requires plentiful, even moisture for goodyields.", "Hardiness zones:", "5 to 9", "Plant Traits", "Lifecycle:", "perennial", "Ease-of-care:", "easy", "Height:", "2 to 3 feet", "Spread:", "0.5 to 2 feet", "Foliage color:", "medium green", "Foliage texture:", "medium", "Shape:", "upright", "Special Considerations", "Tolerates:", "frost", "Special characteristics:", "not native to North America - Middle East origin", "Special uses:", "edible landscaping", "Growing Information", "How to plant:", "Propagate by  division or separation  - Divide clumps in late summer and/or plant bulblets that form on stalk.  Rarely produces seed.", "Maintenance and care:", "Plant bulblets that form on stalk in summer, or allow them to self-sow.", "Mulch plantings to prevent heaving in winter.", "Divide mother plant every few years.", "Pests:", "Slugs", "Varieties", "Browse", "Egyptain onion varieties", "at our", "Vegetable Varieties for Gardeners", "website.", "©2006", "Cornell University", ". All rights reserved."], "Image_Url": "https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2Ftse1.mm.bing.net%2Fth%3Fid%3DOIP.Bp1cD-ey2O27mGe20ZdXAwHaJ3%26pid%3DApi&f=1"}, "Belgian endive": {"Sunlight Conditions": "full sun", "Plant Lifecycle": "annual", "Plant Care Difficulty": "difficult", "Height": "1 to 1.5 feet", "Spread": "0.5 to 1 feet", "Optimal Germination Temperature": "45 F to 85 F       - 70 F to 75 F is optimum.", "Time to Germination": "Days to emergence: 7 to 10", "Soil Depth": "3 Inches", "Full Summary": ["Belgian endive", "Vegetable (Cool Season) - Salad Greens", "Also known as witloof chicory, white endive", "Cichorium intybus (Belgian endive)", "Compositae Family", "Grow the roots like carrots during summer. (They can be ground for acoffee substitute.) Harvest and store for forcing gourmet “chicons” - 4to 6-inch spindle-shaped heads or buds -- for winter salads.", "Site and Plant Characteristics", "Growing Information", "Varieties", "Site Characteristics", "Sunlight:", "full sun", "Plant Traits", "Lifecycle:", "annual", "A biennial grown for first-year roots (chicons) which are forced in darkness to produce edible heads.", "Ease-of-care:", "difficult", "Requires excellent soil, long growing season, care at harvest and skill and facilities to force roots.", "Height:", "1 to 1.5 feet", "Spread:", "0.5 to 1 feet", "Foliage color:", "medium green", "Foliage texture:", "medium", "Shape:", "cushion, mound or clump", "Special Considerations", "Tolerates:", "frost", "Special characteristics:", "not native to North America", "Growing Information", "How to plant:", "Propagate by  seed", "Germination temperature: 45 F to 85 F - 70 F to 75 F is optimum.", "Days to emergence: 7 to 10", "Seed can be saved 5 years.", "Maintenance and care:", "Direct-seed in early spring, spacing plants 4 to 6 inches apart in rows18 to 24 inches apart. Grow and harvest as you would root crops such ascarrots. Harvest for forcing around first fall frost. Do not delayharvest or forced roots will bolt.", "Storein damp sand or sawdust near freezing (32 F to 35 F). When ready toforce, rebury upright in soil, sand, sawdust or other media and move todark, cool (50 F to 60 F), humid location with good air circulation.Keep media moist but not too wet. “Chicons” should be ready for harvestin 3 to 4 weeks.", "Varieties", "Browse", "Belgian endive varieties", "at our", "Vegetable Varieties for Gardeners", "website.", "Lookfor early varieties that are ready for forcing earlier than mid-seasonvarieties, which usually have better yields. Late varieties withstandcold-storage better.", "Varieties ‘Flash’ and ‘Roelof’ do not require soil for forcing.", "©2006", "Cornell University", ". All rights reserved."], "Image_Url": "https://duckduckgo.com/i/e3d5d9c8.jpg"}, "Endive": {"Sunlight Conditions": "full sun", "Plant Lifecycle": "annual", "Height": "0.5 to 2 feet", "Spread": "0.5 to 2 feet", "Optimal Germination Temperature": "35 F to 85 F       - 75 F is optimal", "Time to Germination": "Days to emergence: 5 to 7", "Soil Depth": "3 Inches", "Full Summary": ["Endive", "Vegetable (Cool Season) - Salad Greens", "Also known as escarole, frisee", "Cichorium endiva (Endive)", "Compositae Family", "Flat-leaved varieties are known as escarole, these cool-season greensare known for their sharp, bitter taste. More tolerant of heat and coldthan lettuce, frilly-leaved endive makes an attractive addition toornamental plantings.", "Site and Plant Characteristics", "Growing Information", "Varieties", "Site Characteristics", "Sunlight:", "full sun", "part shade", "Partial shade beneficial in hot weather.", "Special locations:", "outdoor containers", "Plant Traits", "Lifecycle:", "annual", "Biennial grown as an annual.", "Height:", "0.5 to 2 feet", "Spread:", "0.5 to 2 feet", "Special Considerations", "Tolerates:", "frost - Light frost in fall enhances flavor.", "Special characteristics:", "not native to North America - Mediterranean origin", "Growing Information", "How to plant:", "Propagate by  seed", "Germination temperature: 35 F to 85 F - 75 F is optimal", "Days to emergence: 5 to 7", "Seed can be saved 5 years.", "Maintenance and care:", "Like lettuce and other cool-season greens, endive needs short days and cool temperatures.", "Directseed ¼-inch deep in rows 18 inches apart 2 to 4 weeks before averagelast frost. Make succession plantings for continuous harvest. Thin to 8to 12 inches.", "For extra-early crops, start seed inside 6 to 8weeks before last frost. Transplant into garden about 2 weeks beforelast frost.", "To prevent plants from going to seed (bolting), keepthem well-watered and shaded when temperatures are above 75 F. Mulch toretain moisture and suppress weeds.", "For fall harvests, direct seed in garden about 2 to 3 months before expected fall frost.  Light frost enhances flavor.", "Blanchheading varieties for a milder flavor. A week or so before harvest,pull outer leaves over head and tie. Make sure leaves are dry to avoidrot. Other blanching alternatives include placing a flower pot over theplant, or covering with a cardboard disk or plastic container.Self-blanching varieties are available. Close plant spacing (about 8inches) encourages self-blanching.", "Pests:", "Aphids", "Varieties", "Browse", "common endive varieties", "at our", "Vegetable Varieties for Gardeners", "website.", "“Curlyleaved” endive varieties have heavily curled, deeply toothed leavesthat form rosettes. The leaves can hold water, making these varietiesprone to leaf diseases, especially in fall-harvested plantings.", "“Flat-leaved”endive varieties, called escarole, have leaves that are broader,flatter, and only slightly crumpled, and so are not as prone todiseases. They also form loose heads, are hardier, and are more tenderand milder tasting than curly endive.", "Do not confuse these crops with Belgian endive, a member of the same genus which is grown for its roots and forced tops.", "Forspring plantings, look for slow-bolting varieties that can withstandthe heat of early summer longer before going to seed (bolting).", "Some heirloom varieties have purplish-red leaves.", "Some varieties recommended for New York include:", "Florida Deepheart", "Full Heart Bavarian", "Green Curled", "Rhodus (Tres Fine) - hybrid", "©2006", "Cornell University", ". All rights reserved."], "Image_Url": "https://duckduckgo.com/i/e3d5d9c8.jpg"}, "Garlic": {"Sunlight Conditions": " Easy to grow and productive - a pound of cloves can produce 7 to 10 pounds of garlic - the “stinking rose” needs rich, well-drained soil, full sun and excellent weed control. ", "Plant Lifecycle": "annual", "Plant Care Difficulty": "easy", "Height": "1 to 2 feet", "Spread": "0.5 to 1 feet", "Soil Depth": "3 Inches", "Full Summary": ["Garlic", "Vegetable (Cool Season) - Onion Family", "Allium sativum var. sativum and ophiosco", "Alliaceae Family", "Synonym:", "Allium ampeloprasum", "Easy to grow and productive - a pound of cloves can produce 7 to 10pounds of garlic - the “stinking rose” needs rich, well-drained soil,full sun and excellent weed control.", "Site and Plant Characteristics", "Growing Information", "Varieties", "Site Characteristics", "Sunlight:", "full sun", "Soil conditions:", "requires well-drained soil", "requires high fertility", "Well-drained, fertile, with plenty of organic matter. Slightly drysites preferable. Tolerates wide pH range but prefers slightly acidsoil (6.2 to 6.8).", "Plant Traits", "Lifecycle:", "annual", "Perennial grown as an annual.  (Fall-planted, harvested the following summer.)", "Ease-of-care:", "easy", "Easy if you have rich well-drained soil and good weed control.", "Height:", "1 to 2 feet", "Spread:", "0.5 to 1 feet", "Foliage color:", "medium green", "Foliage texture:", "medium", "Shape:", "upright", "Shape in flower:", "same as above", "Special Considerations", "Tolerates:", "frost", "Special characteristics:", "not native to North America", "Special uses:", "edible flowers", "Growing Information", "How to plant:", "Propagate by division or separation - Cloves must be exposed totemperatures below 65 F or they may fail to form bulbs when planted.Plants may produce flowers, but they are usually sterile.", "Maintenance and care:", "Garlic prefers cool weather when developing foliage, and warm weatherwhen bulbs enlarge. Fall plantings take about 8 months to mature.", "Choosea weed-free, well-drained location. Raised beds are ideal. Do not plantwhere other onion family crops have been grown in the past 3 years.", "InNew York, plant from about the time of first fall frost to earlyNovember. If your soil is loose and well-prepared, you can plant invery early spring, but fall plantings usually yield more.", "Usingcloves from the supermarket is not recommended. They may carry diseasesor have been treated to discourage sprouting. Most are also fromvarieties that are not well-adapted to New York's climate. Purchasebulbs from mail order suppliers, garden center, or other local source.", "Breakbulbs apart at planting time, keeping papery husks on the individualcloves. Plant with tips up, 2 inches deep and 4 to 6 inches apart inrows 15 to 24 inches apart. Plant elephant garlic varieties about 3inches deep and 8 to 12 inches apart.", "Mulch heavily afterplanting to prevent soil heaving - particularly with less-hardyelephant garlic varieties. Roots will begin to grow even thoughtopgrowth may not be evident in late fall and winter. Remove mulch inspring, leaving only what is needed to suppress weeds.", "For larger bulbs, remove woody flower stalks (scapes) as they appear.  Bulblets at top of scape can be used in cooking.", "Plantlarge cloves to produce the largest bulbs. Plant smaller cloves atcloser spacings or in patches for harvest as garlic greens. Savelargest bulbs for planting your next crop.", "Pests:", "Expect few or no insect problems.", "Diseases:", "Bulbs may rot in heavy, wet soils. Otherwise, few serious diseaseproblems. Do not plant where other onion family crops have been grownin the past 3 years.", "Varieties", "Browse", "garlic varieties", "at our", "Vegetable Varieties for Gardeners", "website.", "Softneck varieties", "(", "Allium sativum", "var.", "sativum", "):So called because their necks stay soft at harvest time, so they can bebraided. Produces large cloves around the outside, and smaller clovesin the middle. Strong flavor. Stores well. Less winter-hardy thanstiffnecked varieties. Varieties found in supermarkets are most oftensoftnecks. Includes Silverskin and Artichoke types.", "Stiffneck varieties", "(", "Allium sativum", "var.", "ophioscorodon", "):A single ring of cloves surrounds a stiff central stem that curls as itgrows. Most cold-hardy of the garlics, but doesn’t store as well assoftnecks and has a milder flavor. Cloves are easy to peel. IncludesRocambole, Purple-Striped and Porcelain types.", "Elephant, or great-headed garlic", "(", "Allium ampeloprasum", "):Milder flavor, intermediate between garlic and onions. Larger bulb withfewer larger cloves (usually about four). More closely related to leeksthan to", "A. sativum", "garlics, and not as hardy.", "©2006", "Cornell University", ". All rights reserved."], "Image_Url": "https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2Ftse4.mm.bing.net%2Fth%3Fid%3DOIP.STQgR1_xlV_9fp-U_3UKGgHaFK%26pid%3DApi&f=1"}, "Kale": {"Sunlight Conditions": "full sun", "Plant Lifecycle": "annual", "Plant Care Difficulty": "easy", "Height": "1.5 to 3 feet", "Spread": "1 to 3 feet", "Optimal Germination Temperature": "45 F to 85 F       - Will germinate at soil temperatures as low as 40 F.", "Time to Germination": "Days to emergence: 4 to 7", "Soil Depth": "3 Inches", "Full Summary": ["Kale", "Vegetable (Cool Season) - Cabbage Family", "Brassica oleracea var. acephala (Kale)", "Brassicaceae Family", "The tender young leaves from these fast-growing plants can be eatenraw, or cooked for soup or stir fries. Very cold hardy, harvest cancontinue right through snow. Many colored varieties are a fine additionto ornamental plantings as well as spectacular garnishes.", "Site and Plant Characteristics", "Growing Information", "Varieties", "Site Characteristics", "Sunlight:", "full sun", "part shade", "Prefers full sun in spring and fall, but can benefit from light shade during hot weather.", "Soil conditions:", "requires well-drained soil", "Prefers well-drained, fertile soil high in organic matter, pH 6.0 to7.5. Can tolerate slightly alkaline soil. Prefers plentiful, consistentmoisture. Can tolerate drought, but quality and flavor of leavessuffer.", "Plant Traits", "Lifecycle:", "annual", "Biennial grown as an annual.", "Ease-of-care:", "easy", "Height:", "1.5 to 3 feet", "Spread:", "1 to 3 feet", "Foliage color:", "light green", "medium green", "dark green", "red", "purple", "Depends on variety.", "Foliage texture:", "coarse", "medium", "fine", "Dependson variety. Those with savoyed leaves tend toward the fine end of thespectrum. Older plants with smooth leaves can be coarse.", "Shape:", "cushion, mound or clump", "upright", "Asplants mature and lower leaves are harvested, plants begin to look lesslike a clump and start to resemble small palm trees with a cluster ofleaves at the top of a long stem.", "Special Considerations", "Tolerates:", "frost - Flavor improved when plants are “kissed” by frost.", "Special characteristics:", "not native to North America - Not known in the wild.  Descended from wild Mediterranean kale.", "Special uses:", "edible landscaping", "Growing Information", "How to plant:", "Propagate by  seed", "Germination temperature: 45 F to 85 F - Will germinate at soil temperatures as low as 40 F.", "Days to emergence: 4 to 7", "Seed can be saved 4 years.", "Maintenance and care:", "Direct seed about three months before expected fall frost. Plant seeds¼ to ½ inch deep, 1 inch apart in rows 18 to 30 inches apart. Thin to12- to 18-inch spacings. Eat or transplant thinnings.", "Similarto cabbage and other cole crops, you can also set out transplants inspring 4 to 6 weeks before average last frost, 12 inches apart, rows 18to 24 inches apart.", "Doesn't seem to be as troubled by pests asmost other cole crops. Use floating row covers to help protect fromearly insect infestations.", "To help reduce disease, do not plant kale or other cole crops in the same location more than once every three or four years.", "Pests:", "Cutworm", "Cabbage loopers", "Cabbageworms", "Flea beetles", "Cabbage root maggots", "Cabbage aphids", "Slugs and snails", "Nematodes", "Usually not as susceptible to pest damage as other cole crops.", "Diseases:", "Clubroot", "Black rot", "Black leg", "Alternaria", "To help reduce disease, do not plant kale or other cole crops in the same location more than once every three or four years.", "Varieties", "Browse", "kale varieties", "at our", "Vegetable Varieties for Gardeners", "website.", "Lookfor different colors, days to harvest. Some varieties have curly orsavoyed leaves resembling parsley. Colorful ornamental varieties tendto be less flavorful.", "Red Russian kale is a different species,", "Brassica napus var. pabularia", ", but cultivated similarly.", "Some varieties recommended for New York include:", "Dwarf Green Curled", "Vates Blue Curled", "Winterbor", "Red Russian", "©2006", "Cornell University", ". All rights reserved."], "Image_Url": "https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2Ftse1.mm.bing.net%2Fth%3Fid%3DOIP.eBAy5nnA0bZ04Eit2r01UwHaE8%26pid%3DApi&f=1"}, "Kohlrabi": {"Sunlight Conditions": "full sun", "Plant Lifecycle": "annual", "Plant Care Difficulty": "easy", "Height": "1 to 1.5 feet", "Spread": "1 to 1.5 feet", "Optimal Germination Temperature": "45 F to 85 F       - Will germinate at soil temperatures as low as 40 F.", "Time to Germination": "Days to emergence: 4 to 7", "Soil Depth": "3 Inches", "Full Summary": ["Kohlrabi", "Vegetable (Cool Season) - Cabbage Family", "Brassica oleracea var. gongylodes", "Brassicaceae Family", "This cool-season cole crop produces a turnip-flavored swollen stem inas little as 6 weeks. In addition to spring crops, you can tuck intransplants or sow seeds anywhere space becomes available in summer.The bizarre alien-from-outer-space appearance makes it an eye-stopperin ornamental plantings, too.", "Site and Plant Characteristics", "Growing Information", "Varieties", "Site Characteristics", "Sunlight:", "full sun", "Tolerates light shade.", "Soil conditions:", "requires well-drained soil", "Prefers well-drained, fertile soil high in organic matter, pH 6.0 to7.5. Can tolerate slightly alkaline soil. This heavy feeder also needsplentiful, consistent moisture.", "Special locations:", "outdoor containers", "Plant Traits", "Lifecycle:", "annual", "Biennial grown as an annual.", "Ease-of-care:", "easy", "Height:", "1 to 1.5 feet", "Spread:", "1 to 1.5 feet", "Foliage color:", "medium green", "purple", "Foliage texture:", "medium", "Shape:", "cushion, mound or clump", "Leaves arise from spherical swollen stem.", "Special Considerations", "Tolerates:", "frost - Freezing temperatures may cause plants to bolt.", "Special characteristics:", "not native to North America - Not known in the wild.  Descended from wild European cabbage or kale.", "Special uses:", "edible landscaping", "Growing Information", "How to plant:", "Propagate by  seed", "Germination temperature: 45 F to 85 F - Will germinate at soil temperatures as low as 40 F.", "Days to emergence: 4 to 7", "Seed can be saved 4 years.", "Maintenance and care:", "Prefers cool weather - in the 60s F -- but can be grown throughout theseason in most of New York. Plants are sensitive to cold. Briefexposure to freezing temperatures can cause plants to bolt. A week oftemperatures below 50 can also induce flowering.", "Begindirect-seeding about a month before last frost. Plant about ½ inch deepand 1 inch apart in rows 12 inches apart. Thin to about 6-inch spacings.", "For fall harvest, transplant or direct-seed into garden in summer as space becomes available.", "Pests:", "Cutworm", "Cabbage loopers", "Cabbageworms", "Flea beetles", "Cabbage root maggots", "Cabbage aphids", "Slugs and snails", "Nematodes", "Diseases:", "Clubroot", "Black rot", "Black leg", "Alternaria", "Cabbage yellows", "Varieties", "Browse", "kohlrabi varieties", "at our", "Vegetable Varieties for Gardeners", "website.", "Choose from different days to maturity (about 40 to 60) and color (white, pale green or purple).", "Varieties recommended for New York include:", "Early Purple Vienna", "Early White Vienna", "Eden", "Grand Duke", "©2006", "Cornell University", ". All rights reserved."], "Image_Url": "https://duckduckgo.com/i/2a33b0cf.jpg"}, "Leeks": {"Sunlight Conditions": "full sun", "Plant Lifecycle": "annual", "Plant Care Difficulty": "moderately difficult", "Height": "2 to 3 feet", "Spread": "0.5 to 1 feet", "Optimal Germination Temperature": "45 F to 95 F       - Peak germination around 77 F.", "Time to Germination": "Days to emergence: 5 to 7", "Soil Depth": "3 Inches", "Full Summary": ["Leeks", "Vegetable (Cool Season) - Onion Family", "Allium ampeloprasum", "Alliaceae Family", "Milder flavored than most other onion-family crops, you can mulch long-season varieties in fall for winter and spring harvest.", "Site and Plant Characteristics", "Growing Information", "Varieties", "Site Characteristics", "Sunlight:", "full sun", "part shade", "Soil conditions:", "requires well-drained soil", "requires high fertility", "Well-drained, rich soil, high in organic matter.  Optimum pH is 6.2 to 6.8.  Requires plentiful, even moisture for good yields.", "Plant Traits", "Lifecycle:", "annual", "Biennial grown as an annual.", "Ease-of-care:", "moderately difficult", "Height:", "2 to 3 feet", "Spread:", "0.5 to 1 feet", "Foliage color:", "medium green", "dark green", "Long-season varieties have a dark, bluish-green color.", "Foliage texture:", "medium", "Shape:", "upright", "fan-shaped", "Special Considerations", "Tolerates:", "frost - More frost-tolerant than other cultivated onions.", "Special characteristics:", "not native to North America - Cultivated in Egypt more than 4,000 years ago.", "Special uses:", "edible landscaping", "Growing Information", "How to plant:", "Propagate by  seed", "Germination temperature: 45 F to 95 F - Peak germination around 77 F.", "Days to emergence: 5 to 7", "Seed can be saved 3 years.", "Maintenance and care:", "Choose a weed-free, well-drained location. Raised beds are ideal. Leeksare good for intercropping with other garden plants, especiallyearly-maturing spring greens. Do not plant where other onion familycrops have been grown in the past 3 years.", "You can direct-seed leeks, or start transplants indoors.  Long-season varieties are best started indoors.", "Starttransplants about 8 to 10 weeks before last frost date. Sow seeds inflats about ¼ inch apart and ½ inch deep. Transplant to cell-typecontainers when they are about 2 inches tall. If you skip this step andcontinue growing in open flats, simply tease apart and trim roots whentransplanting into the garden.", "Around the average last day offrost, set hardened-off transplants 4 to 8 inches deep, 4 to 6 inchesapart, in rows 20 inches apart. Deep planting reduces need for hillingto blanch the base of the plants. Transplants should be about 6 to 12inches tall - the bigger, the better. Only a few inches of leaf need toshow above the soil.", "Direct seed about 4 weeks before averagelast frost ½ inch deep, 1 inch apart, in rows 20 inches apart. Thin to4 to 6 inches apart.", "Hill or mound soil around stems severaltimes to blanch as leeks grow. (A single large hilling while plants areyoung can cause them to rot.) Or, place a portion of cardboard papertowel center around the lower part of the stem.", "Leeks haveshallow root systems and need consistent moisture and good weedcontrol. Water weekly if weather is dry, and mulch to retain moistureand suppress weeds.", "Pests:", "Onion maggot - Use floating row covers to prevent infestations.", "Thrips", "Diseases:", "Purple blotch (Alternaria porri)", "Botrytis leaf blight", "Varieties", "Browse", "leek varieties", "at our", "Vegetable Varieties for Gardeners", "website.", "Growearly or nonhardy varieties for summer harvest. They mature in aslittle as 50 days after transplanting and will withstand some frost.", "Growlate or hardy varieties for fall and winter harvest. They take can take100 or more days to mature, but can withstand heavy freezes. Ifwell-mulched in fall, they can be harvested through winter and intospring in many places.", "Elephant garlic (great-headed garlic) is a member of this species.  See garlic for more information.", "Some varieties recommended for New York include:", "American Flag", "Broad London", "Electra", "King Richard", "Pancho", "©2006", "Cornell University", ". All rights reserved."], "Image_Url": "https://duckduckgo.com/i/7e5d69d2.jpg"}, "Lettuce": {"Sunlight Conditions": "full sun", "Plant Lifecycle": "annual", "Plant Care Difficulty": "easy", "Height": "0.5 to 2 feet", "Spread": "0.5 to 2 feet", "Optimal Germination Temperature": "40 F to 85 F       - Seed can go dormant at high temperatures.  Best germination is below 70 F.", "Time to Germination": "Days to emergence: 7 to 14       - Germinates in about a week at 50 F, 2 days at 70 F.", "Soil Depth": "3 Inches", "Full Summary": ["Lettuce", "Vegetable (Cool Season) - Salad Greens", "Lactuca sativa", "Asteraceae Family", "With the variety of colors, shapes and flavors available, your saladsmay never be the same. Lettuce is adapatable to many growingconditions, but likes it cool - around 60 F to 65 F. Grow in spring andfall, and slow bolting by shading summer crops.", "Site and Plant Characteristics", "Growing Information", "Varieties", "Site Characteristics", "Sunlight:", "full sun", "part shade", "Yields best in full sun.  Part shade helpful when it’s hot.", "Soil conditions:", "requires well-drained soil", "Tolerant of a wide range of soils, but prefers well-drained, cool,loose soil with plentiful moisture and pH 6.2 to 6.8. Sensitive to lowpH. Lime to at least 6.0.", "Special locations:", "outdoor containers", "Plant Traits", "Lifecycle:", "annual", "Ease-of-care:", "easy", "Height:", "0.5 to 2 feet", "Spread:", "0.5 to 2 feet", "Foliage color:", "light green", "medium green", "dark green", "red", "purple", "variegated", "Foliage texture:", "medium", "Shape:", "cushion, mound or clump", "Romaine (Cos) varieties tend toward upright.", "Special Considerations", "Tolerates:", "frost - Will withstand light to moderate frost.  Hardened seedlings more tolerant than mature plants.", "Special characteristics:", "not native to North America - Mediterranean origin.  Was cultivated by Egyptians 6,500 years ago.", "Special uses:", "edible landscaping", "Growing Information", "How to plant:", "Propagate by  seed", "Germination temperature: 40 F to 85 F - Seed can go dormant at high temperatures.  Best germination is below 70 F.", "Days to emergence: 7 to 14 - Germinates in about a week at 50 F, 2 days at 70 F.", "Seed can be saved 1 year.", "Maintenance and care:", "Direct seed or transplant in early spring, as soon as you can work thesoil. To get an early start, prepare beds the previous fall by workingin manure or compost and raking smooth to leave a fine seedbed.", "Direct-seeding:", "Sow seed 1/8 inch deep, 1 inch apart in rows 12 to 18 inches apart.When plants have two or three true leaves, thin to 12-inch spacings forcrisphead varieties, 6 to 10 inches for other types. You can alsolightly broadcast seed (particularly of looseleaf varieties) in a patchinstead of a row.", "Transplants:", "Sow in 1-inch cells 3 to 4weeks before transplanting outside. Harden seedlings by reducing waterand temperature for 3 days before transplanting. Hardened plants shouldsurvive 20 F. Space crisphead transplants 12 inches apart in rows 18inches apart. Space other varieties 6 to 10 inches apart in rows 12 to18 inches apart.", "Seeds need light to germinate, so do not plant too deep.", "Make succession plantings every week or two.  Grow several varieties with different maturity dates for a continuous supply.", "Lettucehas a shallow root system. Keep soil moist to keep plants growingcontinuously. Mulch to retain moisture and suppress weeds (unless slugsare a problem).", "Moisture stress and high temperatures,particularly at night, encourage bolting. As the season progresses,plant more bolt-resistant varieties. Locate plants where they will bepartially shaded by taller nearby plants, latticework or other screen.", "Userow covers to protect very early plantings from cold, to protect youngplants from insects, and (supported by hoops) to shade crops when warmweather arrives.", "For fall crops, time maturity around time of first expected frost.  Mature plants aren’t as tolerant of freezing as seedlings.", "Pests:", "Aphids", "Leafminers", "Leafhoppers", "Cabbage loopers", "Cutworms", "Wireworms", "Slugs", "Diseases:", "Damping off", "Downy mildew", "Mosaic", "Fusarium", "Varieties", "Browse", "lettuce varieties", "at our", "Vegetable Varieties for Gardeners", "website.", "There are five main types of lettuce:", "Looseleaf", "(var. crispa) - Easy to grow. Matures quickly. You can start harvestingleaves as soon as 4 weeks after planting. Great for early-seasonplantings. Wide variety of leaf shapes and colors. 45 to 60 days tofull maturity.", "Butterhead", "(bib, loosehead, Boston) -Exceptionally good flavor and quality.   Forms looseheads with oily leaves. 55 to 75 days to maturity.", "Romaine", "(Cos, var. longfolia) - Upright, elongated heads. (Some grow nearly 2feet tall.) More tolerant of warm weather and less likely to bolt thanother lettuce types. Red varieties as well as traditional light green.Most take about 70 days to mature.", "French", "(summer crisp) -Midway between butterhead and crisphead.   You canharvest early like leaf lettuce or wait until headsform.   50 to 75 days.", "Crisphead", "(iceberg,var. capitata) - The familiar spherical heads found in grocery stores.Most difficult varieties to grow. Requires long cool season. Bestchance of success is by setting out transplants in early spring. Willbolt quickly in response to stress. 75 or more days.", "Choose slow-bolting varieties for later plantings that may encounter hot weather.", "Some varieties recommended for New York include:", "Looseleaf:", "Black Seeded Simpson", "Green Ice", "Ibis", "Lollo Rossa", "New Red Fire", "Oak Leaf", "Prizehead", "Red Sails", "Ruby", "Salad Bowl", "Slobolt", "Romaine:", "Cosmo Savoy", "Green Towers", "Little Gem", "Parris Island", "Valmaine (a.k.a Paris White or Valmaine Savoy)", "Butterhead:", "Buttercrunch", "Esmerelda", "Four Seasons", "Sangria", "Winter Density", "French:", "Sierra", "Crisphead (Iceberg):", "Great Lakes (Fall)", "Ithaca", "Summertime", "Tom Thumb", "©2006", "Cornell University", ". All rights reserved."], "Image_Url": "https://duckduckgo.com/i/538c6d5e.jpg"}, "Melons": {"Sunlight Conditions": "full sun", "Plant Lifecycle": "annual", "Plant Care Difficulty": "moderately difficult", "Height": "1 to 1.5 feet", "Spread": "3 to 12 feet", "Optimal Germination Temperature": "60 F to 95 F", "Time to Germination": "Days to emergence: 3 to 5       - In very warm (90 F) soil.  About 10 days at 70 F.", "Soil Depth": "3 Inches", "Full Summary": ["Melons", "Vegetable (Warm Season) - Cucurbit", "Also known as muskmelon, cantaloupe, honeydew melon", "Cucumis melo", "Cucurbitaceae Family", "Heat-loving melons can be a challenge to grow in cooler regions of NewYork. To increase success, choose short-season varieties, start theminside, warm soil with black plastic or IRT mulch, and protect youngplants with fabric row covers.", "Site and Plant Characteristics", "Growing Information", "Varieties", "Site Characteristics", "Sunlight:", "full sun", "Soil conditions:", "requires high fertility", "Prefers warm, well-drained, soil, high in organic matter with pH 6.5 to7.5. Consistent, plentiful moisture needed until fruit is about thesize of a tennis ball. Soil temperatures below 50 F slow growth.Consider using black plastic and fabric row covers to speed soilwarming. Sandy or light-textured soils that warm quickly in spring arebest.", "Special locations:", "outdoor containers - Bush varieties can be grown in large containers on patios, decks, etc.", "Plant Traits", "Lifecycle:", "annual", "Tender annual.", "Ease-of-care:", "moderately difficult", "Inmany areas of New York, successful crops require starting plantsindoors, using plastic mulch to warm soil, and fabric row covers toprotect young transplants.", "Height:", "1 to 1.5 feet", "Spread:", "3 to 12 feet", "Foliage color:", "medium green", "Foliage texture:", "coarse", "Shape:", "low and trailing", "climbing / vine", "Special Considerations", "Special characteristics:", "not native to North America - Origins uncertain.  Has been cultivated since ancient time in Asia, West Africa and Mediterranean regions.", "Growing Information", "How to plant:", "Propagate by  seed", "Germination temperature: 60 F to 95 F", "Days to emergence: 3 to 5 - In very warm (90 F) soil.  About 10 days at 70 F.", "Seed can be saved 4 years.", "Maintenance and care:", "If you have long, hot growing seasons direct-seed into garden. Toensure ripening in areas with shorter growing seasons and coolerweather, choose fast-maturing varieties, start plants inside, use blackor IRT plastic mulch to warm soil and use fabric row covers to protectplants.", "Direct-seed1 to 2 weeks after average last frost when soil is 70 F or warmer.Plant ½ inch deep, 6 seeds per hill, hills 4 to 6 feet apart; or 1 footapart in rows 5 feet apart. Can plant at closer spacings if trellised.Thin to 2 to 3 plants per hill.", "For transplanting, sow seedsindoors ¼ inch deep in peat pots (2-inch square or bigger), 2 to 4weeks before setting out. Plants should have one or two true leaveswhen transplanted.", "Transplant at same spacings as direct-seededcrops - 2 to 3 plants per hill in hills spaced 4 to 6 feet apart, or 1to 2 feet apart in rows 5 feet apart. Transplants are delicate androots are sensitive to disturbance. If you need to thin, use scissors.Keep soil intact around plant when transplanting.", "Mulch plants after soil has warmed to help maintain consistent moisture and suppress weeds.", "If using fabric row covers, remove at flowering to allow pollination by bees.  Good pollination is critical to fruit set.", "Plantsrequire consistent moisture until pollination. Once fruits are aboutthe size of a tennis ball, only water if soil is dry and leaves showsigns of wilting.", "To prevent insect damage to developing fruits, place melons on pots or pieces of wood.", "Ifgrowing melons on a trellis, support fruit with slings made fromnetting, fabric, or pantyhose. Trellising improves air circulationaround plants and can help reduce foliar disease problems. Choosesmall-fruited varieties and reduce plant spacing.", "For largeplantings, leave a strip of rye cover crop every second or third rowperpendicular to prevailing winds to protect plants from damaging wind.", "Toreduce insect and disease problems, avoid planting cucumber familycrops (melons, squash, pumpkins) in the same spot two years in a row.", "Pests:", "Striped or spotted cucumber beetles - Construct tents of fine nettingor cheesecloth or use floating row cover over young plants. Put inplace at planting and remove at flowering. Control beetles to preventbacterial wilt.", "Aphids- A hard stream of water can be used to remove aphids from plants. Washoff with water occasionally as needed early in the day. Check forevidence of natural enemies such as gray-brown or bloated parasitizedaphids and the presence of alligator-like larvae of lady beetles andlacewings.", "Squash vine borer - Cut open vines and remove by hand.", "Squash bugs - Handpick. Bury or compost plant residues after harvest.", "Fleabeetles - Use row crop covers to help protect plants from early insectdamage. Put in place at planting and remove at flowering. Control weeds.", "Diseases:", "Powdery mildew - Avoid crowding plants. Space apart to allow aircirculation. Eliminate weeds around plants and garden to improve aircirculation. In autumn rake and dispose of all diseased leaves andfruit. Choose varieties resistant to powdery mildew.", "Bacterialwilt - Remove and discard or destroy infested plants. Eliminateperennial weeds such as milk weed, marshcress and yellow rocket andavoid planting next to susceptible ornamentals.", "Fusarium wilt -Locate new plants in part of garden different from the previous year'slocation. Plant tolerant varieties such as Iroquois, Harper Hybrid,Saticoy, Pulsar or Athena.", "Fungal leaf spot - Avoid wettingfoliage if possible. Water early in the day so aboveground plant partswill dry as quickly as possible. Avoid crowding plants. Space apart toallow air circulation. Eliminate weeds around plants and garden area toimprove air circulation. In autumn, rake and dispose of all diseasedleaves or fruit. Verify diagnosis.", "Cucumber mosaic virus - Removeand destroy infested plants. Eliminate perennial weeds such asmilkweed, marshcress and yellow rocket and avoid planting next tosusceptible ornamentals.", "Scab - Avoid wetting foliage ifpossible. Water early in day so aboveground plant parts can dry asquickly as possible. Avoid crowding plants. Space apart to allow aircirculation.", "Varieties", "Browse", "melon varieties", "at our", "Vegetable Varieties for Gardeners", "website.", "See separate listing for", "watermelon", ".", "Typical eastern muskmelons (", "C. melo", "v.", "reticulatus", ")have heavily netted fruits with large seed cavities and a musky aromaand flavor. They are sometimes mistakenly called cantaloupes, whichbelong to the group", "C. melo", "v.", "Cantaloupensis", "and are seldom grown in North America.", "Another group of melons, sometimes referred to as winter melons (", "C. melo", "v.", "indorus", "),are difficult to grow in New York outside of Long Island because theyrequire a long, hot growing season. These include honeydew, Persian,Crenshaw and casaba melons. A fourth group of this variable species is", "C. melo", "v.", "conomon", ", which includes the Chinese cucumber or Oriental pickly cucumber.", "Whenchoosing varieties, match days to harvest with the length of yourgrowing season. (Keep in mind that you will plant well after the lastfrost date and want to make sure your crop ripens well before firstfrost in fall.) If you have a long enough season, choose varieties withdifferent maturity dates to spread out your harvest, or staggerplanting dates of a single variety.", "Bush varieties have morecompact vines, some just 3 feet long. Also base your variety choices ondisease resistance, fruit size (stick with smaller fruits inshort-season areas or if you plan to trellis the vines), flavor, andcolor.", "Some varieties recommended for New York include:", "Orange flesh:", "Ambrosia", "Gold Star", "Athena", "Burpee Hybrid", "Earliqueen", "Fastbreak", "Harper Hybrid", "Iroquois", "Pulsar", "Superstar", "Green flesh:", "Early Dew", "Passport", "Specialty:", "Charantais", "Edonis", "Galia", "Heirloom:", "Eel River", "Jenny Lind", "Rocky Ford", "Schoon's Hard shell", "©2006", "Cornell University", ". All rights reserved."], "Image_Url": "https://duckduckgo.com/i/3f7407d2.jpg"}, "Mizuna": {"Sunlight Conditions": "full sun", "Plant Lifecycle": "annual", "Plant Care Difficulty": "easy", "Optimal Germination Temperature": "45 F to 85 F       - Will germinate at soil temperatures as low as 40 F.", "Time to Germination": "Days to emergence: 4 to 7", "Soil Depth": "3 Inches", "Full Summary": ["Mizuna", "Vegetable (Cool Season) - Cabbage Family", "Also known as kyona", "Brassica rapa var. Japonica", "Brassicaceae Family", "Synonym:", "Brassica rapa nipposinica", "This Asian green is prized for its mild flavor in salads and stirfries, heat- and cold-tolerance, and fine leaves that form anattractive rosette.", "Site and Plant Characteristics", "Growing Information", "Varieties", "Site Characteristics", "Sunlight:", "full sun", "part shade", "Soil conditions:", "requires well-drained soil", "Though not as demanding as many cole crops, prefers well-drained,fertile soil high in organic matter, pH 6.0 to 7.5. Can tolerateslightly alkaline soil.", "Plant Traits", "Lifecycle:", "annual", "Ease-of-care:", "easy", "Foliage color:", "medium green", "Has contrasting white petioles and veins.", "Foliage texture:", "fine", "Deeply cut, fern-like leaves form an attractive rosette.", "Shape:", "cushion, mound or clump", "Special Considerations", "Tolerates:", "frost", "Special uses:", "edible landscaping", "Growing Information", "How to plant:", "Propagate by  seed", "Germination temperature: 45 F to 85 F - Will germinate at soil temperatures as low as 40 F.", "Days to emergence: 4 to 7", "Seed can be saved 4 years.", "Maintenance and care:", "From early spring to late summer, sow seeds ¼ to ½ inch deep, 1 inch apart in rows 18 inches apart.  Thin to 6-inch spacings.", "Plant every 2 weeks for continuous harvest.", "Use floating row covers to help protect from early insect infestations.", "To help reduce disease, do not plant mizuna or other cole crops in the same location more than once every three or four years.", "Pests:", "Flea beetles", "White flies", "Aphids", "Mizunagenerally suffers less insect damage than other cole crops. Usefloating row covers to prevent early season infestations.", "Diseases:", "Not as susceptible to diseases that often plague other cole crops.", "Varieties", "Browse", "mizuna varieties", "at our", "Vegetable Varieties for Gardeners", "website.", "©2006", "Cornell University", ". All rights reserved."], "Image_Url": "https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2Ftse1.mm.bing.net%2Fth%3Fid%3DOIP.jHVDzAhp_rGcF-eDgng8VQHaDx%26pid%3DApi&f=1"}, "Mustard greens": {"Sunlight Conditions": "full sun", "Plant Lifecycle": "annual", "Plant Care Difficulty": "easy", "Height": "0.5 to 2 feet", "Spread": "1 to 2 feet", "Optimal Germination Temperature": "45 F to 85 F       - Will germinate at soil temperatures as low as 40 F.", "Time to Germination": "Days to emergence: 4 to 7", "Soil Depth": "3 Inches", "Full Summary": ["Mustard greens", "Vegetable (Cool Season) - Cabbage Family", "Also known as Chinese mustard, Indian mustard", "Brassica juncea", "Brassicaceae Family", "This cool-season green adds a peppery zing to salads, and makes anattractive addition to ornamental plantings. When plants bolt, harvestflowers and seedpods for salads, too.", "Site and Plant Characteristics", "Growing Information", "Varieties", "Site Characteristics", "Sunlight:", "full sun", "part shade", "Benefits from some shading during warm weather.", "Soil conditions:", "requires well-drained soil", "Prefers well-drained, fertile soil high in organic matter, pH 6.0 to7.5. Can tolerate slightly alkaline soil. Needs plentiful, consistentmoisture.", "Plant Traits", "Lifecycle:", "annual", "Ease-of-care:", "easy", "Height:", "0.5 to 2 feet", "Spread:", "1 to 2 feet", "Bloom time:", "early summer", "mid-summer", "late summer", "Flower color:", "yellow", "Foliage color:", "medium green", "dark green", "red", "purple", "Some varieties have contrasting white or purples stems and veins, or have crinkled or savoyed leaves.", "Foliage texture:", "medium", "Shape:", "cushion, mound or clump", "Special Considerations", "Tolerates:", "frost - Tolerates light frost.", "Special uses:", "edible landscaping", "Growing Information", "How to plant:", "Propagate by  seed", "Germination temperature: 45 F to 85 F - Will germinate at soil temperatures as low as 40 F.", "Days to emergence: 4 to 7", "Seed can be saved 4 years.", "Maintenance and care:", "From early spring to late summer, sow seeds ¼ to ½ inch deep, 1 inchapart in rows 6 to 8 inches apart. Thin to 6-inch spacings for smallervarieties, or up to 18 inches for large ones.", "Plantevery 2 weeks for continuous harvest. Some plantings may bolt quicklyin response to increasing temperatures and day length. Hightemperatures and lack of moisture increase peppery taste.", "Use floating row covers to help protect from early insect infestations.", "To help reduce disease, do not plant mustards or other cole crops in the same location more than once every three or four years.", "Pests:", "Flea beetles", "White flies", "Aphids", "Mustardsgenerally suffer less insect damage than other cole crops. Use floatingrow covers to prevent early season infestations.", "Diseases:", "Not as susceptible to diseases that often plague other cole crops.", "Varieties", "Browse", "mustard varieties", "at our", "Vegetable Varieties for Gardeners", "website.", "Thereare many varieties to choose from, though most seed catalogs only offera few. Look for different days to maturity, size of plants, and formand color of leaves. Some cultivated mustards are species other than", "B. juncea", ", including", "B. nigra", "and", "Sinapsis alba", ".", "Some varieties recommended for New York include:", "Green Wave", "Red Giant", "©2006", "Cornell University", ". All rights reserved."], "Image_Url": "https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2Ftse1.mm.bing.net%2Fth%3Fid%3DOIP.HExYzKczlf_BTnA2zxxuPwHaE8%26pid%3DApi&f=1"}, "Orach": {"Sunlight Conditions": "full sun", "Plant Lifecycle": "annual", "Plant Care Difficulty": "easy", "Height": "4 to 6 feet", "Spread": "1 to 1.5 feet", "Optimal Germination Temperature": "50 F to 65 F", "Time to Germination": "Days to emergence: 7 to 14", "Soil Depth": "3 Inches", "Full Summary": ["Orach", "Vegetable (Cool Season) - Salad Greens, Vegetable (Warm Season) - Salad Greens", "Also known as Mountain spinach, French spinach, Giant Lambsquarters, Orache", "Atriplex hortensis", "Chenopodiaceae Family", "Touted as a warm-season alternative to spinach, orach is actually acool-season plant that just doesn’t go to seed (bolt) as quickly asspinach. Harvest leaves that are less-bitter than spinach into thesummer. Red varieties in particular make good ornamental plants, thoughcan reach 4 to 6 feet tall.", "Site and Plant Characteristics", "Growing Information", "Varieties", "Site Characteristics", "Sunlight:", "full sun", "part shade", "Soil conditions:", "tolerates droughty soil", "Prefers well-drained, fertile soils, high in organic matter, pH 6.5 to7.5. Tolerates alkaline soil and salt. Also tolerates drought, but hasbetter flavor if kept watered.", "Special locations:", "outdoor containers", "Plant Traits", "Lifecycle:", "annual", "Ease-of-care:", "easy", "Height:", "4 to 6 feet", "Spread:", "1 to 1.5 feet", "Foliage color:", "light green", "medium green", "dark green", "red", "purple", "yellow", "Depends on variety.", "Foliage texture:", "medium", "Shape:", "upright", "Special Considerations", "Tolerates:", "frost - tolerates moderate frost", "salt", "Special characteristics:", "not native to North America - Western Asia and Mediterranean origin.  Has been naturalized in much of North America.", "Special uses:", "edible landscaping", "Growing Information", "How to plant:", "Propagate by  seed  - Each husk from plants contains a single seed.", "Germination temperature: 50 F to 65 F", "Days to emergence: 7 to 14", "Seed can be saved 5 years.", "Maintenance and care:", "While touted as a warm-season alternative to spinach, orach is acool-season plant that is most productive and flavorful when grown inspring and fall. It is more tolerant of both heat and cold thanspinach. Harvest can continue into summer after spinach has gone toseed (bolted).", "About 2 to 3 weeks before last frost, sow seed ¼ to ½ inch deep, 2 inches apart, in rows 12 to 18 inches apart.", "Harvesttightly spaced plants when 4 to 6 inches tall, cutting them an inch ortwo above the soil in \"cut and come again\" style. Or thin plants atthis height to 6- to 18-inch spacings, eating the thinnings.", "Continueto harvest young leaves from older plants as they mature, leaving theolder leaves to help sustain the plants. Pinch off flower buds toencourage branching and more young, vegetative growth.", "Make succession plantings until weather warms.  Make mid-summer plantings for fall harvest.", "Pests:", "Aphids - A hard stream of water can be used to remove aphids fromplants. Wash off with water occasionally as needed early in the day.Check for evidence of natural enemies such as gray-brown or bloatedparasitized aphids and the presence of alligator-like larvae of ladybeetles and lacewings.", "Diseases:", "Seldom a problem in home gardens.", "Varieties", "Browse", "orach varieties", "at our", "Vegetable Varieties for Gardeners", "website.", "Red-,yellow- and green-leaved varieties are available, each with a slightlydifferent spinach-like flavor. Red varieties are prized in ornamentalplantings and edible landscaping. The yellow varieties are stillpopular in Europe - particularly France - because of their superiorflavor.", "©2006", "Cornell University", ". All rights reserved."], "Image_Url": "https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2Ftse1.mm.bing.net%2Fth%3Fid%3DOIP._W58c9dzTfe_Z4iPb2QOVQHaH0%26pid%3DApi%26h%3D160&f=1"}, "Parsnips": {"Sunlight Conditions": "full sun", "Plant Lifecycle": "annual", "Plant Care Difficulty": "moderately difficult", "Height": "2 to 3 feet", "Spread": "0.5 to 1 feet", "Optimal Germination Temperature": "50 F to 85 F", "Time to Germination": "Days to emergence: 10 to 21       - Germination may take as long as 3 to 4 weeks with soil temperature at 50 F.", "Soil Depth": "3 Inches", "Full Summary": ["Parsnips", "Vegetable (Cool Season) - Parsley Family", "Pastinaca sativa", "Umbelliferae Family", "Perhaps the hardiest of all garden crops, parsnips don’t develop theirsweet, nutty flavor until after enduring frosts and cold weather infall. Can be overwintered for harvest as soon as soil thaws in spring.", "Site and Plant Characteristics", "Growing Information", "Varieties", "Site Characteristics", "Sunlight:", "full sun", "part shade", "Yields best in full sun.", "Soil conditions:", "requires well-drained soil", "Prefers well-drained, loose, fertile soil, free of stones pH 6.0 to7.0. Heavy clay soils may cause crooked and branched roots. Needs afair amount of moisture.", "Plant Traits", "Lifecycle:", "annual", "Biennial grown as an annual.", "Ease-of-care:", "moderately difficult", "Requires deep, well-prepared soil, early planting, and good early weed control.", "Height:", "2 to 3 feet", "Spread:", "0.5 to 1 feet", "Foliage color:", "medium green", "Foliage texture:", "medium", "Shape:", "cushion, mound or clump", "Leaves arise from spherical swollen stem.", "Special Considerations", "Tolerates:", "frost", "Special characteristics:", "not native to North America - Mediterranean origin.", "Growing Information", "How to plant:", "Propagate by  seed", "Germination temperature: 50 F to 85 F", "Days to emergence: 10 to 21 - Germination may take as long as 3 to 4 weeks with soil temperature at 50 F.", "Seed can be saved 1 year. - Seed does not store well.", "Maintenance and care:", "Sow seeds ½ inch deep, 1 inch apart, in rows 18 to 24 inches apart, inearly spring.   Seeds germinate slowly, usually in about2 to 3 weeks (longer in cold soils). To speed germination, keep soilmoist. Sow along with radishes to break soil crust and mark row.", "Thin to 3- to 4-inch spacings.  Trim instead of pulling to avoid disturbing roots of remaining plants.", "Mulch to suppress weeds and retain moisture.", "Hill soil around base of plants to prevent greening of root shoulders.", "Pests:", "Avoid planting on ground that was in sod the previous season. Use fabric covers to exclude insects.", "Carrot weevil - Clean up garden debris in autumn. Beneficial nematodes are available. Apply as directed on label.", "Leafhopper - Leafhoppers spread disease. No cultural control is available.", "Varieties", "Browse", "parsnip varieties", "at our", "Vegetable Varieties for Gardeners", "website.", "Choose shorter-rooted varieties if your soil is not deep, light and stone-free.", "Varieties recommended for New York include:", "All American", "Harris' Model", "Hollow Crown", "©2006", "Cornell University", ". All rights reserved."], "Image_Url": "https://duckduckgo.com/i/cad3558d.jpg"}, "Peas": {"Sunlight Conditions": "full sun", "Plant Lifecycle": "annual", "Plant Care Difficulty": "easy", "Height": "1 to 8 feet", "Spread": "0.5 to 1 feet", "Optimal Germination Temperature": "40 F to 85 F       - Optimum around 75 F.", "Time to Germination": "Days to emergence: 9 to 13       - 9 days when soil is 60 F.  13 days at 50 F.   May take as long as 4 to 5 weeks at 40 F.", "Soil Depth": "3 Inches", "Full Summary": ["Peas", "Vegetable (Warm Season) - Other", "Also known as garden peas, shelling peas, snap peas, sugar peas, sugar snap peas, snow peas, Chinese peas, edible-podded peas,", "Pisum sativum", "Leguminosae Family", "Like sweet corn, peas are at their tastiest immediately after harvest.Whether you choose shell or edible-pod peas, they grow best duringspring and early summer when temperatures are between 60 F to 75 F.", "Site and Plant Characteristics", "Growing Information", "Varieties", "Site Characteristics", "Sunlight:", "full sun", "part shade", "Yields best in full sun.", "Soil conditions:", "requires well-drained soil", "Prefers well-drained soil, average fertility, high in organic matterwith pH 6.0 to 7.0. Widely adapted, but prefers cool, damp weather.Good soil structure is important. Avoid compacting soil by working itwhen it’s still too wet.", "Plant Traits", "Lifecycle:", "annual", "Ease-of-care:", "easy", "Height:", "1 to 8 feet", "Spread:", "0.5 to 1 feet", "Bloom time:", "mid-spring", "late spring", "early summer", "mid-summer", "Flower color:", "violet", "white", "Foliage color:", "light green", "blue-green", "Foliage texture:", "fine", "Leafless varieties are particularly fine.", "Shape:", "climbing / vine", "Shape in flower:", "same as above", "Special Considerations", "Tolerates:", "frost - Can tolerate moderate freezes. Less sensitive to freezing inspring than in fall. Light damage to shoots can actually encourage moresecondary shoots and result in more pods per plant.", "Special characteristics:", "not native to North America - Domesticated by Neolithic farmers in the Near East at least 8,000 to 9,000 years ago.", "Special uses:", "edible landscaping", "Growing Information", "How to plant:", "Propagate by  seed", "Germination temperature: 40 F to 85 F - Optimum around 75 F.", "Days to emergence: 9 to 13 - 9 days when soil is 60 F.  13 days at 50 F.   May take as long as 4 to 5 weeks at 40 F.", "Seed can be saved 3 years.", "Maintenance and care:", "Sow seed in spring as soon as you can work the soil - as early as lateMarch or early April depending on how quickly the soil warms and dries.Peas planted in cold soil (40 F) are slow to germinate. Later plantingsmade when the soil is warmer (60 F or more) often catch up quickly withearlier plantings. Use raised beds if your soil is slow to drain.", "Makeadditional plantings through early- to mid- May, or plant varietieswith different maturity dates to increase the harvest period.", "Plantseeds 1 to 2 inches deep, 1 to 4 inches apart in rows 18 inches apart.Or sow about 1 inch apart in a 3-inch-wide band (about 25 seeds perfoot).   Shallow planting is best when soils are cooland wet. Plant deeper if soil is dry. A quick way to seed is to make afurrow or trench with a hoe, place seed in the furrow, cover and firm.Do not thin.", "Erect trellis for tall-growing, vining types atplanting using chicken wire, brush or other suitable trellis material.If trellising, increase row spacing to 4 to 6 feet.", "Keep soil moist, but avoid heavy watering during flowering, which can interfere with pollination.", "Intercroppeas with fast-growing cool-season crops such as spinach or radishes.After final harvest, follow with late squash plantings orfall-harvested cool-season crops such as broccoli, leeks or potatoes.", "Sowfall crops about 8 to 10 weeks before first frost date. Fall crops canbe disappointing if hot weather persists. Powdery-mildew-resistantvarieties are best for fall crops.", "Do not use high-nitrogenfertilizers. Too much nitrogen will result in lush foliage but poorflowering and fruiting. Inoculation with rhizobia bacteria may bebeneficial if peas have not been grown in the past.", "Do not plantpeas in the same place more than once in every 4 years. Avoid plantingwhere in places where peas have suffered before from root rot.", "Pests:", "Aphids - A hard stream of water can be used to remove aphids fromplants. Wash off with water occasionally as needed early in the day.Check for evidence of natural enemies such as gray-brown or bloatedparasitized aphids and the presence of alligator-like larvae of ladybeetles and lacewings.", "Seedcorn maggot - Avoid heavy manure or organic matter in the garden as they attract maggot flies and encourage egg laying.", "Diseases:", "Seed decay and seedling root rot - Locate new plants in a part of thegarden different from previous year's location. Plant as early aspossible. Improve soil drainage.", "Wilt- Locate new plants in a part of the garden different from previousyear's location. Plant as early as possible. Improve soil drainage", "Powderymildew - Avoid wetting foliage if possible. Water early in the day soaboveground plant parts will dry as quickly as possible. Avoid crowdingplants. Space apart to allow air circulation. Eliminate weeds aroundplants and garden area to improve air circulation. Practice plantsanitation. When plants are not wet, carefully remove and destroy ordiscard affected plant parts. In autumn, rake and dispose of all fallenor diseased leaves and fruit.", "Varieties", "Browse", "pea varieties", "at our", "Vegetable Varieties for Gardeners", "website.", "Varieties fall into three major groups:", "Shell peas", "(var.", "sativum", "):  You remove the peas from the fibrous pod.  Some varieties (petite pois) are bred to be picked when small.", "Edible-podded peas", "(var.", "macrocarpon", "):  You eat the plump pods and peas together.  Often called snap peas.  Snow peas belong to this group, but have flat pods.", "Dry peas or field peas", "(var.", "arvense", "):  You allow these to mature and harden, then dry, store and cook for soups and other dishes.", "Lookfor different maturity dates and heights. Some bush varieties grow just1 to 2 feet tall and need little or no support. Bush varieties producea determinate number of flowers and fruit. Viny types may grow 5 to 6feet or more and need trellising for good yields and easy picking. Theycontinue producing an indeterminant number of flowers and fruit over aprolonged period.", "If growing fall crops, look for powdery-mildew-resistant varieties.", "Some varieties recommended for New York include:", "Early shell:", "Knight", "Little Marvel", "Maestro", "Novella II", "Olympia", "Progress No. 9", "Sparkle", "Late shell:", "Bolero", "Frosty", "Green Arrow", "Lincoln", "Mr. Big", "Wando", "Snow pea:", "Dwarf Gray Sugar", "Little Sweetie", "Mammoth Melting Sugar", "Oregon Sugar Pod II", "Edible pod (Snap) pea:", "Early Snap", "Sugar Ann", "Sugar Snap", "Super Sugar Mel", "©2006", "Cornell University", ". All rights reserved."], "Image_Url": "https://duckduckgo.com/i/17190eee.jpg"}, "Potatoes": {"Sunlight Conditions": " A nutritional mother lode, potatoes are easy to grow as long as they have full sun, moderate temperatures, and light, rich, acidic, well-drained soil. Try varieties with colors, shapes and flavors you won't find in the supermarket. ", "Plant Lifecycle": "annual", "Plant Care Difficulty": "easy", "Height": "1.5 to 3 feet", "Spread": "1.5 to 3 feet", "Optimal Germination Temperature": "40 F       - Do not plant seed potatoes until soil reaches 40 F.", "Time to Germination": "Days to emergence: 14 to 28       - Sprouts from seed potatoes should emerge in 2 to 4 weeks depending on soil temperature.", "Soil Depth": "3 Inches", "Full Summary": ["Potatoes", "Vegetable (Warm Season) - Other, Root Crop", "Solanum tuberosum", "Solanaceae Family", "A nutritional mother lode, potatoes are easy to grow as long as theyhave full sun, moderate temperatures, and light, rich, acidic,well-drained soil. Try varieties with colors, shapes and flavors youwon't find in the supermarket.", "Site and Plant Characteristics", "Growing Information", "Varieties", "Site Characteristics", "Sunlight:", "full sun", "Requires at least 6 hours of sun each day.", "Soil conditions:", "requires acid soil", "requires well-drained soil", "Prefers well-drained, light, deep, loose soil, high in organic matter.Unlike most vegetables, potatoes perform best in acid soil with pH 4.8- 5.5. (Scab is less of a problem at low pH. If pH is more than 6.0,use scab-resistant varieties.) Needs plentiful, consistent moisture.", "Special locations:", "outdoor containers - Sometimes grown in barrels or stacks of old tires filled with compost.", "Plant Traits", "Lifecycle:", "annual", "Anherbaceous perennial grown as an annual in areas that receive frost.Late spring frosts can damage foliage, but growth will usually reboundquickly from underground parts.", "Ease-of-care:", "easy", "Growingis easy if you have the right site and soil. Pests aren't usually asbad in garden settings as in commercial fields. Fun to grow with kids,especially if you use the deep mulching method.", "Height:", "1.5 to 3 feet", "Spread:", "1.5 to 3 feet", "Flower color:", "violet", "Foliage color:", "medium green", "Foliage texture:", "medium", "Shape:", "cushion, mound or clump", "Flowers relatively inconspicuous.", "Shape in flower:", "same as above", "Special Considerations", "Special characteristics:", "not native to North America - Native to the Andes Mountains in South America.", "Growing Information", "How to plant:", "Propagate by  division or separation  - Grown from seed potatoes -- tubers grown the previous season.", "Germination temperature: 40 F - Do not plant seed potatoes until soil reaches 40 F.", "Days to emergence: 14 to 28 - Sprouts from seed potatoes should emerge in 2 to 4 weeks depending on soil temperature.", "Maintenance and care:", "Potatoes perform best in areas where summers are cool (65 F to 70 F), but are widely adapted.", "Potatoesrequire well-drained soil. (They will rot under prolonged cold, wetconditions.) If your soil is poorly drained or a heavy clay, considerusing raised beds. Adding organic matter (compost, cover crops,well-rotted manure or leaves) is a good way to improve soil beforegrowing potatoes. Go easy on organic matter sources high in nitrogen(such as manure) and nitrogen fertilizer as too much nitrogen canencourage lush foliage at the expense of tuber production.", "Unlikemost vegetables, potatoes perform best in acid soil with pH 4.8 - 5.5.Use scab-resistant varieties with pH above 6.0. Because most othergarden vegetables perform best at near-neutral pH, it’s usually notfeasible to grow potatoes in their preferred pH range, unless youdedicate one section of your garden to growing just potatoes inrotation with cover crops.", "Buy certified disease-free seedpotatoes from garden centers or through online or mail-order catalogsfor best results. If you save your own seed potatoes, discard any thatshow any signs of disease. Avoid planting potatoes from the supermarketbecause they may have been treated with sprout inhibitors. They mayalso be less vigorous and more prone to disease.", "Cut seedpotatoes that are larger than a chicken egg into pieces about 1 inchacross or slightly larger. Each piece should have at least one “eye”(the bud where the stem will grow from) -- preferably two eyes.Egg-sized and smaller tubers can be planted whole.", "Traditionally,cut seed potato pieces are allowed to cure for a few days to a fewweeks before planting. This is because the cut potatoes need highhumidity, plenty of oxygen and temperatures between 50 F and 65 F toheal quickly. If you have excellent, well-drained soil that meets thoseconditions, you can plant the seed pieces without curing. But ifconditions are not right, the seed potatoes will rot in the ground.", "Aless risky practice is to put about 5 pounds of cut potatoes into alarge grocery bag and fold the top closed. Keep the bag at roomtemperature for 2 or 3 days, then shake the bag to unstick pieces thatmay have stuck together. Let sit for another 2 to 3 days and then plant.", "Ifyou want fast emergence, keep the bag of cut potatoes at roomtemperature until sprouts appear. Some varieties are slow to breakdormancy and benefit from a 2- to 4-week “pre-warming” before planting.Others sprout in just a few days.", "Plant about 2 to 4 weeks beforeyour last frost date. The soil temperature should be at least 40 F. Donot plant where you've grown potatoes, tomatoes, peppers or eggplant inthe past 2 years.", "One common way to plant potatoes is to dig ashallow trench about 4 inches deep with a hoe. Place the seed potatopieces with their eyes up (cut sides down) about 8 to 12 inches apartin the trench, and replace soil. Space trenches about 2 to 3 feetapart. Stems and foliage should emerge in about 2 to 4 weeks, dependingon soil temperature.", "When the plants are about 6 to 8 inchestall, “hill” the potatoes by hoeing soil loosely around the base of theplants to within about an inch of the lower leaves from both sides ofthe row. Repeat in about 2 to 3 weeks. You may want to make additionalhillings, gradually building a 6- to 8-inch ridge down the row.(Hilling keeps the developing potatoes from being exposed to sun, whichturns them green and bitter. Green potatoes contain a chemical,solanine, which is toxic in large amounts.)", "Alternatively,snuggle seed pieces shallowly into the soil and cover with a thicklayer of clean straw or other weed-free mulch. Add more mulch as neededto keep light from reaching potatoes. (A foot or more of mulch may berequired.) Tubers grown this way can be easily harvested by pullingback the mulch after the plants die.", "A third method if you haveexcellent potato-growing soil is to plant seed potatoes 7 to 8 inchesdeep and skip hilling or deep mulching. The potatoes are slower toemerge, but this method requires less effort during the growing season.Deep planting is not good in cold, damp soils and it requires more workto dig the potatoes at harvest.", "Potatoes need at least 1 inch ofwater per week from either rainfall or deep watering. Mulching helpsretain moisture. Keeping the soil from drying out also helps reducescab.", "Use row covers to protect from Colorado potato beetles,leaf hoppers and flea beetles. Crush the yellow eggs of Colorado potatobeetles on the undersides of leaves. Remove adults by hand.", "Pests:", "Colorado potato beetles - Hand pick beetles, eggs and larvae.", "Aphids- A hard stream of water can be used to remove aphids from plants. Washoff with water occasionally as needed early in the day. Check forevidence of natural enemies such as gray-brown or bloated parasitizedaphids and the presence of alligator-like larvae of lady beetles andlacewings.", "Flea beetles - Use row covers to help protect plantsfrom early damage. Put in place at planting and remove beforetemperatures get too hot. Control weeds.", "Leaf hoppers", "Wash small nymphs off with a hard stream of water.", "Diseases:", "Early blight and Late blight - Use certified seed. Avoid wetting plantfoliage if possible. Water early in the day so abovegrounds plant partswill dry as quickly as possible. Avoid crowding plants. Space apart toallow air circulation. Eliminate weeds around plants and garden area toimprove air circulation. In autumn, rake and dispose of all fallen ordiseased leaves and tubers. Locate new plants in a part of the gardendifferent from previous year's location. Resistant or moderatelyresistant varieties include Allegany, Elba, Rosa and Sebago.", "Thefungus that causes late blight has recently become a major threat tohome gardens and commercial growers because of the migration of newstrains (genotypes) into the United States. The disease can readilyspread from home gardens to commercial fields. Verification of a lateblight diagnosis and implementation of prompt control measures arehighly recommended. The newly arrived strains are more aggressive thanprevious strains. Cultural control measures such as those listed abovemay not adequately control these new strains.", "Scab - Usecertified seed. Locate new plants in a part of the garden differentfrom previous year's location. Lower soil pH to 5.2 with sulfur. Plantresistant varieties: Chieftan, Norland, Russet Burbank, Russet Ruraland Superior.", "Viral diseases - Use certified seed.  Control aphids.", "Sweet potatoes", "require warmer temperatures and a longer season.", "Varieties", "Browse", "potato varieties", "at our", "Vegetable Varieties for Gardeners", "website.", "When choosing varieties, consider:", "Season:", "Spread out your harvest by choosing early (ready to harvest in about 65days), mid-season (80 days) and late (more than 90 days) varieties.", "Skin and flesh colors:", "Range from purple, red, pink, gold and yellow, in addition to the usualwhite. Potato varieties have a range of subtle flavors, too.", "Size:", "From huge baking potatoes to tiny fingerlings that bake or microwave quickly.", "Also look for", "scab-resistant varieties", "if soil pH is greater than 6.0.", "Some varieties recommended for New York include:", "Early:", "Dark Red Norland", "Superior", "Mid Season:", "Chieftain - red, high yielding, large", "Reba", "Salem", "Yukon Gold", "Late Season:", "Elba", "Katahdin", "Specialty", "Adirondack Blue (dark purple skin and flesh)", "Adirondack Red (reddish-purple skin and red flesh)", "French Fingerling (small, long tubers with pink skin and yellow flesh)", "German Butterball (late maturity, round to oblong, golden skin, yellow flesh)", "Sweet potato varieties", ".", "©2006", "Cornell University", ". All rights reserved."], "Image_Url": "https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2Ftse1.mm.bing.net%2Fth%3Fid%3DOIP.Tpa5Zbu7FSnIwdFhBV1EqAHaE8%26pid%3DApi&f=1"}, "Pumpkins": {"Sunlight Conditions": "full sun", "Plant Lifecycle": "annual", "Plant Care Difficulty": "easy", "Height": "1.5 to 3 feet", "Spread": "5 to 15 feet", "Optimal Germination Temperature": "60 F to 105 F - Will not germinate in cold soil. Wait to plant until soil reaches at least 65 F -- preferably 70 F or more. Germinates best at 95 F.", "Time to Germination": "Days to emergence: 5 to 10       - Should germinate in less than a week with soil temperature of 70 F and adequate moisture.", "Soil Depth": "3 Inches", "Full Summary": ["Pumpkins", "Vegetable (Warm Season) - Cucurbit", "Cucurbita maxima, C. pepo, C. moschata, C. argyrosperma", "Cucurbitaceae Family", "With fertile soil and a long enough growing season, it's easy to growyour own Jack-o-lanterns -- if you have enough space. Choose varietiesbred for flavor if you want to make pies.", "Site and Plant Characteristics", "Growing Information", "Varieties", "Site Characteristics", "Sunlight:", "full sun", "Soil conditions:", "requires well-drained soil", "requires high fertility", "Prefers well-drained, fertile, loose soil, high in organic matter withpH between 5.8 and 6.8. Plentiful and consistent moisture is neededfrom the time plants emerge until fruits begin to fill out.", "Plant Traits", "Lifecycle:", "annual", "Tender annual", "Ease-of-care:", "easy", "If you have plenty of space, good soil and a long enough growing season, pumpkins are easy to grow.", "Height:", "1.5 to 3 feet", "Spread:", "5 to 15 feet", "Most varieties grow on vines that spread 8 feet or more. Even smaller bush types spread 5 feet or more.", "Bloom time:", "mid-summer", "late summer", "Flower color:", "yellow", "Foliage color:", "medium green", "Foliage texture:", "coarse", "Shape:", "low and trailing", "climbing / vine", "Shape in flower:", "same as above", "Special Considerations", "Special characteristics:", "native to North America - Originated in Central America.", "bears ornamental fruit - Usually orange (sometimes mottled with green), but some varieties, such as Lumina and Valenciano, are white.", "Growing Information", "How to plant:", "Propagate by  seed", "Germination temperature: 60 F to 105 F - Will not germinate in coldsoil. Wait to plant until soil reaches at least 65 F -- preferably 70 For more. Germinates best at 95 F.", "Days to emergence: 5 to 10 - Should germinate in less than a week with soil temperature of 70 F and adequate moisture.", "Seed can be saved 6 years.", "Maintenance and care:", "Pumpkins like warm soil and are very sensitive to frost. So don’t be ina rush to plant early in spring. Wait until danger of frost has passedand soil has warmed to about 70 F, or about 2 weeks after the lastfrost date.", "Unlessyou are trying to grow a long-season variety in an area that gets earlyfrosts, there’s really no need to start pumpkins inside. Instead,direct seed 1 to 1 1/2 inches deep into hills (which warm and drainearlier in the season) or rows. Sow 4 to 5 seeds per hill. Space hillsabout 4 to 8 feet apart, depending on the size of the vine. (Even someof the mini-fruited pumpkins grow on very largevines.)   When the plants are 2 to 3 inches tall, thinto 2 to 3 plants per hill by snipping off unwanted plants withoutdisturbing the roots of the remaining ones. In rows, sow seeds 6 to 12inches apart in rows 6 to 10 feet apart. Snip off plants to thin to oneplant every 18 to 36 inches.", "If you need to start plants early,plant inside in 2- to 3-inch pots or cells 3 to 4 weeks beforetransplanting outside. Sow 3 or 4 seeds per pot and thin to one or twoplants by snipping off the weaker plants to avoid damaging the roots ofthose that remain. Harden off by cutting back on water and reducingtemperature before transplanting. Plant transplants out in the gardenat the same final spacings above after all danger of frost has passed.", "Blackplastic mulch can speed growth, especially in cool, short-season areas.At the end of the season, remove or till in vines to reduce mildew. Userow covers to protect plants early in the season and to prevent insectproblems. Remove before flowering to allow pollination by insects orwhen hot weather arrives.", "Mulching plants helps retain moistureand suppress weeds. Mounding soil around the base of the plants candiscourage squash borers from laying eggs.", "Pests:", "Aphids - A hard stream of water can be used to remove aphids fromplants. Wash off with water occasionally as needed early in the day.Check for evidence of natural enemies such as gray-brown or bloatedparasitized aphids and the presence of alligator-like larvae of ladybeetles and lacewings.", "Squash bug - Handpick and destroy.  Bury or compost plant residues after harvest.", "Spidermites - Wash off with water occasionally as needed early in the day. Ahard stream of water can be used to remove many mites from plants.", "Squash vine borer - Remove by hand.", "Stripedcucumber beetles - Construct tents of fine netting or cheesecloth oruse floating row cover over young transplants and seedlings. Put inplace at planting and remove before temperatures get too hot inmidsummer. Control of beetles will help to prevent bacterial wilt.", "Diseases:", "Powdery mildew - Avoid wetting foliage if possible. Water early in theday so aboveground plant parts will dry as quickly as possible. Avoidcrowding plants. Space apart to allow air circulation. Eliminate weedsaround plants and garden area to improve air circulation.", "Bacterial wilt (", "Erwinia tracheiphila", ") -", "Remove and destroy infested plants.  Control any beetles which may spread the bacteria.", "Scab- Avoid wetting foliage if possible. Water early in the day soaboveground plant parts will dry as quickly as possible. Avoid crowdingplants. Space apart to allow air circulation.", "Other diseases:", "Viral diseases", "Downy mildew", "Varieties", "Browse", "pumpkin varieties", "at our", "Vegetable Varieties for Gardeners", "website.", "Whether they are", "Cucurbita pepo", "(the same species as summer squash)", "C. moschata, C. argyrosperma", "or", "C. maxima,", "most pumpkin varieties produce sprawling vines. If space is tight,there are a few bush or semi-bush varieties that take less space.", "If you plan to make pies rather than Jack-o-lanterns, look for varieties bred for flavor (most are", "C. moschata", ").  Ornamental types (most are", "C. pepo", ")range from tennis-ball-sized novelties (great for kids to decorate withpaint) to behemoths weighing hundreds of pounds (most are of thesegiants are", "C. maxima", ").  Lumina is a white pumpkin that is also great for painting.", "Some varieties, such as 'Triple Treat, are hulless, making them a great choice if you plan to toast the seeds for snacks.", "Some larger varieties require long growing seasons and may not mature in cooler areas of New York.", "Some varieties recommended for New York include:", "Mini:", "Baby Boo", "Jack-be-Little", "Munchkin", "Small:", "Baby Bear", "Baby Pam", "Lil' Ironsides", "Lumina", "Small Sugar", "Snackjack", "Medium to Large:", "Autumn Gold", "Gold Rush", "Howden", "Howdy Doody", "Jackpot", "Magic Lantern", "Racer", "Rocket", "Spooktacular", "Tom Fox", "Giant:", "Atlantic Giant", "Big Max", "Prizewinner", "©2006", "Cornell University", ". All rights reserved."], "Image_Url": "https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2Ftse1.mm.bing.net%2Fth%3Fid%3DOIP.x1E7QurwbjXj9BgZU2UspgHaFj%26pid%3DApi&f=1"}, "Radicchio": {"Sunlight Conditions": "full sun", "Plant Lifecycle": "annual", "Plant Care Difficulty": "moderately difficult", "Height": "0.5 to 1 feet", "Spread": "0.5 to 1 feet", "Optimal Germination Temperature": "45 F to 85 F       - 70 F to 75 F is optimum.", "Time to Germination": "Days to emergence: 7 to 10", "Soil Depth": "3 Inches", "Full Summary": ["Radicchio", "Vegetable (Cool Season) - Salad Greens", "Also known as  Italian chicory, chioggia, trevisio, radichetta", "Cichorium intybus", "Compositae Family", "The small red and white heads of this chicory family member form bestin cool weather. It is a staple in Italian salads with its bright colorand bitter - but not overpowering - flavor.", "Site and Plant Characteristics", "Growing Information", "Varieties", "Site Characteristics", "Sunlight:", "full sun", "part shade", "Benefits from partial shade during hot weather.", "Special locations:", "outdoor containers", "Plant Traits", "Lifecycle:", "annual", "Tender perennial grown as annual.", "Ease-of-care:", "moderately difficult", "Requires careful timing and still may be unpredictable.", "Height:", "0.5 to 1 feet", "Spread:", "0.5 to 1 feet", "Foliage color:", "medium green", "red", "variegated", "Most varieties are red with white midribs and veins.", "Foliage texture:", "medium", "Shape:", "cushion, mound or clump", "Special Considerations", "Tolerates:", "frost", "Special characteristics:", "not native to North America - Native to Eurasia and North Africa.", "Special uses:", "edible landscaping", "Growing Information", "How to plant:", "Propagate by  seed", "Germination temperature: 45 F to 85 F - 70 F to 75 F is optimum.", "Days to emergence: 7 to 10", "Seed can be saved 5 years.", "Maintenance and care:", "Usually direct-seeded as transplants tend to go to seed (bolt) prematurely.", "Culturalrequirements differ somewhat by variety, so consult seed sources forbest practices. Even so, this crop can be somewhat unpredictable. Ingeneral, plant older “forcing” varieties in spring, then cut backplants in late summer to produce heads about 4 to 6 weeks later. Newer“nonforcing” varieties do not need to be cut back, and will form headsin fall or even in summer. They generally do not hold their quality aslong as forcing varieties.", "Direct-seed about 4 to 6 weeks beforeaverage last frost. (Nonforcing varieties can be sown through throughmid-summer for fall and winter harvest.) Plant seeds ¼ to ½ inch deep,3 to 4 inches apart, in rows 24 inches apart. Thin to 10-inch spacings.", "Mulch to retain moisture and suppress weeds.", "Mulch crowns from harvested plants.  If conditions are mild, you may get an additional harvest in spring.", "Varieties", "Browse", "radicchio varieties", "at our", "Vegetable Varieties for Gardeners", "website.", "Lookfor either red- or green-heading types. Some red types turn red only incool weather. Heads are round (chioggia types) or elongated (trevisiotypes). Loose-leaf radichetta varieties also available.", "Traditionalolder varieties are typically grown through the summer, then cut backto induce heading as cool weather approaches. Newer varieties such as'Guilio' and 'Silla' are bolt-resistant and form heads without havingto be cut back. Even these can be somewhat unpredictable. Carefullystudy cultural recommendations from your seed supplier for each variety.", "See separate listing for endive, a closely related species,", "Cichorium endiva", ".", "See other listings for related crops of same species:  Cutting chicory and Belgian endive", "Some varieties recommended for New York include:", "Chioggia Red Preco No. 1", "©2006", "Cornell University", ". All rights reserved."], "Image_Url": "https://duckduckgo.com/i/a178ce84.jpg"}, "Radishes": {"Sunlight Conditions": "full sun", "Plant Lifecycle": "annual", "Plant Care Difficulty": "easy", "Height": "0.5 to 1.5 feet", "Spread": "0.5 to 0.75 feet", "Optimal Germination Temperature": "55 F to 85 F", "Time to Germination": "Days to emergence: 3 to 4", "Soil Depth": "3 Inches", "Full Summary": ["Radishes", "Vegetable (Cool Season) - Cabbage Family", "Also known as spring radishes, summer radishes, winter radishes, Oriental radishes, Daikon, Japanese radishes, Chinese radishes", "Raphanus sativus", "Brassicaceae Family", "Easy to grow and ready to harvest in just 3 to 6 weeks. Make plantingsof cool-season spring radishes every week or two for a continuousharvest until hot weather hits. Don’t forget winter varieties thatproduce large, fall-harvested roots.", "Site and Plant Characteristics", "Growing Information", "Varieties", "Site Characteristics", "Sunlight:", "full sun", "part shade", "Yields best in full sun.", "Soil conditions:", "requires well-drained soil", "Prefers well-drained, loose soil, high in organic matter, free fromstones, with pH 5.8 to 6.8. Needs plentiful, consistent moisture.", "Plant Traits", "Lifecycle:", "annual", "A few winter radish varieties are biennials.", "Ease-of-care:", "easy", "Height:", "0.5 to 1.5 feet", "Spread:", "0.5 to 0.75 feet", "Foliage color:", "medium green", "Foliage texture:", "medium", "Shape:", "cushion, mound or clump", "Special Considerations", "Tolerates:", "frost", "Special characteristics:", "not native to North America - Mediterranean origin", "Growing Information", "How to plant:", "Propagate by  seed", "Germination temperature: 55 F to 85 F", "Days to emergence: 3 to 4", "Seed can be saved 4 years.", "Maintenance and care:", "Grows best in cool (50 F to 65 F), moist weather. Hot weather reducesquality and increases pungency. Late plantings may bolt before edibleroot forms.", "About3 to 6 weeks before average last frost, direct seed ½ inch deep, 1 inchapart, in rows 12 inches apart. Thin to about 2-inch spacings. Crowdedplants may not produce high-quality roots. Use thinings in salads.", "Forcontinuous harvest, make additional plantings every 1 to 2 weeks untiltemperatures average in the mid 60s F, or plant varieties withdifferent maturity dates in a single planting. Resume planting whenweather cools in fall.", "Plant most winter varieties so that theymature around the first fall frost date. (Frost improves flavor andtexture of most winter varieties.) Larger winter varieties need morespace than spring varieties, so thin to about 6-inch spacings,depending on variety.", "Keep soil moist for uninterrupted growth and best quality.", "Adding nitrogen fertilizer or nitrogen rich manure close to planting may produce lush tops and small roots.", "Canbe sown in the same row with carrots, parsley, parsnips and other slowgerminating crops. The radishes help to break soil crust for the weakerand later-germinating crops.", "Because they mature quickly,radishes make a good intercrop along with slower growing crops, such asother cabbage family crops, or tomato- or squash family crops. Orfollow radish harvest with summer succession crops such as beans, orfall-harvested crops.", "To help reduce disease, do not plant radishes or other cole crops in the same location more than once every three or four years.", "Pests:", "Cabbage root maggots - Use row covers made of nonwoven fabrics. Hoopscan be used to make a tent area over rows or as floating row covers.For fresh radish, weekly plantings can be made. Some will avoid maggotattack.", "Diseases:", "Clubroot - Locate new plants in part of garden different from previousyear's location. If soil is infested, add lime to raise soil pH to 7.2.", "Varieties", "Browse", "radish varieties", "at our", "Vegetable Varieties for Gardeners", "website.", "Thefamiliar spring radishes are small and fast-growing - usually ready forharvest in 3 to 4 weeks. Select varieties based on size and shape(globe or cylindrical), color (including red, purple, white andcombinations) and bolt-resistance.", "Summer radishes are similar, but take slightly longer to mature -- usually in about 6 to 8 weeks.", "Winter radishes (", "Raphanus sativus", "var.", "niger", ")grow more slowly (usually 2 months or more to maturity), produce largerroots (usually cylindrical), and hold their quality much longer thancommon varieties. They are also known as Oriental, Daikon, Japanese,Chinese, or Spanish radishes. Most are biennials that do not bolt asreadily in response to long days, and only develop seedstalks afterexposure to cold temperatures. They are usually planted in summer forfall harvest.", "Varieties recommended for New York include:", "Champion", "Cherry Belle", "French Breakfast", "Icicle", "Scarlet Knight", "Sparkler", "©2006", "Cornell University", ". All rights reserved."], "Image_Url": "https://duckduckgo.com/i/14c232b2.jpg"}, "Rhubarb": {"Sunlight Conditions": "full sun", "Plant Lifecycle": "perennial", "Plant Care Difficulty": "easy", "Height": "2 to 3 feet", "Spread": "3 to 4 feet", "Soil Depth": "Up to 24 Inches", "Full Summary": ["Rhubarb", "Vegetable (Cool Season) - Other", "Rheum x cultorum", "Polygonaceae Family", "Synonym:", "Rheum rhabarbarum", "This tart, easy-to-grow perennial is great for pies and jams,especially when coupled with strawberries. It comes to life whentemperatures rise into the 40s F, making it one of the earliest springcrops.", "Site and Plant Characteristics", "Growing Information", "Varieties", "Site Characteristics", "Sunlight:", "full sun", "part shade", "Yields best in full sun.", "Soil conditions:", "requires well-drained soil", "Well-drained, deep, fertile soil, high in organic matter, pH 5.5 to 6.5.  Yields best with plentiful, consistent moisture.", "Hardiness zones:", "3 to 8", "Needs extended temperatures below 40 F.", "Plant Traits", "Lifecycle:", "perennial", "Ease-of-care:", "easy", "Height:", "2 to 3 feet", "Flower stalks may reach 5 feet tall.", "Spread:", "3 to 4 feet", "Bloom time:", "early summer", "Remove flower stalks to increase production.", "Flower color:", "white", "Foliage color:", "medium green", "Foliage texture:", "coarse", "Shape:", "cushion, mound or clump", "Shape in flower:", "flower stalks with upright spikes", "Special Considerations", "Tolerates:", "frost - Hard freezes in late spring can damage leaf stems.", "Special characteristics:", "not native to North America", "Special uses:", "edible landscaping", "Growing Information", "How to plant:", "Propagate by  division or separation  - All cultivars are hybrids and do not breed true from seed.", "Maintenance and care:", "Carefully consider location before planting this long-lived perennial.If possible, establish planting area and improve soil the season beforeplanting.", "Plantdormant crowns, as soon as you can work the soil in spring. You can cutcrowns into pieces, but make sure each has at least one strong bud.Plant 1 to 3 inches deep and 2 to 3 feet apart.", "Mulch to suppress weeds and retain moisture. Plants require little or no fertilizer.", "Removeflower stalks as they appear the first year to give strength todeveloping plant. Do not harvest any leaf stems until plants arewell-established the second year. Removing flower stalks helps plantschannel energy into leaf stem production.", "Growth slows and flowerstalks form when temperatures warm in summer. In cool regions, growthmay continue if you have adequate moisture and remove flower stalks. Inwarmer areas, growth may resume in fall - sometimes enough for a lightharvest.", "Horseradish makes a good companion crop, as both are long-lived perennials.", "Renovatebeds when plants become crowded and leaf stems small (usually in 5 to15 years) by dividing crowns and replanting in fall or spring.", "Toforce rhubarb in winter: Dig plant in autumn after dormancy but beforethe soil freezes. Pot with buds 1 inch below soil surface and keepoutside for at least 8 weeks with temperature below 40 F. Move potinside to cool, dark location. Keep soil moist, and rhubarb should beready to harvest in about 6 weeks. (Stalks will be well-developed, butleaves will be small and yellow.) Replant outside in spring.", "Pests:", "Rhubarb is relatively trouble-free.  Some potential pests include:", "Rhubarb curculio - Handpick adults.  Remove broadleaved weeds from area.", "Other pests:", "Potato stem borer", "Mites", "Diseases:", "Rhubarb is relatively trouble-free.  Some potential diseases include:", "Fungalleaf spot - Avoid wetting foliage if possible. Water early in the dayso aboveground plant parts will dry as quickly as possible. Avoidcrowding plants. Space apart to allow air circulation. Eliminate weedsaround plants and garden area to improve air circulation. Practiceplant sanitation. When plants are not wet, carefully remove and destroyor discard affected plant parts. In autumn, rake and dispose of allfallen or diseased leaves and stalks.", "Other diseases:", "Phytophtora crown rot - Can be a problem in poorly drained soils.", "Varieties", "Browse", "rhubarb varieties", "at our", "Vegetable Varieties for Gardeners", "website.", "Look for different stem colors -- pink, red or green.", "Ornamental varieties are different", "Rheum", "species.", "Some varieties recommended for New York include:", "Canada Red", "Crimson Red", "MacDonald", "Victoria", "©2006", "Cornell University", ". All rights reserved."], "Image_Url": "https://duckduckgo.com/i/b14202f5.jpg"}, "Rutabagas": {"Sunlight Conditions": "full sun", "Plant Lifecycle": "annual", "Plant Care Difficulty": "easy", "Optimal Germination Temperature": "45 F to 85 F       - Will germinate at soil temperatures as low as 40 F.  60 F is optimum.", "Time to Germination": "Days to emergence: 4 to 7", "Soil Depth": "3 Inches", "Full Summary": ["Rutabagas", "Vegetable (Cool Season) - Cabbage Family", "Also known as swedes, winter turnips, Swedish turnips, Russian turnips, Canadian turnips", "Brassica napus var. napobrassica", "Brassicaceae Family", "Synonym:", "Brassica napus var. rapifera", "Easy-to-grow softball-sized root crop is a favorite for fall and wintersoups and dishes, and can also be used raw in salads. Rutabagas areoften confused with turnips, but are sweeter flavored.", "Site and Plant Characteristics", "Growing Information", "Varieties", "Site Characteristics", "Sunlight:", "full sun", "part shade", "Soil conditions:", "requires well-drained soil", "tolerates low fertility", "Performs well on wide range of soils. Unlike most brassicas, does notrequire rich soils. High organic matter and/or nitrogen levels maycause poorly shaped roots. Loosen soil deeply or grow in raised beds toencourage good root development. Sensitive to boron deficiency.", "Plant Traits", "Lifecycle:", "annual", "Biennial grown as an annual.", "Ease-of-care:", "easy", "Foliage color:", "medium green", "Often a waxy blue-green", "Foliage texture:", "medium", "Shape:", "cushion, mound or clump", "Special Considerations", "Tolerates:", "frost", "Special characteristics:", "not native to North America - May have developed from cross between Old World cultivated", "B. oleracea", "and wild", "B. napa", ".", "Growing Information", "How to plant:", "Propagate by  seed", "Germination temperature: 45 F to 85 F - Will germinate at soil temperatures as low as 40 F.  60 F is optimum.", "Days to emergence: 4 to 7", "Maintenance and care:", "Plant seed 2 inches apart and ½ inch deep in rows 18 to 24 inches apartin early to mid-summer, about 3 months before expected harvest for mostvarieties. Thin to 6-inch spacings. Frost improves quality and flavor.", "Forearly crops, sow seed as soon as you can work the soil in spring. Donot wait until fall to harvest as roots will become woody and fibrous.", "Larger seeds germinate faster and may be ready for harvest as much as 5 to 6 weeks sooner than smaller seed.", "Tohelp reduce disease, do not plant rutabagas or other cole crops in thesame location more than once every three or four years.", "Use floating row covers to protect crop from early pests.", "Sustained mean temperatures above 80 F can cause excessively fast growth and root cracking.", "Pests:", "Flea beetles - Use row covers to help protect plants from early damage.Put in place at planting and remove before temperatures get too hot(midsummer). Control weeds.", "Cabbage root maggots - Use row covers.", "Diseases:", "Black leg", "Black rot", "Turnip mosaic virus", "Varieties", "Browse", "rutabagas varieties", "at our", "Vegetable Varieties for Gardeners", "website.", "Choosevarieties based on flesh color (yellow to white), shoulder color(green, purple), root size and shape, storability, flavor and texture.Most are ready for harvest in 90 to 100 days. Some are resistant toclubroot.", "Some varieties recommended for New York include:", "American Purple Top", "Thomson Laurentian", "©2006", "Cornell University", ". All rights reserved."], "Image_Url": "https://duckduckgo.com/i/0566f8ac.jpg"}, "Shallots": {"Sunlight Conditions": "full sun", "Plant Lifecycle": "perennial", "Plant Care Difficulty": "moderately difficult", "Height": "1 to 2 feet", "Spread": "0.5 to 1 feet", "Optimal Germination Temperature": "45 F to 95 F", "Time to Germination": "Days to emergence: 4 to 5", "Soil Depth": "Up to 24 Inches", "Full Summary": ["Shallots", "Vegetable (Cool Season) - Onion Family", "Also known as potato onion, multiplier onion (root)", "Allium cepa  var. aggregatum", "Alliaceae Family", "An easy-to-grow gourmet favorite, these perennial onions produce acluster of smaller bulbs instead of one large bulb. You can replantsmall bulbs for next year’s crop.", "Site and Plant Characteristics", "Growing Information", "Varieties", "Site Characteristics", "Sunlight:", "full sun", "part shade", "Soil conditions:", "requires well-drained soil", "Well-drained, average fertility, high in organic matter, neutral pH.Optimum pH is 6.2 to 6.8. Requires plentiful, even moisture for goodyields.", "Hardiness zones:", "2 to 9", "Plant Traits", "Lifecycle:", "perennial", "Usually grown as an annual.", "Ease-of-care:", "moderately difficult", "Easy if you have rich well-drained soil and good weed control.", "Height:", "1 to 2 feet", "Potato onions may grow more than 3 feet tall under optimum conditions.", "Spread:", "0.5 to 1 feet", "Foliage color:", "medium green", "Foliage texture:", "medium", "Shape:", "upright", "Special Considerations", "Tolerates:", "frost", "Special characteristics:", "not native to North America - Middle East origin", "Special uses:", "edible landscaping", "Growing Information", "How to plant:", "Propagate by seed, division or separation - Divide and replant atharvest, or save bulbs over winter to plant in spring. Plants seldomproduce viable seed in temperate regions.", "Germination temperature: 45 F to 95 F", "Days to emergence: 4 to 5", "Seed can be saved 1 year. - Longer if stored properly in cool, dry location.", "Maintenance and care:", "Can be direct-seeded, grown from transplants started inside, or from sets -- small bulbs grown from seed the previous season.", "Choosea weed-free, well-drained location. Raised beds are ideal. Shallots aregood for intercropping with other garden plants, especiallyearly-maturing spring greens. Do not plant where other onion familycrops have been grown in the past 3 years.", "Direct seed ½ inchdeep, ½ to 1 inch apart, in rows 10 to 18 inches apart, 2 to 4 weeksbefore average last frost. This rate will usually produce a single bulbfrom each plant. To produce clusters of bulbs, increase spacings to 6to 8 inches.", "Plant sets in fall or early- to mid-spring. Breakbulbs into individual cloves and plant about 1 inch deep so that topsare just covered, 6 inches apart, rows 12\" apart. You can cut largecloves into smaller pieces as long as head has some root on it. Mulchto reduce soil heaving and protect plants.", "Shallots have shallowroot systems and need consistent moisture and good weed control. (Becareful. Grass and shallot seedlings can be difficult to distinguish.)Water weekly if weather is dry, and mulch to retain moisture andsuppress weeds.", "Pests:", "Rarely damaged.", "Onion maggot -   Use floating row covers to prevent  infestations", "Thrips", "Diseases:", "Rarely damaged.", "Varieties", "Browse", "shallot varieties", "at our", "Vegetable Varieties for Gardeners", "website.", "French varieties have pinkish brown skin and pinkish purple flesh.", "Dutch varieties have orangish yellow skin, and are larger and more strongly flavored than the French varieties.", "Potatoonions are closely related to shallots, though they lack the gourmetreputation of their close cousins. Most are heirloom varieties withred, white or yellow bulbs.", "Some varieties maintain quality in storage longer than others.", "©2006", "Cornell University", ". All rights reserved."], "Image_Url": "https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2Ftse1.mm.bing.net%2Fth%3Fid%3DOIP.sBVNk4ON-cKKMWHakmd4OgHaEL%26pid%3DApi&f=1"}, "Spinach": {"Sunlight Conditions": "full sun", "Plant Lifecycle": "annual", "Plant Care Difficulty": "moderately difficult", "Height": "0.5 to 1 feet", "Spread": "0.5 to 1 feet", "Optimal Germination Temperature": "40 F to 75 F       - May fail to germinate in warm soils.", "Time to Germination": "Days to emergence: 6 to 10       - About 3 weeks at 50 F.  About 5 days at 77 F, but germination drops to about 30 percent .", "Soil Depth": "3 Inches", "Full Summary": ["Spinach", "Vegetable (Cool Season) - Salad Greens, Vegetable (Cool Season) - Spinach, Beets, Chard", "Spinacia oleracea", "Chenopodiaceae Family", "This easy-to-grow, nutritious, cool-season crop is among the firstgreens ready to harvest. But plant it early because it’s quick to turnbitter and go to seed (bolt) as the weather warms and the dayslengthen. Dark green color and handsome texture of savoyed varietiesare great for edible landscaping.", "Site and Plant Characteristics", "Growing Information", "Varieties", "Site Characteristics", "Sunlight:", "full sun", "part shade", "Soil conditions:", "requires well-drained soil", "Well-drained, fertile soil, high in organic matter. Plentiful,consistent moisture. Tolerates slightly alkaline soils but is sensitiveto acid soils. pH should be at least 6.0, but preferably in the 6.5 to7.5 range.", "Special locations:", "outdoor containers", "Plant Traits", "Lifecycle:", "annual", "Ease-of-care:", "moderately difficult", "Mustbe planted early and grown when temperatures are cool. Needs consistentmoisture. Will go to see (bolt) if too dry, or when days lengthen andtemperatures warm.", "Height:", "0.5 to 1 feet", "Spread:", "0.5 to 1 feet", "Foliage color:", "dark green", "Foliage texture:", "medium", "Varieties with savoyed (curly) leaves add interest for edible landscaping.", "Shape:", "cushion, mound or clump", "Special Considerations", "Tolerates:", "frost - Young plants can withstand temperatures as low as 15 F to 20 F.", "Special characteristics:", "not native to North America - Not known in wild.  Thought to be first cultivated in Afghanistan and Tajikistan.", "Special uses:", "edible landscaping", "Growing Information", "How to plant:", "Propagate by  seed", "Germination temperature: 40 F to 75 F - May fail to germinate in warm soils.", "Days to emergence: 6 to 10 - About 3 weeks at 50 F.  About 5 days at 77 F, but germination drops to about 30 percent .", "Seed can be saved 2 years.", "Maintenance and care:", "As soon as you can work the soil in spring, sow seed ½ inch deep, 1inch apart in rows 12 to 18 inches apart (or broadcast seed across awider area). Thin to 2- to 6-inch spacings. Closer spacings can stressplants and cause them to go to seed (bolt) sooner.", "Earlyplanting is critical as dry soil, heat and lengthening days alsoencourage bolting. Later plantings benefit from some light shade fromother crops. Follow early plantings with warm-season crops such astomatoes or beans.", "Make succession plantings every week or twountil average last frost date. Use bolt-resistant varieties for laterplantings. Sow again in mid- to late summer for fall harvest. Seeds donot germinate well in warm soil, so increase seeding rate tocompensate. Or pre-germinate seeds by placing them between sheets ofmoist paper towel in a plastic bag and refrigerating until they sprout.", "Spinachseedlings are difficult to transplant. For spring crops, start insideonly if your garden stays too wet in spring to allow direct seeding.Start transplants inside about 3 to 6 weeks before last frost.", "Spinachis shallow-rooted and requires consistent moisture to prevent bolting.Water to keep soil moist. Mulch after plants are well established tomaintain moisture and suppress weeks. Use floating row covers toprevent insect damage.", "Do not overfertilize with nitrogen. Onlyapply supplemental fertilizer if leaves are pale green. Add lime tomake sure pH is at least 6.0. You should suspect that your soil is tooacid if germination is poor and leaf tips and margins are yellow orbrown.", "Plant in fall and mulch heavily for early spring crop.", "Pests:", "Leaf miners - Cover plants with fine netting or cheesecloth or floatingrow cover to protect plants from adult flies. Handpick and destroyinfested (mined) leaves. Control weeds.", "Varieties", "Browse", "spinach varieties", "at our", "Vegetable Varieties for Gardeners", "website.", "Chooseslow-bolting varieties for later spring plantings. Disease resistanceis more important for fall crops. Savoyed (curly) leaves are handsomeand keep better, but are harder to clean.", "New Zealand spinach", "and", "Malabar spinach", "are warm-season greens similar to spinach, but different species.  See separate ", "s.", "Some varieties recommended for New York include:", "Spring:", "America", "Dark Green Bloomsdale", "Indian Summer", "Melody", "Space", "Tyee", "Summer:", "New Zealand spinach", "Malabar spinach", "Fall:", "Melody", "Tyee", "Winter Bloomsdale", "©2006", "Cornell University", ". All rights reserved."], "Image_Url": "https://duckduckgo.com/i/2f1e0dd4.jpg"}, "Malabar spinach": {"Sunlight Conditions": "full sun", "Plant Lifecycle": "annual", "Plant Care Difficulty": "moderately difficult", "Optimal Germination Temperature": "65 F to 75 F", "Time to Germination": "Days to emergence: 14 to 21       - Scarify seed to hasten germination.", "Soil Depth": "3 Inches", "Full Summary": ["Malabar spinach", "Vine, Vegetable (Warm Season) - Salad Greens", "Also known as Indian spinach, Ceylon spinach, basella, vine spinach", "Basella alba", "Basellaceae Family", "The leaves from this heat-loving vine have a mild flavor and are usedlike spinach in salads and cooking. Extremely frost-sensitive. Itcreeps when temperatures are cool, but leaps when the mercury hits 90F.", "Site and Plant Characteristics", "Growing Information", "Varieties", "Site Characteristics", "Sunlight:", "full sun", "Part shade increases leaf size, but prefers hot weather and full sun.", "Soil conditions:", "tolerates damp soil", "Grows well in a wide range of soils, but prefers moist, fertile soils,high in organic matter, pH 6.5 to 6.8. Requires consistent moisture tokeep from flowering, which causes leaves to turn bitter.", "Plant Traits", "Lifecycle:", "annual", "Grown as an annual, but is perennial in frost-free areas.", "Ease-of-care:", "moderately difficult", "In most of New York, you must start plants inside and transplant after danger of frost has passed.  Requires trellising.", "Foliage color:", "dark green", "Foliage texture:", "medium", "Shape:", "climbing / vine", "Special Considerations", "Special characteristics:", "not native to North America - East Asia origins.", "Special uses:", "edible landscaping", "Growing Information", "How to plant:", "Propagate by  seed, cuttings", "Germination temperature: 65 F to 75 F", "Days to emergence: 14 to 21 - Scarify seed to hasten germination.", "Seed can be saved 4 years.", "Maintenance and care:", "In Zone 7 and warmer, direct seed 2 to 3 weeks after last frost date.In colder areas or to get an earlier crop, start seeds inside about 6weeks before last frost.", "Scarifyseed (use a file, sharp knife or sandpaper to carefully cut through thetough seed coat) to speed germination, which may take 3 weeks or more.", "Waituntil soil has warmed and all danger of frost has passed beforetransplanting -- at least 2 to 3 weeks after last frost date. Spacetransplants about 12 inches apart.", "Well-adapted to hightemperatures, even into the 90s F. But growth is disappointing whentemperatures stay below 80 F. Requires consistent moisture to keep fromflowering, which causes bitterness in leaves.", "Requires trellis or other support for twining vine.  Can follow peas up the same trellis.", "Varieties", "Browse", "Malabar  spinach varieties", "at our", "Vegetable Varieties for Gardeners", "website.", "Seedcompanies usually only list the species. Occasionally, you can find thevariety ‘Rubra,’ which has purplish stems. It is sometimes listed as aseparate species, Basella rubra.", "©2006", "Cornell University", ". All rights reserved."], "Image_Url": "https://duckduckgo.com/i/1298dc64.jpg"}, "New Zealand spinach": {"Sunlight Conditions": "full sun", "Plant Lifecycle": "annual", "Plant Care Difficulty": "moderately difficult", "Height": "1 to 2 feet", "Spread": "1 to 3 feet", "Time to Germination": "Days to emergence: 14 to 21       - Soak seed 24 hours before planting to speed germination.", "Soil Depth": "3 Inches", "Full Summary": ["New Zealand spinach", "Vegetable (Warm Season) - Salad Greens", "Also known as tetragonia, ice plant, everbearing spinach, everlasting spinach, perpetual spinach, Della Nuova Zelanda", "Tetragonia tetragonoides", "Aizoaceae Family", "Synonym:", "Tetragonia expansa", "Used like spinach in cooking and salads, this frost-tender plant isready for harvest when spinach is on the wane, and stays productivethroughout summer. Also makes an attractive foliage plant for bordersand beds.", "Site and Plant Characteristics", "Growing Information", "Varieties", "Site Characteristics", "Sunlight:", "full sun", "Benefits from light shade in midsummer in warm regions.", "Soil conditions:", "tolerates droughty soil", "Tolerates a wide range of conditions, but prefers well-drained, sandysoils, rich in organic matter, pH 6.8 to 7.0. While somewhatdrought-tolerant, flavor is best with consistent moisture.", "Special locations:", "outdoor containers", "Plant Traits", "Lifecycle:", "annual", "Tender annual.", "Ease-of-care:", "moderately difficult", "Needs to be started inside in much of New York.", "Height:", "1 to 2 feet", "Spread:", "1 to 3 feet", "Foliage color:", "medium green", "Foliage texture:", "medium", "Shape:", "spreading mass", "Special Considerations", "Special characteristics:", "not native to North America - Native to New Zealand, Australia, southern South America, and some Pacific Islands, including Japan.", "Special uses:", "edible landscaping", "Growing Information", "How to plant:", "Propagate by  seed  - “Seeds” are actually fruits containing several seeds.", "Days to emergence: 14 to 21 - Soak seed 24 hours before planting to speed germination.", "Seed can be saved 5 years.", "Maintenance and care:", "“Seeds” are actually fruits that contain several seeds. Germination isslow and uneven. Soak seed 24 hours before planting to speedgermination.", "InZone 6 and warmer, direct seed after last frost about ¼ inch deep inhills spaced about 2 feet apart. Plant 3 seeds in each hill and thin tothe strongest plant. In cooler zones, start seed inside 3 to 4 weeksbefore last frost. Transplant about 2 to 3 weeks after last frost.", "While drought-tolerant, flavor is best with consistent moisture.  Mulch to retain moisture and suppress weeds.", "Varieties", "Browse", "New Zealand spinach varieties", "at our", "Vegetable Varieties for Gardeners", "website.", "Most sources offer just the generic species.  Occasionally the variety ‘Maori’ is listed.", "©2006", "Cornell University", ". All rights reserved."], "Image_Url": "https://duckduckgo.com/i/e02c4333.jpg"}, "Winter squash": {"Sunlight Conditions": "full sun", "Plant Lifecycle": "annual", "Plant Care Difficulty": "easy", "Height": "1.5 to 3 feet", "Spread": "3 to 15 feet", "Optimal Germination Temperature": "60 F to 105 F - Will not germinate in cold soil. Wait to plant until soil reaches at least 65 F -- preferably 70 F or more. Germinates best at 95 F.", "Time to Germination": "Days to emergence: 5 to 10       - Should germinate in less than a week with soil temperature of 70 F and adequate moisture.", "Soil Depth": "3 Inches", "Full Summary": ["Winter squash", "Vegetable (Warm Season) - Cucurbit", "Also known as Butternut squash, Acorn squash", "Cucurbita maxima, C. pepo, C. moschata", "Cucurbitaceae Family", "Winter squash are easy to grow -- if you have room. In addition to thefamiliar butternut and acorn squash, varieties come in a staggeringdiversity of fruit size, shape and color. Choose bush varieties ifspace is tight.", "Site and Plant Characteristics", "Growing Information", "Varieties", "Site Characteristics", "Sunlight:", "full sun", "Soil conditions:", "requires well-drained soil", "requires high fertility", "Prefers well-drained, fertile, loose soil, high in organic matter withpH between 5.8 and 6.8. Plentiful and consistent moisture is neededfrom the time plants emerge until fruits begin to fill out.", "Plant Traits", "Lifecycle:", "annual", "Tender annual", "Ease-of-care:", "easy", "Height:", "1.5 to 3 feet", "Spread:", "3 to 15 feet", "Most varieties grow on vines that spread 6 feet or more.  If space is tight, choose smaller bush or semi-bush varieties.", "Bloom time:", "mid-summer", "late summer", "Flower color:", "yellow", "Foliage color:", "medium green", "Foliage texture:", "coarse", "Shape:", "low and trailing", "climbing / vine", "Shape in flower:", "same as above", "Special Considerations", "Special characteristics:", "native to North America", "bears ornamental fruit", "Special uses:", "edible flowers - Flowers are sometimes battered and fried or stuffed.", "Growing Information", "How to plant:", "Propagate by  seed", "Germination temperature: 60 F to 105 F - Will not germinate in coldsoil. Wait to plant until soil reaches at least 65 F -- preferably 70 For more. Germinates best at 95 F.", "Days to emergence: 5 to 10 - Should germinate in less than a week with soil temperature of 70 F and adequate moisture.", "Seed can be saved 6 years.", "Maintenance and care:", "Squash like warm soil and are very sensitive to frost. So don’t be in arush to plant early in spring. Wait until danger of frost has passedand soil has warmed to about 70 F, or about 2 weeks after the lastfrost date.", "Unlessyou are trying to grow a long-season variety in an area that gets earlyfrosts, there’s really no need to start winter squash inside. Instead,direct seed ½ to 1 inch deep into hills (which warm and drain earlierin the season) or rows. Sow 4 to 5 seeds per hill. Space hills about 4to 8 feet apart, depending on the size of the fruit. (The larger theexpected size of the squash, the larger the vine and the farther apartyou should space the hills.)   When the plants are 2 to3 inches tall, thin to 2 to 3 plants per hill by snipping off unwantedplants without disturbing the roots of the remaining ones. In rows, sowseeds 6 to 12 inches apart in rows 4 to 8 feet apart. Snip off plantsto thin to one plant every 18 to 36 inches.", "If you need tostart plants early, plant inside in 2- to 3-inch pots or cells 3 to 4weeks before transplanting outside. Sow 3 or 4 seeds per pot and thinto one or two plants by snipping off the weaker plants to avoiddamaging the roots of those that remain. Harden off by cutting back onwater and reducing temperature before transplanting. Plant transplantsout in the garden at the same final spacings above after all danger offrost has passed.", "Black plastic mulch can speed growth,especially in cool, short-season areas. At the end of the season,remove or till in vines to reduce mildew. Use row covers to protectplants early in the season and to prevent insect problems. Removebefore flowering to allow pollination by insects or when hot weatherarrives.", "Mulching plants helps retain moisture and suppressweeds. Mounding soil around the base of the plants can discouragesquash borers from laying eggs.", "Pests:", "Squash bug - Hand pick.  Bury or compost plant residues after harvest.", "Squash vine borer - Remove  by hand.  Butternut squash is resistant.", "Stripedcucumber beetles - Construct tents of fine netting or cheesecloth oruse floating row cover over young plants. Put in place at planting andremove before flowering. Control of beetles may be a factor inpreventing bacterial wilt.", "Diseases:", "Bacterial wilt (", "Erwinia tracheiphila", ") - Remove and destroy infested plants.  Control cucumber beetles if they appear.", "Powderymildew - Avoid wetting foliage if possible. Water early in the day soaboveground plant parts will dry as quickly as possible. Avoid crowdingplants. Space apart and eliminate weeds around plants and garden areato improve air circulation.", "Scab - Avoid wetting foliage ifpossible.   Water early in the day so aboveground partscan dry as quickly as possible. Avoid crowding plants, Space apart andeliminate weeds around plants and garden area to improve aircirculation. In autumn, rake and dispose of all diseased leaves andfruit. Do not save your own seed.", "Viral disease -Remove anddestroy entire infested plant along with immediately surrounding soiland soil clinging to roots. Eliminate wild cucumber and milkweednearby. Control aphids early in the season.", "Other diseases:", "Downy mildew", "Varieties", "Browse", "winter squash varieties", "at our", "Vegetable Varieties for Gardeners", "website.", "Whether they are", "Cucurbita pepo", "(the same species as summer squash)", "C. moschata", ", or", "C. maxima", ", most varieties of winter squash produce sprawling vines.  If space is tight, grow bush or semi-bush varieties.", "Wintersquash come in a staggering array of sizes, shapes and colors. If yourseason is short, avoid varieties that require a long growing season(100 or more days).", "'Cornell's Bush Delicata' is a 2002All-America selection that combines the flavor or an heirloom Delicatawith good resistance to powdery mildew and compact growth habit.", "Some varieties recommended for New York include:", "Butternut:", "Bugle", "Harris Betternut", "Ponca Baby", "Waltham Butternut", "Zenith", "Acorn:", "Carnival", "Sweet Dumpling", "Table Ace", "Table King Bush", "Table Queen (a.k.a Ebony)", "Tuffy", "Buttercup/Kabocha Type:", "Ambercup", "Autumn Cup", "Burgess Buttercup", "Sweet Mama", "Sweet Meat", "Hubbard Type:", "Blue Ballet", "Hubbard", "Red Kuri", "Miscellaneous:", "Delicata", "Gold Nugget", "Harlequin", "Sweet Dumpling", "Vegetable Spaghetti", "©2006", "Cornell University", ". All rights reserved."], "Image_Url": "https://duckduckgo.com/i/c26f82da.jpg"}, "Swiss chard": {"Sunlight Conditions": "full sun", "Plant Lifecycle": "annual", "Plant Care Difficulty": "easy", "Height": "1 to 3 feet", "Spread": "0.5 to 2 feet", "Optimal Germination Temperature": "40 F to 95 F       - Optimum 85 F.", "Time to Germination": "Days to emergence: 5 to 7", "Soil Depth": "3 Inches", "Full Summary": ["Swiss chard", "Vegetable (Cool Season) - Spinach, Beets, Chard, Vegetable (Warm Season) - Salad Greens", "Also known as stem chard, spinach beet, leaf beet", "Beta vulgaris subsp. cicla", "Chenopodiaceae Family", "Grown for its tasty and nutritious leaves and leafstalks (petioles),chard is a good substitute for spinach in most recipes. Prefers coolweather, but lasts through summer without going to seed (bolting).Colorful leaves and petioles make it great for edible landscaping andornamental plantings.", "Site and Plant Characteristics", "Growing Information", "Varieties", "Site Characteristics", "Sunlight:", "full sun", "part shade", "Prefers full sun early in the season, part shade in summer when it’s warm.", "Soil conditions:", "requires well-drained soil", "Prefers deep, loose, fertile soil, high in organic matter, with pH 6.0to 7.0. Needs consistent moisture, especially as plants grow large.", "Plant Traits", "Lifecycle:", "annual", "Biennial grown as an annual.", "Ease-of-care:", "easy", "Requires thinning, but is otherwise relatively trouble-free.", "Height:", "1 to 3 feet", "Spread:", "0.5 to 2 feet", "Foliage color:", "medium green", "dark green", "red", "purple", "yellow", "Dependingon variety, leaves are dark to medium green, usually with red or whiteleafstalks and veins. ‘Bright Lights’ has leaf stalks that are red,white, orange, purple, gold, or pink.", "Foliage texture:", "coarse", "Shape:", "cushion, mound or clump", "upright", "Special Considerations", "Tolerates:", "frost - Tolerates moderate frosts, but don’t plant in very earlyspring. Some varieties will bolt (go to seed) prematurely if exposed toprolonged freezing temperatures.", "salt", "Special characteristics:", "not native to North America - Domesticated from wild species in the Eastern Mediterranean.", "Special uses:", "edible landscaping", "Growing Information", "How to plant:", "Propagate by  seed", "Germination temperature: 40 F to 95 F - Optimum 85 F.", "Days to emergence: 5 to 7", "Seed can be saved 4 years.", "Maintenance and care:", "Start planting about 2 to 3 weeks before last expected frost. Sow seeds½ to 1 inch deep, 2 to 6 inches apart, in rows 18 to 24 apart. Likebeets, chard “seeds” produce more than one plant, and so will requirethinning. Thin to 6- to 12-inch spacings.", "If you plan to harvest whole plants, make succession plantings through late summer.", "Delayplanting of ‘Ruby Red’ or ‘Rhubarb’ chard until after last frost. Thesevarieties may go to seed (bolt) if seed is exposed to freezingtemperatures.", "Start seed inside for earlier crops, or if you want to arrange different colored plants of the variety ‘Bright Lights.’", "Mulch plants to retain moisture and suppress weeds.", "Youcan begin harvesting when leaves reach usable size. Remove a leaf ortwo from each plant, or cut plants an inch or two above the soil forcut-and-come-again harvest. Avoid damaging the growing point in thecenter of the plant at harvest.", "As plants age, older leaves get tough.  Cut plants back to about 3 to 5 inches tall to encourage a flush of new, tender growth.", "Pests:", "Aphids", "Leaf miners", "Diseases:", "Leaf spot", "Downy mildew", "Varieties", "Browse", "Swiss chard varieties", "at our", "Vegetable Varieties for Gardeners", "website.", "Mostvarieties have either red or white stems. ‘Bright Lights’ – anAll-America selection in 1998 – features mild flavor and a rainbow ofstem colors (red, white, orange, purple, gold, pink) and bronze orgreen leaves.", "Swiss chard or stem chard has swollen midrib and petiole.  Leaf beets or spinach beets lack a swollen midrib and petiole.", "Some varieties recommended for New York include:", "Bright Lights", "Fordhook Giant", "Large White Ribbed", "Lucullus", "Rainbow", "Rhubarb", "Ruby Red", "©2006", "Cornell University", ". All rights reserved."], "Image_Url": "https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2Ftse1.mm.bing.net%2Fth%3Fid%3DOIP.AHuFROj8MUa53GyTOmfyAQHaEG%26pid%3DApi&f=1"}, "Turnips": {"Sunlight Conditions": "full sun", "Plant Lifecycle": "annual", "Plant Care Difficulty": "easy", "Optimal Germination Temperature": "45 F to 85 F       - Will germinate at soil temperatures as low as 40 F.", "Time to Germination": "Days to emergence: 4 to 7", "Soil Depth": "3 Inches", "Full Summary": ["Turnips", "Vegetable (Cool Season) - Cabbage Family", "Also known as summer turnips", "Brassica rapa var. rapa", "Brassicaceae Family", "Fast-growing spring turnip crops are best harvested while the weatheris still cool. The flavor of fall crops is improved by light frost.Don’t forget the greens which are delightful raw or cooked.", "Site and Plant Characteristics", "Growing Information", "Varieties", "Site Characteristics", "Sunlight:", "full sun", "part shade", "Soil conditions:", "requires well-drained soil", "Prefers well-drained, fertile soil high in organic matter, pH 6.0 to7.5. Can tolerate slightly alkaline soil. Needs plentiful, consistentmoisture. Loosen soil deeply or grow in raised beds to encourage goodroot development. Will tolerate less-than-ideal conditions, but poorsoil will slow growth and hurt quality and flavor.", "Plant Traits", "Lifecycle:", "annual", "Biennial grown as an annual.", "Ease-of-care:", "easy", "Foliage color:", "medium green", "Foliage texture:", "medium", "Deeply lobed or cut leaves on most varieties.", "Shape:", "cushion, mound or clump", "Special Considerations", "Tolerates:", "frost - Light frost improves flavor, but hard freezes will kill plant and damage roots.", "Special characteristics:", "not native to North America - Not known in the wild.  Probably developed in cooler parts of Europe.", "Growing Information", "How to plant:", "Propagate by  seed", "Germination temperature: 45 F to 85 F - Will germinate at soil temperatures as low as 40 F.", "Days to emergence: 4 to 7", "Seed can be saved 4 years.", "Maintenance and care:", "From early spring to late summer, sow seeds ¼ to ½ inch deep, 1 inchapart in rows 12 to 18 inches apart. Thin plants to 4- to 6-inchspacings.", "Plant every 2 weeks for continuous harvest.  Quality and flavor are best if harvested when whether is cool.", "Use floating row cover to protect crop from early pests.", "To help reduce disease, do not plant turnips or other cole crops in the same location more than once every three or four years.", "Pests:", "Flea beetles - Use row covers to help protect plants from early damage.Put in place at planting and remove before temperatures get too hot inmidsummer. Control weeds.", "Cutworms - Control weeds.  Cardboard collars around each plant give good protection.", "Other pests:", "Root maggots", "Cabbage loopers", "Cabbageworms", "Cabbage aphids", "Slugs and snails", "Nematodes", "Diseases:", "Black leg", "Black rot", "Turnip mosaic virus", "Whilesusceptible to the diseases that plague other cole crops, turnipdiseases usually aren’t a problem if grown in well-drained soil andharvested young.", "Varieties", "Browse", "turnip varieties", "at our", "Vegetable Varieties for Gardeners", "website.", "Lookfor a range of root size and shapes (globe, flat, cylindrical,egg-shaped), root color (most common are white, some with purpleshoulders), and maturity dates (most mature in 30 to 60 days). Caution:Some varieties are grown strictly for their greens and produce poorquality roots.", "Some varieties recommended for New York include:", "Gilfeather", "Purple Top White Globe", "Tokyo Cross", "©2006", "Cornell University", ". All rights reserved."], "Image_Url": "https://duckduckgo.com/i/7792eee4.jpg"}, "Vegetable amaranth": {"Sunlight Conditions": "full sun", "Plant Lifecycle": "annual", "Plant Care Difficulty": "easy", "Height": "1 to 3 feet", "Spread": "0.5 to 1.5 feet", "Optimal Germination Temperature": "70 F to 75 F       - Germinates best at soil temperatures above 68 F.", "Soil Depth": "3 Inches", "Full Summary": ["Vegetable amaranth", "Vegetable (Warm Season) - Salad Greens", "Also known as Chinese spinach, Tampala", "Amaranthus tricolor", "Amaranthaceae Family", "This warm-season salad green can help fill the gap between spring andfall harvest of cool-season greens. You can also cook it like spinachor use it in stir fries. Use variegated varieties as ornamentals.", "Site and Plant Characteristics", "Growing Information", "Varieties", "Site Characteristics", "Sunlight:", "full sun", "Soil conditions:", "tolerates low fertility", "Prefers light, fertile, well-drained soils, but grows under a wide range of conditions.", "Plant Traits", "Lifecycle:", "annual", "Tender annual.", "Ease-of-care:", "easy", "Height:", "1 to 3 feet", "Spread:", "0.5 to 1.5 feet", "Foliage color:", "medium green", "dark green", "red", "purple", "variegated", "Leaves may be all green, all red or maroon, or red in the center with green on the margins.", "Foliage texture:", "medium", "Variegated varieties are more finely textured.  Leaves are usually oval to heart shaped.", "Shape:", "cushion, mound or clump", "upright", "Pinching flower blossoms can help maintain low, bushy form.", "Shape in flower:", "inconspicuous flower", "Special Considerations", "Tolerates:", "heat", "Special characteristics:", "not native to North America - Native to tropical Asia", "Special uses:", "edible landscaping", "Growing Information", "How to plant:", "Germination temperature: 70 F to 75 F - Germinates best at soil temperatures above 68 F.", "Maintenance and care:", "Sow outside in late spring or early summer approximately 1-inch apart and ¼ to 1/8 inch deep.  Thin to 6 inches apart.", "Seeds require a minimum soil temperature of 50 F to germinate, but germinate much quicker at temperatures of 68 F or above.", "For earlier harvest, start plants inside and transplant after last frost.", "A tropical plant, amaranth grows best at temperatures between 70 F and 85 F.", "Do not use nitrogen fertilizer.  Leaves can accumulate excess nitrates.", "Varieties", "Some cultivars are grown as ornamentals.", "Browse", "vegetable amaranth varieties", "at our", "VegetableVarieties for Gardeners", "website.", "©2006", "Cornell University", ". All rights reserved."], "Image_Url": "https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2Ftse1.mm.bing.net%2Fth%3Fid%3DOIP.YRjnn984Nss4Q6YdjrdWKQHaHX%26pid%3DApi&f=1"}, "Watermelon": {"Sunlight Conditions": "full sun", "Plant Lifecycle": "annual", "Plant Care Difficulty": "moderately difficult", "Height": "1 to 2 feet", "Spread": "3 to 20 feet", "Optimal Germination Temperature": "60 F to 95 F", "Time to Germination": "Days to emergence: 3 to 5       - In very warm (90 F) soil.  About 10 days at 70 F.", "Soil Depth": "3 Inches", "Full Summary": ["Watermelon", "Vegetable (Warm Season) - Cucurbit", "Citrullus lanatus", "Cucurbitaceae Family", "Heat-loving watermelons can be a challenge to grow in cooler regions ofNew York. To increase success, choose short-season varieties, startthem inside, warm soil with black plastic or IRT mulch, and protectyoung plants with fabric row covers.", "Site and Plant Characteristics", "Growing Information", "Varieties", "Site Characteristics", "Sunlight:", "full sun", "Soil conditions:", "requires high fertility", "Prefers warm, well-drained, soil, high in organic matter with pH 6.5 to7.5. Consistent, plentiful moisture needed until fruit is about thesize of a tennis ball. Soil temperatures below 50 F slow growth.Consider using black plastic and fabric row covers to speed soilwarming. Sandy or light-textured soils that warm quickly in spring arebest.", "Special locations:", "outdoor containers - Bush varieties can be grown in large containers on patios, decks, etc.", "Plant Traits", "Lifecycle:", "annual", "Tender annual.", "Ease-of-care:", "moderately difficult", "Inmany areas of New York, successful crops require starting plantsindoors, using plastic mulch to warm soil, and fabric row covers toprotect young transplants.", "Height:", "1 to 2 feet", "Spread:", "3 to 20 feet", "Foliage color:", "medium green", "Foliage texture:", "coarse", "Shape:", "low and trailing", "climbing / vine", "Special Considerations", "Special characteristics:", "not native to North America", "Growing Information", "How to plant:", "Propagate by  seed", "Germination temperature: 60 F to 95 F", "Days to emergence: 3 to 5 - In very warm (90 F) soil.  About 10 days at 70 F.", "Seed can be saved 4 years.", "Maintenance and care:", "If you have long, hot growing seasons direct-seed into garden. Toensure ripening in areas with shorter growing seasons and coolerweather, choose fast-maturing, small-fruited cultivars, start plantsinside, and use black or IRT plastic mulch and fabric row covers towarm soil and protect plants.", "Directseed 1 to 2 weeks after average last frost when soil is 70 F or warmer.Plant ½ inch deep, 6 seeds per hill, hills 3 feet apart each way forbush varieties, or 3 feet apart in rows 8 feet apart for vining types.Thin to 2 to 3 plants per hill.", "For transplanting, sow seedsindoors ¼ inch deep in peat pots (2-inch square or bigger), 2 to 4weeks before setting out. Set outside 2 weeks after average last frost,3 plants per hill, hills 3 feet apart each way for bush varieties, or 3feet apart in rows 8 feet apart for vining types. Transplants aredelicate. Keep soil intact when transplanting.", "Mulch plantings after soil has warmed to help maintain consistent moisture and suppress weeds.", "If using fabric row covers, remove at flowering to allow pollination by bees.  Good pollination is critical to fruit set.", "Plantsrequire consistent moisture until pollination. Once fruit are about thesize of a tennis ball, only water if soil is dry and leaves show signsof wilting.", "To prevent insect damage to developing fruits, place watermelons on pots or pieces of wood.", "Ifgrowing melons on a trellis, support fruit with slings made fromnetting, fabric, or pantyhose. Trellising improves air circulationaround plants and can help reduce foliar disease problems. Choosesmall-fruited varieties and reduce plant spacing.", "Avoid planting cucumber family crops (melons, squash, pumpkins) in the same spot two years in a row.", "Pests:", "Striped or spotted cucumber beetles - Construct tents of fine nettingor cheesecloth or use floating row cover over young plants. Put inplace at planting and remove at flowering. Control beetles to preventbacterial wilt.", "Aphids- A hard stream of water can be used to remove aphids from plants. Washoff with water occasionally as needed early in the day. Check forevidence of natural enemies such as gray-brown or bloated parasitizedaphids and the presence of alligator-like larvae of lady beetles andlacewings.", "Squash vine borer - Cut open vines and remove by hand.", "Squash bugs - Handpick.  Bury or compost plant residues after harvest.", "Fleabeetles - Use row crop covers to help protect plants from early insectdamage. Put in place at planting and remove at flowering. Control weeds.", "Diseases:", "Powdery mildew - Avoid wetting plants if possible. Water early in theday so aboveground plant parts dry as quickly as possible. Avoidcrowding plants. Space apart to allow air circulation. Eliminate weedsaround plants and garden area to improve air circulation.", "Cucumbermosaic virus - Remove and destroy infested plants. Control cucumberbeetles and aphids as soon as they appear.", "Scab- Avoid wetting foliage if possible. Water early in day so abovegroundplant parts dry as quickly as possible. Avoid crowding plants. Spaceapart for air circulation.", "Fusarium wilt - Locate new plants in a part of the garden different from previous year's location.   Plant tolerant varieties.", "Other diseases:", "Anthracnose", "Phytophthora", "Varieties", "Browse", "watermelon varieties", "at our", "Vegetable Varieties for Gardeners", "website.", "Whenchoosing varieties, match days to harvest with the length of yourgrowing season. (Keep in mind that you will plant well after the lastfrost date and want to make sure your crop ripens well before firstfrost in fall.) If you have a long enough season, choose varieties withdifferent maturity dates to spread out your harvest, or staggerplanting dates of a single variety.", "Bush varieties have morecompact vines, some just 3 feet long. Also base your variety choices ondisease resistance, fruit size (stick with smaller fruits inshort-season areas or if you plan to trellis the vines), flavor, andcolor.", "Seedless varieties may have poor germination and early seedling vigor.", "Some varieties recommended for New York include:", "Crimson Sweet", "Moon & Stars", "Sugar Baby", "Yellow Baby", "Yellow Doll", "Seedless:", "Tri-X-Sunrise", "©2006", "Cornell University", ". All rights reserved."], "Image_Url": "https://duckduckgo.com/i/0bf631f8.jpg"}}